{
  "filename": "data_analyst_New_York__NY_page13_job14_Senior_Business_Analyst.html",
  "job_title": "Senior Business Analyst",
  "company": "Bristol-Myers Squibb",
  "location": "Princeton, NJ 08540•Hybrid work",
  "salary": "$91,290 - $110,622 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:29:02.078Z",
  "full_description": "\\n\nWorking with Us\nChallenging. Meaningful. Life-changing. Those aren't words that are usually associated with a job. But working at Bristol Myers Squibb is anything but usual. Here, uniquely interesting work happens every day, in every department. From optimizing a production line to the latest breakthroughs in cell therapy, this is work that transforms the lives of patients, and the careers of those who do it. You'll get the chance to grow and thrive through opportunities uncommon in scale and scope, alongside high-achieving teams. Take your career farther than you thought possible.\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives. Read more: careers.bms.com/working-with-us .\nSummary:\nAt Bristol Myers Squibb, we are inspired by a single vision-transforming patients' lives through science. Across oncology, hematology, immunology and cardiovascular disease, our colleagues advance innovations that drive meaningful change. We bring a human touch to every treatment we pioneer. Join us and make a difference.\nPosition Overview:\nThe Senior Business Analyst in the LIMS ELN and Entity Registration Platforms team will bridge scientific research needs and IT solutions, with a primary focus on Electronic Laboratory Notebooks/Laboratory Information Management Systems (ELN/LIMS) and the responsible adoption of Generative AI tools. This hands-on role partners with researchers, lab personnel, and IT to gather requirements, design solutions, and ensure effective implementation and support of ELN/LIMS capabilities, instrument connectivity, and GenAI-enabled workflows that improve data quality, speed of insight, and compliance.\nIf you want an exciting and rewarding career that is meaningful, consider joining our diverse team!\nDesired Candidate Characteristics\n\\n\n\\n\nStrong commitment to a career in technology with a passion for healthcare and impact on patients.\n\\n\nProven experience with ELN/LIMS in biotech/pharma research labs\n\\n\nDegree in Biological or Chemical Sciences with prior hands-on research experience.\n\\n\nKnowledge of molecular biology, antibody discovery, protein chemistry/biochemistry workflows and data management.\n\\n\nComfort translating scientific needs into system configurations, integrations, and training.\n\\n\nAbility to work collaboratively with scientists, IT colleagues, vendors, and contractors.\n\\n\nDemonstrated success operating within a matrixed organization and driving consensus.\n\\n\nStrong focus on user experience, change management, and adoption.\n\\n\nExcellent communication skills and agility to learn new tools and processes.\n\\n\nKey Responsibilities\n\\n\n\\n\nRequirements Gathering:\nCollaborate with scientists and lab managers to understand experimental workflows; document user needs, process maps, and data standards for ELN/LIMS and GenAI use cases.\n\\n\nSolution Design:\nPartner with platform engineers and vendors to design configurations (schemas, registration models, templates, routing), integrations (APIs/webhooks/ETL), roles/permissions, and audit/traceability aligned with BMS standards.\n\\n\nGenAI Enablement:\nIdentify high-value GenAI opportunities (e.g., protocol drafting, experiment summarization, semantic search, assay troubleshooting assistants); define guardrails, evaluation, and privacy controls; support pilots through scale-up.\n\\n\nInstrument & Data Connectivity:\nCoordinate instrument data capture, ensure metadata/FAIR practices, and support interoperability with analytics/warehouse environments.\n\\n\nDelivery & Support:\nManage backlogs and Jira boards; write user stories and acceptance criteria; plan and script UAT; develop training materials and conduct structured end-user training; provide post-go-live support.\n\\n\nCompliance & Quality:\nPartner with QA/Validation as applicable (e.g., 21 CFR Part 11, GxP/CLIA contexts), ensuring documentation, change control, and audit readiness.\n\\n\nStakeholder & Vendor Management:\nCoordinate across Research, IT, Security, and vendors; contribute to roadmaps, SOWs, and service reviews to meet SLAs and continuous improvement goals.\n\\n\nQualifications:\n\\n\n\\n\nEducation:\nBachelor's or Master's in Life Sciences (e.g., Molecular Biology, Biochemistry, Bioengineering) or related field.\n\\n\nExperience:\n3+ years as a Business Analyst (or Product BA) in life-sciences R&D 3+ years configuring/implementing ELN/LIMS ( Benchling, Genedata, Dotmatics, Revvity, Sapio etc.)\n\\n\nGenAI:\n1-2+ years enabling enterprise GenAI solutions (prompting/RAG, evaluation/guardrails, responsible use) for scientific knowledge or workflow assistance.\n\\n\nTechnical Skills:\nFamiliarity with ELN/LIMS configuration, REST APIs/JSON, basic SQL; understanding of data models, ontologies, and controlled vocabularies.\n\\n\nAnalytical Skills:\nAbility to translate complex scientific requirements into testable specifications and measurable outcomes.\n\\n\nCommunication:\nStrong written/verbal skills for lab, IT, and leadership audiences.\n\\n\nRegulatory Knowledge:\nWorking understanding of 21 CFR Part 11, data integrity, and GxP/CLIA principles as applicable.\n\\n\nPreferred Qualifications:\n\\n\n\\n\nHands-on system administration, including schema/registry design, workflows, templates, and data analysis configurations.\n\\n\nExperience with instrument data capture and pipeline tooling; exposure to cloud analytics (e.g., Databricks/Snowflake/Power BI).\n\\n\nFamiliarity with vector search/embeddings and evaluation frameworks for GenAI; basic Python or notebooks for demos/data exploration.\n\\n\nProfessional certifications (CBAP/CCBA, CSPO/PSPO, PMP)\n\\n\nIf you come across a role that intrigues you but doesn't perfectly line up with your resume, we encourage you to apply anyway. You could be one step away from work that will transform your life and career.\nCompensation Overview:\nPrinceton - NJ - US: $91,290 - $110,622\nThe starting compensation range(s) for this role are listed above for a full-time employee (FTE) basis. Additional incentive cash and stock opportunities (based on eligibility) may be available. The starting pay rate takes into account characteristics of the job, such as required skills, where the job is performed, the employee's work schedule, job-related knowledge, and experience. Final, individual compensation will be decided based on demonstrated experience.\nEligibility for specific benefits listed on our careers site may vary based on the job and location. For more on benefits, please visit https://careers.bms.com/life-at-bms/.\nBenefit offerings are subject to the terms and conditions of the applicable plans then in effect and may include the following: Medical, pharmacy, dental and vision care. Wellbeing support such as the BMS Living Life Better program and employee assistance programs (EAP). Financial well-being resources and a 401(K). Financial protection benefits such as short- and long-term disability, life insurance, supplemental health insurance, business travel protection and survivor support. Work-life programs include paid national holidays and optional holidays, Global Shutdown Days between Christmas and New Year's holiday, up to 120 hours of paid vacation, up to two (2) paid days to volunteer, sick time off, and summer hours flexibility. Parental, caregiver, bereavement, and military leave. Family care services such as adoption and surrogacy reimbursement, fertility/infertility benefits, support for traveling mothers, and child, elder and pet care resources. Other perks like tuition reimbursement and a recognition program.\nUniquely Interesting Work, Life-changing Careers\nWith a single vision as inspiring as Transforming patients' lives through science™ , every BMS employee plays an integral role in work that goes far beyond ordinary. Each of us is empowered to apply our individual talents and unique perspectives in a supportive culture, promoting global participation in clinical trials, while our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.\nOn-site Protocol\nBMS has an occupancy structure that determines where an employee is required to conduct their work. This structure includes site-essential, site-by-design, field-based and remote-by-design jobs. The occupancy type that you are assigned is determined by the nature and responsibilities of your role:\nSite-essential roles require 100% of shifts onsite at your assigned facility. Site-by-design roles may be eligible for a hybrid work model with at least 50% onsite at your assigned facility. For these roles, onsite presence is considered an essential job function and is critical to collaboration, innovation, productivity, and a positive Company culture. For field-based and remote-by-design roles the ability to physically travel to visit customers, patients or business partners and to attend meetings on behalf of BMS as directed is an essential job function.\nBMS is dedicated to ensuring that people with disabilities can excel through a transparent recruitment process, reasonable workplace accommodations/adjustments and ongoing support in their roles. Applicants can request a reasonable workplace accommodation/adjustment prior to accepting a job offer. If you require reasonable accommodations/adjustments in completing this application, or in any part of the recruitment process, direct your inquiries to adastaffingsupport@bms.com . Visit careers.bms.com/ eeo -accessibility to access our complete Equal Employment Opportunity statement.\nBMS cares about your well-being and the well-being of our staff, customers, patients, and communities. As a result, the Company strongly recommends that all employees be fully vaccinated for Covid-19 and keep up to date with Covid-19 boosters.\nBMS will consider for employment qualified applicants with arrest and conviction records, pursuant to applicable laws in your area.\nIf you live in or expect to work from Los Angeles County if hired for this position, please visit this page for important additional information: https://careers.bms.com/california-residents/\nAny data processed in connection with role applications will be treated in accordance with applicable data privacy policies and regulations.\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=c51dac3bd40e331a&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfovnurkuq78l9&spon=0&xkcb=SoC_67M3pv5w3QyMTJ0FbzkdCdPP&xfps=8ff5898f-1649-4b5a-ba71-7bc4d931af37&vjfrom=vjs&asub=mob&astse=b23d6a18bbffd9e2&assa=3658"
}