{
  "filename": "data_analyst_New_York__NY_page12_job12_Privacy_Program_Data_Analyst.html",
  "job_title": "Privacy Program Data Analyst",
  "company": "NorthEast Provider Solutions Inc.",
  "location": "Valhalla, NY",
  "salary": "$65,907 - $82,846 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:26:45.866Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Title:\nPrivacy Program Data Analyst\n\\n\nCompany:\nNorthEast Provider Solutions Inc.\n\\n\n\\n\nCity/State:\nValhalla, NY\n\\n\n\\n\nCategory:\nClerical/Administrative Support\n\\n\nDepartment:\nCompliance- WMC Health\n\\n\nUnion:\nNo\n\\n\n\\n\n\\n\nPosition:\nFull Time\n\\n\nHours:\nM-F\n\\n\nShift:\nDay\n\\n\nReq #:\n45472\n\\n\nPosted Date:\nNov 07, 2025\n\\n\nHiring Range:\n$65,907 - $82,846\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Details:\n\\n\n\\n\nJob Summary:\n\\n\nThe Privacy Program Data Analyst supports the WMC Health Network’s privacy program by analyzing privacy-related data, assisting in risk assessments, and ensuring compliance with HIPAA and other privacy regulations. Reporting to the Director of Privacy Program, this role helps monitor privacy incidents, track trends in privacy risks, support privacy investigations, and assist in maintaining privacy policies and training programs. The Privacy Analyst collaborates with various departments to promote privacy awareness and protect patient information across the network.\n\\n\nResponsibilities:\n\\n\n\\n\n\\n\nMonitor and analyze privacy incidents and potential breaches, documenting findings and supporting investigations.\n\\n\nTrack and analyze trends in privacy incidents and risks to proactively identify areas requiring attention.\n\\n\nConduct privacy risk assessments and assist in identifying vulnerabilities within the network’s privacy program.\n\\n\nSupport the development, review, and maintenance of privacy policies, procedures, and related documentation.\n\\n\nHelp prepare and deliver privacy training materials and educational programs for staff across the network.\n\\n\nManage and maintain accurate records and reports on privacy activities, compliance metrics, and regulatory requirements.\n\\n\nCollaborate with clinical, IT, legal, and compliance teams to ensure coordinated privacy efforts and regulatory adherence.\n\\n\nSupport internal and external privacy audits by providing data analysis and required documentation.\n\\n\nStay current with changes in privacy laws, regulations, and best practices to ensure ongoing compliance.\n\\n\nAssist the Director of Privacy Program in various projects and initiatives aimed at enhancing the privacy program’s effectiveness.\n\\n\nMonitor trends and patterns in privacy data to proactively identify potential risks or areas requiring further investigation.\n\\n\nPerform other duties as assigned.\n\\n\nQualifications/Requirements: \\n\n\\n\nExperience:\n\\n\n\\n\n\\n\n1 year of experience in data analysis, privacy or regulatory management in a large healthcare facility, required\n\\n\n\\n\n\\n\nEducation:\n\\n\n\\n\n\\n\nBachelor’s degree in Business, Accounting, Finance, Healthcare Administration, or a related field, required.\n\\n\nMaster’s degree in Business, Accounting, Finance, Healthcare Administration, or a related field, preferred.\n\\n\n\\n\n\\n\nLicenses / Certifications:\n\\n\n\\n\n\\n\nCertified in Healthcare Privacy Compliance (CHPC) preferred.\n\\n\n\\n\n\\n\nOther:\n\\n\n\\n\n\\n\nConfidentiality: It is an expectation that all employees at Westchester Medical Center Health Network will protect the confidentiality of all patient care, personnel, and business/financial information.\n\\n\nCompliance: Employees will complete required competencies, annual mandatory training requirements and adhere to the code of conduct as described in the Westchester Medical Center Health Network Compliance Plan and brochure.\n\\n\nDisclaimer: The above statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified.\n\\n\nSpecial Requirements: \\n\n\\n\nKnowledgeable in HIPAA, and Federal and State regulations for hospitals & physician practices.\n\\n\nPlanning and conducting effective, confidential investigations.\n\\n\n\\n\n\\n\nAbout Us:\n\\n\nNorthEast Provider Solutions Inc.\n\\n\nBenefits:\n\\n\nWe offer a comprehensive compensation and benefits package that includes:\n\\n\n\\n\nHealth Insurance\n\\n\nDental\n\\n\nVision\n\\n\nRetirement Savings Plan\n\\n\nFlexible Savings Account\n\\n\nPaid Time Off\n\\n\nHolidays\n\\n\nTuition Reimbursement\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=34b8bd051edbef26&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoDq67M3pv5_3dy4ax0HbzkdCdPP&xfps=edaf0cae-c3ba-4046-ad9a-3cd8029195cc&vjfrom=vjs&asub=mob&astse=92e3bad2261a76fc&assa=1041"
}