{
  "filename": "data_analyst_New_York__NY_page7_job8_Analyst__Business_Development_.html",
  "job_title": "Analyst, Business Development Insurance Asset Management",
  "company": "Bayview Asset Management",
  "location": "142 West 57th Street, New York, NY 10019",
  "salary": "$80,000 - $100,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:14:17.419Z",
  "full_description": "\\n Overview: \\n\nPOSITION SUMMARY:\n\\n\nBayview Asset Management is seeking to hire an Analyst, Business Development within its newly established Insurance Asset Management business. The successful candidate will support senior business and investment leaders in forming and building relationships with institutional insurance clients. This is a unique opportunity to be a founding member of a new business unit within an established and highly reputable asset management firm. The Analyst within the Insurance Asset Management business will gain direct exposure to senior business and investment leaders within the firm as well as with third party insurance clients, and will have the opportunity to build investment and market knowledge while honing critical relationship management skills.\n\\n\n\\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\\n\nThe following job functions are not all-inclusive. The employee will be required to perform other job-related tasks/responsibilities as requested. Job duties may change as required by needs of company.\n\\n\n\\n\nProvide support to senior business leaders in all business development efforts, including designing, building and implementing marketing and outreach communications.\n\\n\nWork collaboratively with internal Bayview teams to compile and respond to prospective client due diligence questionnaires (DDQs), investment consultant surveys, or related projects.\n\\n\nDiligently respond to inbound client and stakeholder requests.\n\\n\nAssist in preparing the senior management team for key stakeholder meetings, including composing briefing memos and taking detailed meeting notes.\n\\n\nAssist leadership in building market knowledge and a prospective client pipeline by staying up to date on relevant market dynamics and conducting secondary research.\n\\n\nMaintain and update Bayview’s customer relationship management system (Salesforce); monitor and track key activities with the business’s prospective investor pipeline.\n\\n\nDevelop strong industry, investment and market knowledge.\n\\n\n\\n\n\\n\nSKILLS/KNOWLEDGE/ABILITIES:\n\\n\n\\n\nStrong interest in financial markets, macroeconomics, and the investment management industry.\n\\n\nOutstanding communication skills: ability to articulate ideas and strategies clearly, both verbally and in writing.\n\\n\nExcellent attention to detail and organizational skills.\n\\n\nPositive attitude with a diligent work ethic.\n\\n\nOutstanding relationship building skills and ability to work in a team environment.\n\\n\nA self-starter with the ability to work within Bayview’s fast-paced environment.\n\\n\nStrong time-management skills; ability to multitask and prioritize among time-sensitive demands.\n\\n\nBasic proficiency in Excel and PowerPoint, with the desire to build technical mastery.\n\\n\n\\n\n\\n\nEDUCATION and EXPERIENCE:\n\\n\n\\n\nCurrently pursuing or a recent graduate of an undergraduate degree, with an expected graduation date of December 2025 – June 2026\n\\n\n\\n\n\\n\n\\n\nLOCATION & COMPENSATION:\n\\n\n\\n\n\\n\nThis role will be based in Bayview’s New York City or Morristown, NJ office\n\\n\nBase compensation is expected to be $80,000-100,000 with opportunity for incentive compensation including a performance-based bonus.\n\\n\n\\n\n\\n\nEEOC\n\\n\n\\n  Bayview Asset Management is an Equal Employment Opportunity employer. All aspects of consideration for employment and employment with the Company are governed on the basis of merit, competence and qualifications without regard to race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, or any other category protected by federal, state, or local law.\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=6dd934a26143feba&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfo1hnsi8qp803&spon=0&xkcb=SoA067M3pv4J5G2EiJ0DbzkdCdPP&xfps=84a5d7b1-3431-491f-8d65-eb3ede67e3ea&vjfrom=vjs&asub=mob&astse=5355ba77df590d5b&assa=2714"
}