{
  "filename": "data_analyst_New_York__NY_page6_job4_Product_Analyst__Insurance_.html",
  "job_title": "Product Analyst (Insurance)",
  "company": "Marsh",
  "location": "Malvern, PA 19355•Hybrid work",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:01:18.040Z",
  "full_description": "\\n\nWe are seeking a talented individual to join our ProWriters team at\nVictor.\nThis role will be based in Malvern, PA. This is a hybrid role that has a requirement of working at least three days a week in the office.\n\\n\n\\n\nAs a\nProduct Analyst\n, you will support the growth and ongoing evolution of\nDigital IQ\n, ProWriters’ proprietary specialty insurance platform. This is a role ideal for a detail-oriented professional who enjoys working at the intersection of product, strategy, operations, and technology. This is a great opportunity for someone who wants to grow into product management and is excited to contribute to a fast-paced, collaborative team!\n\\n\n\\n\nWe will count on you to:\n\\n\n\\n\nWork closely with product managers and engineers to support carrier integrations and other third-party API integrations\n\\n\nAssist in defining product requirements and writing functional documentation\n\\n\nMonitor feature adoption and user behavior to identify improvement opportunities\n\\n\nConduct user research, usage analysis, and competitive research to inform product decisions\n\\n\nPerform QA testing, track bugs, and help triage production issues\n\\n\n\\n\n\\n\nWhat you need to have:\n\\n\n\\n\n1+ years of experience in a product, business analyst, or other related role\n\\n\nCuriosity and willingness to learn\n\\n\nStrong communication, organization, and problem-solving skills\n\\n\nComfortable with technology and working with data; Highly proficient in Excel\n\\n\n\\n\n\\n\nWhat makes you stand out?\n\\n\n\\n\nConsulting, Banking, and/or insurance industry experience\n\\n\nExperience with SQL and database tools\n\\n\nEntrepreneurial mindset\n\\n\n\\n\n\\n\nWhy join our team:\n\\n\n\\n\nWe help you be your best through professional development opportunities, interesting work and supportive leaders.\n\\n\nWe foster a vibrant and inclusive culture where you can work with talented colleagues to create new solutions and have an impact on colleagues, clients, and communities.\n\\n\nOur scale enables us to provide a range of career opportunities, as well as benefits and rewards to enhance your well-being.\n\\n\n\\n\n\\n\nMarsh, a business of Marsh McLennan (NYSE: MMC), is the world’s top insurance broker and risk advisor. Marsh McLennan is a global leader in risk, strategy and people, advising clients in 130 countries across four businesses: Marsh, Guy Carpenter, Mercer and Oliver Wyman. With annual revenue of $24 billion and more than 90,000 colleagues, Marsh McLennan helps build the confidence to thrive through the power of perspective. For more information, visit marsh.com, or follow on LinkedIn and X.\nVictor offers a connected culture of talented, inspired individuals, and a work environment where colleagues can grow and succeed. At Victor, your voice is heard, your skills are sharpened and your ambitions nurtured. We value diversity in thought and background and are looking for individuals who are up for the challenge of creating the insurance enterprise of the future. If that’s you, join us on our journey—with us by your side, you’ll be ready to tackle tomorrow’s challenges. Victor Insurance Managers LLC (“Victor”) is one of the world’s largest managing general underwriters with locations in the US, Canada, UK, Netherlands, Germany, Italy, and Australia. It handles more than $4 billion USD in premium on behalf of numerous insurance carriers, through a large network of more than 20,000 active insurance agents and brokers. With deep, specialized underwriting expertise, the company delivers a wide range of insurance solutions – from specialty property and casualty and professional liability insurance to group and retiree benefits. Victor is committed to building on 65-plus years of experience to develop products and services that address the complex needs of its customers. For more information, visit www.victorinsurance.com.\nVictor US is the flagship business of Victor, operating under the legal name, Victor Insurance Managers LLC. It is a leading managing general agent in the US with a rich history in specialty insurance and offering a unique range of products and programs distributed through independent brokers and agents. The company is committed to making insurance easier for brokers, agents and their clients through specialized underwriting expertise, personalized customer service and a responsive, technology-oriented business approach. For more information, visit www.victorinsurance.com.\nMarsh McLennan is committed to embracing a diverse, inclusive and flexible work environment. We aim to attract and retain the best people and embrace diversity of age background, disability, ethnic origin, family duties, gender orientation or expression, marital status, nationality, parental status, personal or social status, political affiliation, race, religion and beliefs, sex/gender, sexual orientation or expression, skin color, veteran status (including protected veterans), or any other characteristic protected by applicable law. If you have a need that requires accommodation, please let us know by contacting reasonableaccommodations@mmc.com.\nMarsh McLennan is committed to hybrid work, which includes the flexibility of working remotely and the collaboration, connections and professional development benefits of working together in the office. All Marsh McLennan colleagues are expected to be in their local office or working onsite with clients at least three days per week. Office-based teams will identify at least one “anchor day” per week on which their full team will be together in person.\n#Victor\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=83f6e708e22435d3&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnfc72293c07e&spon=0&xkcb=SoC667M3pvmyVWACJ70PbzkdCdPP&xfps=f6b0d80e-e693-407e-8aed-48ca0c55075c&vjfrom=vjs&asub=mob&astse=dc084d6e9b5a8665&assa=8336"
}