{
  "filename": "data_analyst_New_York__NY_page4_job8_SAP_BI_BW_ANALYST.html",
  "job_title": "SAP BI/BW ANALYST",
  "company": "Avventis Inc.",
  "location": "Edison, NJ",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:57:53.724Z",
  "full_description": "\\n\nLocations: Edison,NJ\nJob Description:\n\\n\n\\n\nHaving a clear understanding of the BI product and functionality and remaining current on BI product offerings and capabilities (including Business Objects).\n\\n\nEnsuring cost effective BI design, development, and integration with other systems\n\\n\nEnsuring that the BI system is scalable and always available\n\\n\nEnsuring alignment with company goals and adherence to (and continued development) of corporate standards for data warehousing\n\\n\nDevelop and provide a clear understanding of the BI data model and strategies for data modeling and act as the main point of contact for all data model and system-design decisions\n\\n\nIncorporate performance standards into the design of BI\n\\n\nParticipate in the corporate data archiving strategy and implementation\n\\n\nLeads efforts to analyze and translate business requirements and functional specifications into technical specifications, data flow diagrams and data models\n\\n\nCreates, enhances and implements extractors, transformations, process chains and load procedures needed to populate Info Objects in BW\n\\n\nUses strong BI skills to create and implement InfoObjects, DSOs, InfoCubes, InfoSets and MultiProviders\n\\n\nAbility to program and to coordinate programming of ABAP to complete design where necessary\n\\n\n\\n\n\\n\nAvventis Offers One of the Best Places to Work\n\\n\nAvventis maintains its commitment to being one of the best companies to work for by providing quality positions with a professional environment , great benefits , rewarding incentive programs and ongoing training for the staffing industry.\n\\n\nEligibility\n\\n\nAll positions involve use of 2 or more of the following software skills:\n\\n\nERP, ETL, BO, UNIX, SQL Server, SQL,SAP, Visual Basic, Power Builder,.Net, VC++,J2EE,Oracle, Java, JavaScript, VBScript, Solaris,Actuate Reports,INFORMIX,SQL, GUI, DB2,CICS,COBOL, SAP, WebLogic, JSP,ASP,WebSphere, TCP/IP,HTML,Sybase & Access, AS/400\n\\n\nQualifications\n\\n\nBachelor’s or Master’s (or foreign education equivalent of same) in related field and/or relevant experience required depending on position.\nFor certain positions, we accept degree equivalent in education & experience or any equally suitable combination of education training and/or experience which would qualify applicant to perform duties of job offered.\nRelocation to various client sites in U.S. as needed.\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=55e8a11cdea892e6&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfn8f3pi9eb8ah&spon=0&xkcb=SoDD67M3pvmuMEygLZ0DbzkdCdPP&xfps=4805be62-1bc2-45ff-ab64-b22e00a7cbc0&vjfrom=vjs&asub=mob&astse=a20d709c4f370cfd&assa=7220"
}