{
  "filename": "data_analyst_New_York__NY_page5_job11_Business_Operations_Analyst.html",
  "job_title": "Business Operations Analyst",
  "company": "Rain",
  "location": "New York, NY 10001•Hybrid work",
  "salary": "$60,000 - $90,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:00:16.054Z",
  "full_description": "\\n\nOverview\n\\n\nAt Rain, we’re rebuilding the global financial pipes money flows through. Our infrastructure makes stablecoins usable in the real world by powering credit card transactions, cross-border payments, B2B purchases, remittances, and more. We partner with fintechs, neobanks, and institutions to help them launch solutions that are global, inclusive, and efficient. If you’re curious, bold, and excited to help shape a borderless financial system, we’d love to talk.\n\\n\n\\n\nOur Ethos\n\\n\nOperating at the epicenter of stablecoin innovation means moving fast and thinking globally. Our team reflects the diverse, international audiences we serve. We hire people who stay agile as the tide ebbs and flows, fix what’s broken without waiting, chase trends before they peak, and remember to have fun through it all.\n\\n\n\\n\nWhat we're looking for\n\\n\nRain is looking for a Business Operations Analyst to be the engine behind our partner onboarding and regulatory workflows. In this role, you’ll own the end-to-end process for partner questionnaires, due-diligence packages, and regulatory/operational forms—driving accuracy, speed, and cross-functional coordination so we can ship partnerships faster.\n\\n\n\\n\nWhat You'll Do\n\\n\n\\n\nOwn completion, submission, and tracking of partner questionnaires, network forms, and vendor onboarding packets; manage signatures, evidence, and deadlines.\n\\n\nCoordinate inputs across Legal, Compliance, Risk, Finance, Engineering, and Product; translate technical concepts into clear, consistent responses.\n\\n\nBuild and maintain a single source of truth; continuously improve templates to reduce cycle time and errors.\n\\n\nStand up lightweight reporting and dashboards for pipeline, SLAs, blockers, and renewals; communicate status updates proactively to stakeholders.\n\\n\nSupport broader BizOps: process mapping, policy documentation, light analyses, contract tracking, and ad-hoc projects.\n\\n\n\\n\n\\n\nWhat you will bring to Rain\n\\n\n\\n\n1+ years of experience in business operations, partner operations, compliance operations, or similar at a fintech, payments, or B2B SaaS company\n\\n\nMeticulous attention to detail and exceptional written communication; you can turn messy inputs into precise, audit-ready responses.\n\\n\nStrong project management—owning timelines, driving cross-functional alignment, and hitting SLAs without hand-holding.\n\\n\nFamiliarity with concepts like KYC/KYB, AML, information security controls, and vendor risk; comfort working with legal/compliance documentation.\n\\n\nTool fluency: Google Workspace, spreadsheets, e-signature, ticketing tools (linear), and the ability to quickly learn new systems.\n\\n\n\\n\n\\n\nDesirable but not mandatory\n\\n\n\\n\nExperience with card issuing, payment networks, cross-border payments, or stablecoins.\n\\n\nExperience building response libraries/knowledge bases and automating workflows.\n\\n\n\\n\n\\n\nBenefits\n\\n\nOur team works hard, so we make sure our benefits do too. Here’s what you can expect as a Rainmaker:\n\\n\n\\n\n\\n\nTop-tier coverage: We cover 95% of Medical, Dental, and Vision premiums.\n\\n\n401(k) with matching: Invest in your future, just like we’re investing in ours.\n\\n\nOwnership that matters: Every team member gets equity because we believe in building together.\n\\n\nWork your way: Flexible hybrid setup with a prime SoHo office for NYC-based teammates.\n\\n\nUnlimited PTO: Because time to rest and reset is just as important as time to ship.\n\\n\nProduct-first perks: Monthly budget to test our cards and features like a real user.\n\\n\nWellness support: Monthly stipend to spend on fitness, therapy, or whatever keeps you thriving.\n\\n\nHome office setup: One-time stipend to create a space that works for you.\n\\n\nTeam connection: Frequent company events, team dinners, and offsites to stay connected.\n\\n\n\\n\n\\n\nCompensation will vary based on experience from $60,000-$90,000\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=e17d70b6688ab63d&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnbj48jn1a803&spon=0&xkcb=SoAn67M3pvmhsM20BR0AbzkdCdPP&xfps=ae8ad0a1-1190-4944-a650-53321fdd11be&vjfrom=vjs&asub=mob&astse=983eb595c91535fd&assa=6396"
}