{
  "filename": "data_analyst_New_York__NY_page11_job10_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "Remex, Inc",
  "location": "Skillman, NJ 08558",
  "salary": "$18 - $23 an hour",
  "job_type": "Part-time",
  "scraped_at": "2025-12-27T11:24:23.100Z",
  "full_description": "\\n\n\\n\n\\n   Established in 1983, Remex, Inc. is a dynamic accounts receivable management company seeking a part-time Data Analyst to manage the transfer of client data files into our enterprise application software. The person selected for our data analyst position must have the requisite technical and communication skills.\n\\n\n\\n\n\\n   The position will be on-site at our Skillman, NJ office. This position will require approximately 15-20 hours per week between 8am and 5pm, and may fluctuate as business needs dictate.\n\\n\n\\n\n\\n   Requirements:\n\\n\n\\n\n\\n\nHigh level of proficiency with Excel- advanced capabilities including VLOOKUP, Macros and dynamic formula writing\n\\n\nAbility to work with and convert various file types including txt, xml, xlsx, csv, etc.\n\\n\nTyping speed at least 60 WPM\n\\n\nExcellent written and verbal communication skills\n\\n\n\\n\n\\n   Duties:\n\\n\n\\n\n\\n\nAnalyze and scrub incoming data files containing consumer information to identify potential errors and ensure all required/expected data elements are present\n\\n\nManipulate and convert data files to ensure they are in proper format for loading\n\\n\nLoad data files into ARM software\n\\n\nVerify and confirm files have been loaded correctly and no errors exist\n\\n\nCollaborate as needed with senior management to plan and execute how new clients' data files will be manipulated and loaded\n\\n\nCollaborate as needed with programmers as needed to facilitate design and testing of custom programs used for loading data files\n\\n\nIdentify and suggest ways file manipulation and loading can be enhanced or completed more efficiently\n\\n\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}