{
  "filename": "data_analyst_New_York__NY_page12_job14_Investments_Data_Management_An.html",
  "job_title": "Investments Data Management Analyst",
  "company": "Genworth Financial",
  "location": "Stamford, CT 06905",
  "salary": "$86,100 - $146,400 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:27:02.049Z",
  "full_description": "\\n\nAt Genworth, we empower families to navigate the aging journey with confidence. We are compassionate, experienced allies for those navigating care with guidance, products, and services that meet families where they are. Further, we are the spouses, children, siblings, friends, and neighbors of those that need care—and we bring those experiences with us to work in serving our millions of policyholders each day.\n\\n\n\\n\nWe apply that same compassion and empathy as we work with each other and our local communities. Genworth values all perspectives, characteristics, and experiences so that employees can bring their full, authentic selves to work to help each other and our company succeed. We celebrate our diversity and understand that being intentional about inclusion is the only way to create a sense of belonging for all associates. We also invest in the vitality of our local communities through grants from the Genworth Foundation, event sponsorships, and employee volunteerism.\n\\n\n\\n\nOur four values guide our strategy, our decisions, and our interactions:\n\\n\n\\n\nMake it human.\nWe care about the people that make up our customers, colleagues, and communities.\n\\n\nMake it about others.\nWe do what's best for our customers and collaborate to drive progress.\n\\n\nMake it happen.\nWe work with intention toward a common purpose and forge ways forward together.\n\\n\nMake it better.\nWe create fulfilling purpose-driven careers by learning from the world and each other.\n\\n\n\\n\n\\n\nPOSITION TITLE\n\\n\nInvestments Data Management Analyst\n\\n\n\\n\nPOSITION LOCATION\n\\n\nStamford, CT\n\\n\n\\n\nYOUR ROLE\n\\n\nYou will be an integral part of the Data Management Team delivering high quality data and various deliverables to our key business areas including (but not limited to) traders, portfolio management, credit research and risk. It will be imperative for you to deliver accurately and timely data to our customers who use that information to make investment decisions based on the data. You will work cross-functionally to improve data needs and deliverables, increase efficiencies/controls, and build positive relationships with our customers.\n\\n\n\\n\nWhat you will be doing\n\\n\n\\n\nCollaborate with front office to set-up securities in source system accurately and timely\n\\n\nExecute various reconciliations of our source data to ensure accuracy\n\\n\nPrepare cash flow modeling, projections and analysis for downstream consumption\n\\n\nYou will learn our various security valuation processes and controls\n\\n\nContinually Identify process deficiencies, implement controls and maintain documentation\n\\n\nParticipate in the continual development of a Data Governance framework\n\\n\n\\n\n\\n\nWhat you bring\n\\n\n\\n\nBachelor’s degree or equivalent experience\n\\n\n3-5-years experience, working with Investments data\n\\n\nPricing experience preferred\n\\n\nExcellent communication and organizational skills\n\\n\nClose attention to detail and process requirements\n\\n\nAbility to perform in a rapidly changing, fast-paced environment\n\\n\nStrong Excel Skills\n\\n\n\\n\nEmployee Benefits & Well-Being\n\\n\nGenworth employees make a difference in people’s lives every day. We’re committed to making a difference in our employees’ lives.\n\\n\n\\n\nCompetitive Compensation & Total Rewards Incentives\n\\n\nComprehensive Healthcare Coverage\n\\n\nMultiple 401(k) Savings Plan Options\n\\n\nAuto Enrollment in Employer-Directed Retirement Account Feature (100% employer-funded!)\n\\n\nGenerous Paid Time Off – Including 12 Paid Holidays, Volunteer Time Off and Paid Family Leave\n\\n\nDisability, Life, and Long Term Care Insurance\n\\n\nTuition Reimbursement, Student Loan Repayment and Training & Certification Support\n\\n\nWellness support including gym membership reimbursement and Employee Assistance Program resources (work/life support, financial & legal management)\n\\n\nCaregiver and Mental Health Support Services\n\\n\n\\n\n\\n\nADDITIONAL\n\\n\n\\n\nAt this time, Genworth will not sponsor a new applicant for employment authorization for this position.\n\\n\nNo agencies please.\n\\n\nStrong internal candidate identified. Other candidates are encouraged to apply.\n\\n\n\\n\n\\n\nADDITIONAL\n\\n\n\\n\nAt this time, Genworth will not sponsor a new applicant for employment authorization for this position\n\\n\n\\n\n\\n\nFor the State of New York: The base salary pay range for this role starts at a minimum rate of $86,100 up to the maximum of $146,400. In addition to your base salary, you will also be eligible to participate in an incentive plan. The incentive plan is based on performance and the target earning opportunity is 7% of your base compensation. The final determination on base pay for this position will be based on multiple factors at the time of this job posting including but not limited to geographic location, experience, and qualifications to ensure pay equity within the organization.\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=7248cbf1e9c88c90&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoDD67M3pv5_3dy4ax0FbzkdCdPP&xfps=568fe2c0-7a15-4819-9c5e-84d1e7969a2d&vjfrom=vjs&asub=mob&astse=65a05d0f4347c635&assa=2461"
}