{
  "filename": "data_analyst_New_York__NY_page9_job2_Logistics_Data_Analyst__Sponso.html",
  "job_title": "Logistics Data Analyst (Sponsor H-1B)",
  "company": "Gofo Inc",
  "location": "Carteret, NJ 07008",
  "salary": "$22 - $23 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:18:05.639Z",
  "full_description": "若对该岗位有意向可直接加微信：enson6187 并备注姓名+投递的base和岗位，我会把详细的公司和岗位信息发您+具体沟通\n\\n\nJob Responsibilities:\n\\n\n\\n\nBuild and maintain data-driven models to support logistics operations, including workforce efficiency models, hub performance models, and site evaluation frameworks.\n\\n\nWrite, test, and deploy production-level code to optimize operational workflows such as parcel sorting, routing, and site productivity tracking.\n\\n\nCollect, clean, and analyze logistics data (e.g., volume, on-time performance, labor hours) to provide actionable insights that improve efficiency and reduce costs across hubs and last-mile stations.\n\\n\nPartner with operations and management teams to translate business needs into scalable technical solutions that enhance day-to-day logistics performance.\n\\n\nMonitor and improve data pipelines to ensure real-time accuracy of operational metrics.\n\\n\nPrepare dashboards, reports, and presentations to communicate operational KPIs and model outputs to stakeholders.\n\\n\n\\n\nJob Requirements:\n\\n\n\\n\nBachelor’s or Master’s degree in Data Science, Computer Science, Logistics, Business Analytics, or related field.\n\\n\nStrong programming ability in Python, R, or SQL, with proven experience independently coding and deploying analytics solutions.\n\\n\nHigh sensitivity to operational and logistics data; ability to identify patterns, risks, and opportunities in large datasets.\n\\n\nFamiliarity with logistics/warehouse operations, including hub & last-mile delivery processes, is highly desirable.\n\\n\nSolid skills in building models to support labor planning, hub capacity management, and site-level performance evaluation.\n\\n\n\\n\nJob Type: Full-time\n\\n\nPay: $22.00 - $23.00 per hour\n\\n\nBenefits:\n\\n\n\\n\n401(k)\n\\n\n401(k) matching\n\\n\nHealth insurance\n\\n\nPaid time off\n\\n\nRelocation assistance\n\\n\n\\n\nLanguage:\n\\n\n\\n\nChinese (Required)\n\\n\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}