{
  "filename": "data_analyst_Houston__TX_page2_job2_Technical_Services_Analyst.html",
  "job_title": "Technical Services Analyst",
  "company": "Reynolds and Reynolds",
  "location": "College Station, TX 77845",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:45:26.398Z",
  "full_description": "Are you seeking a challenging, yet exciting career in the PC/Server, Networking, and VoIP technology fields? As a Reynolds Technical Services Analyst, you will develop dynamic troubleshooting, problem solving, and customer service skills while supporting a wide range of technologies in automotive dealerships across the country.\n\\n\nTechnical Services Analysts provide technical assistance to our Reynolds customers and field engineers. They resolve issues with computer systems, voice and data networks, proprietary software, and peripheral hardware in a challenging but rewarding environment. Our Technical Services Analysts develop valuable troubleshooting, problem resolution, and customer service skills.\n\\n\nWith time and experience, Technical Services Analysts may have the opportunity to participate in career-building projects such as:\n\\n\n\\n\nTesting PC/Server hardware and peripherals, electronic components, and networking appliances.\n\\n\nCreating and modifying technical documents for support staff, installers, and customers.\n\\n\nEvaluating new devices to be used with our systems.\n\\n\nDeveloping hardware testing and production processes.\n\\n\n\\n\nRequirements:\n\\n\n\\n\nTechnical experience, whether professional or as a personal interest\n\\n\nProblem-solving skills\n\\n\nProfessional verbal communication skills\n\\n\n\\n\nBenefits:\n\\n\nOur associates receive medical, dental, vision, and life insurance. We also offer company contributions to your HSA, 6% match on 401 (k), and a work/life balance with paid time off. At our College Station facility, you can take advantage of our great training programs and facility amenities, including an onsite dining facility offering complimentary breakfast and lunch, a fitness center, and an onsite medical center. We also offer a wide variety of sports and social leagues to participate in after work, along with volunteering initiatives through our Associate Foundation.\n\\n\nWhat We Do At Reynolds\n\\n\nFounded in Dayton, Ohio in 1866, Reynolds and Reynolds is a leading provider of car dealership software, services, and forms to help dealerships deliver better results and transform the customer experience.\n\\n\nReynolds and Reynolds is headquartered in Dayton, Ohio, with major U.S. operations in Houston and College Station, Texas, Celina, Ohio, and Tampa, Florida, as well as operations in Canada, in the U.K., and Europe.\n\\n\nWith products in over 70% of U.S. dealerships, Reynolds features the industry’s only Retail Management System. If you’ve ever purchased a vehicle at a dealership, there’s a good chance we had a hand in that transaction.\n\\n\nReynolds and Reynolds promotes a healthy lifestyle by providing a non-smoking environment. Reynolds and Reynolds is an equal opportunity employer.\n\\n\nReynolds and Reynolds encourages applicants of all ages and experience to apply, as we do not discriminate on the basis of age.\n\\n\nJob Type: Full-time\n\\n\nBenefits:\n\\n\n\\n\n401(k)\n\\n\nDental insurance\n\\n\nHealth insurance\n\\n\nLife insurance\n\\n\nVision insurance\n\\n\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}