{
  "filename": "data_analyst_New_York__NY_page4_job14_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "ELEVATE ME, INC.",
  "location": "1 State Street, New York, NY 10004",
  "salary": "$92,959 - $98,706 a year",
  "job_type": "Full-time, Internship",
  "scraped_at": "2025-12-27T10:58:33.679Z",
  "full_description": "Overview\nWe are seeking a detail-oriented and analytical Business Analyst to join our dynamic team. The ideal candidate will play a crucial role in bridging the gap between IT and business objectives, ensuring that our projects align with the strategic goals of the organization. This position requires a strong understanding of data analysis, project management, and effective communication skills to facilitate collaboration across departments.\n\\n\nResponsibilities\n\\n\n\\n\nCollaborate with stakeholders to gather and document business requirements for various projects.\n\\n\nAnalyze data using tools such as SQL, R, and VBA to inform decision-making processes.\n\\n\nDesign and implement database solutions that enhance operational efficiency.\n\\n\nUtilize ETL processes to extract, transform, and load data from various sources.\n\\n\nParticipate in Agile project management methodologies to ensure timely delivery of projects.\n\\n\nConduct regular analysis of business processes and recommend improvements based on findings.\n\\n\nCreate detailed reports and presentations to communicate insights and recommendations to stakeholders.\n\\n\nSupport the development of training materials and documentation for end-users.\n\\n\n\\n\nQualifications\n\\n\n\\n\nProficiency in SQL and experience with database design is essential.\n\\n\nFamiliarity with data integration tools such as Talend is preferred.\n\\n\nStrong analytical skills with the ability to interpret complex data sets.\n\\n\nExperience in Agile methodologies and project management practices.\n\\n\nKnowledge of VBA for automating tasks and improving efficiency is a plus.\n\\n\nExcellent communication skills, both written and verbal, with the ability to present findings clearly.\n\\n\nA degree in Business Administration, Information Technology, or a related field is preferred.\n\\n\nPrevious experience as a Business Analyst or in a similar role is advantageous.\n\\n\n\\n\nJoin us in leveraging data-driven insights to drive business success!\n\\n\nJob Types: Full-time, Internship\n\\n\nPay: $92,959.00 - $98,706.00 per year\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}