{
  "filename": "data_analyst_New_York__NY_page7_job3_Financial_Reporting_Analyst.html",
  "job_title": "Financial Reporting Analyst",
  "company": "WSFS Bank",
  "location": "Philadelphia, PA",
  "salary": "$52,433.00 - $86,137.25 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:12:12.055Z",
  "full_description": "\\n\n\\n  Job Description\\n\n\\n\n\\n  NewLane Finance is a commercial equipment finance company, serving small and mid-size businesses nationwide. Our mantra is \"business lending done right\", and our strategy is to revolutionize small business lending by employing the latest technology and a motivated workforce to deliver fair and transparent financing solutions to businesses with unmatched levels of speed, convenience, and customer service. Our products and services are offered to the business community primarily through financing programs with equipment manufacturers, distributors, and dealers. NewLane Finance is powered by a $20+ billion parent, WSFS Financial Corporation (Nasdaq: WSFS).\\n\n\\n\n\\n\n\\n  NewLane’s Values:\\n\n\\n\n\\n\nIntegrity\n\\n\nPassion\n\\n\nTeamwork\n\\n\nCommitment to Excellence\n\\n\n\\n\n\\n\n\\n  Essential Duties and Responsibilities:\\n\n\\n\n\\n  Financial Management:\\n\n\\n\n\\n\nOrganize the company’s preparation and analysis of financial performance, management reporting and budget processes.\n\\n\nAssist in coordinating key management review meetings, including internal management review, parent business profitability sessions and board meeting materials.\n\\n\nAssist business users in budget and financial planning cycle.\n\\n\nAssists in assembling financial and business presentations to senior management and parent leadership and participates in discussions.\n\\n\nSupport department and senior management around performance results, financial projections results and profitability decisioning.\n\\n\nSpecial Projects as needed.\n\\n\n\\n\n\\n\n\\n  Financial Analysis:\\n\n\\n\n\\n\nDevelops ad hoc financial analysis that assists department managers in making decisions\n\\n\nApply business intelligences tools, including Tableau to delivery meaningful insights into business performance.\n\\n\nAssists in organizing business plans with business unit administration / line managers\n\\n\nRoles require strong communication, problem solving, critical thinking, and influencing skills to effectively :\n\\n\n\\n\n\\n\nArticulate outcomes of analysis and relevant insights.\n\\n\nIndependently manage and prioritize workload.\n\\n\nAd-hoc requests and special projects.\n\\n\n\\n\n\\n\n\\n  Qualifications:\\n\n\\n\n\\n\nBachelor’s Degree in Accounting or Finance.\n\\n\n2+ years’ experience with financial modeling.\n\\n\n1 to 2 years’ experience in financial reporting / analysis\n\\n\nStrong experience with Microsoft Excel and Microsoft PowerPoint.\n\\n\nTraining/certification/experience with Tableau, or business intelligence reporting tools.\n\\n\nAbility to problem solve.\n\\n\nTeamwork skills, ability to positively contribute to overall success of the team.\n\\n\n\\n\n\\n\n\\n\nNewLane Finance is shaping the future of business finance, and we're looking for talented, committed individuals to join our company as we continue to grow our team. We work hard to find the best people, invest in their professional development, and encourage “thinking outside the box”. Ultimately, it is our people who will create our success…by helping our customers grow and succeed.\n\\n\n\\n\n\\n\n\\n\nNewLane Finance is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, gender expression, national origin, age, protected veteran or disabled status, or genetic information\n.\n\\n\n\\n\n\\n\n\\n\nNewLane Finance will not be able to provide Relocation or Sponsorship\n\\n\n\\n\n\\n\n\\n  Salary Range:\\n\n$52,433.00 - $86,137.25\\n\n\\n\n\\n  Individual base pay may vary on additional factors such as the candidate’s experience, job-related skills, relevant education, geographic location, and other specific business and organizational needs.\\n\n\\n\n\\n\n\\n  In addition to base salary, WSFS Financial Corporation (WSFS) and its subsidiaries may offer eligible Associates discretionary and formula-based incentive and retention awards. WSFS provides a competitive benefits package, which includes medical, dental, and vision coverage; a 401(k) plan; life, accident, and disability insurance; flexible spending accounts (FSAs) and health savings accounts (HSAs); and wellness programs. Additional benefits may include paid parental leave, military leave, vacation and other paid time off, sick leave in accordance with applicable state laws, and paid holidays. Benefit offerings are subject to eligibility requirements, legal limitations, and may vary based on an Associate’s location and employment status. For more information about Associate benefits, please visit \\n\n\\n   https://www.wsfsbank.com/about/careers/\\n\n\\n\n\\n\n\\n\n\\n  WSFS Bank is inclusive and supportive of individual needs. If you have a physical or other impairment that might require an accommodation, including technical assistance with the WSFS Bank Careers website or submission process, please contact us via email at careers@wsfsbank.com.\\n\n\\n\n\\n\n\\n  WSFS is an equal opportunity employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=d27d0a539882cad6&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfo1hnsi8qp803&spon=0&xkcb=SoDO67M3pv4J5G2EiJ0IbzkdCdPP&xfps=329c8e70-0055-4dba-a342-6a385be1a9f0&vjfrom=vjs&asub=mob&astse=ac636a1dba9bbbdd&assa=6661"
}