{
  "filename": "data_analyst_Houston__TX_page2_job9_HR_Business_Systems_Analyst_I.html",
  "job_title": "HR Business Systems Analyst I",
  "company": "SCI Corporate Office II",
  "location": "1929 Allen Parkway, Houston, TX 77019",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:46:34.685Z",
  "full_description": "\\n\nOur associates celebrate lives. We celebrate our associates.\n\\n\nThe Analyst I supports Workday applications for all modules. This includes troubleshooting issues, writing test scripts, analyzing customers' business requirements and creating implementation plans. Knowledge of HRIS, HR business practices and problem-solving skills is required.\\n\n\\n\nJOB\nRESPONSIBILITIES\n\\n\n\\n\nSupports the Workday Application for all modules\n\\n\nTroubleshoots issues, assesses root causes and possible solutions\n\\n\nGathers and analyzes Customer Business Requirement Documents\n\\n\nCreates an implementation plan for each solution including meetings and coordination with the customer and other systems teams as needed\n\\n\nDevelops solutions by evaluating business process options and workflow solutions\n\\n\nWrites and performs test scripts to ensure intended functionality, operation, and performance requirements are achieved\n\\n\nDocuments configuration changes and approvals by internal controls\n\\n\nTakes initiative as an independent worker by being organized, detailed-oriented and prioritizing work\n\\n\nResearches, analyzes, and resolves problems or questions presented by associates, leadership, and/or other functional area partners using knowledge of the entire system\n\\n\nThis is not intended to be an all-inclusive list of the essential functions or duties related to this job\n\\n\n\\n\n\\n\nMINIMUM\nRequirements\n\\n\n\\n\nEducation\n\\n\n\\n\nHigh School diploma or equivalent\n\\n\nCollege coursework preferred or relevant work experience\n\\n\n\\n\n\\n\nCertification/License\n\\n\n\\n\nWorkday certification a plus\n\\n\n\\n\n\\n\nExperience\n\\n\n\\n\n1+ years of experience in HR Information System, preferably Workday\n\\n\n\\n\n\\n\nKnowledge, Skills and Abilities\n\\n\n\\n\nDemonstrated experience and knowledge of the project lifecycle, including requirements gathering, use case development, and test plan development and execution\n\\n\nDemonstrated knowledge of HR business practices\n\\n\nDemonstrated problem-solving and decision-making skills\n\\n\n\\n\n\\n\nWork CONDITIONS\n\\n\nWork Environment\n\\n\n\\n\nWork indoors during all seasons and weather conditions\n\\n\nComply with Corporate dress code policy\n\\n\n\\n\nWork Postures\n\\n\n\\n\nSitting continuously for many hours per day, up to 6 hours per day\n\\n\nClimbing stairs to access buildings frequently\n\\n\n\\n\nPhysical Demands\n\\n\n\\n\nPhysical effort requiring manual dexterity is required, includes paperwork, calculators, computers and phone usage\n\\n\n\\n\nWork Hours\n\\n\n\\n\nWorking beyond “standard” hours as the need arises\n\\n\n\\n\nPostal Code: 77019\\n\nCategory (Portal Searching): Human Resources\\n\nJob Location: US-TX - Houston\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}