{
  "filename": "data_analyst_New_York__NY_page14_job4_Investment_Banking___Business_.html",
  "job_title": "Investment Banking - Business Services - Analyst",
  "company": "JPMorganChase",
  "location": "270 Park Avenue, New York, NY 10017",
  "salary": "$110,000 - $135,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:29:37.656Z",
  "full_description": "\\n\nJOB DESCRIPTION\n\\n\nWe are a high performing team that is focused on winning together and building our growing Business Services franchise. We are seeking individuals with a long-term career mindset that shares the same passion, commitment and dedication to each other and to our clients.\nAs an Analyst in Business Services Investment Banking, you will be joining a team with a diverse coverage universe spanning companies in the Commercial, Industrial, Environmental, Consumer and Professional services markets. You will be expected to assume significant levels of responsibility requiring intellectual curiosity, motivation and analytical aptitude. Day-to-day responsibilities include: financial analysis and modeling, managing a team, preparing client presentations and interacting directly with senior bankers and clients.\nJob Responsibilities:\n\\n\n\\n\nSupport senior team members in origination activities including (but not limited to): analyzing financial implications of mergers and acquisitions, conducting public & private valuation analysis for clients and developing thoughtful content on broader industry trends\n\\n\nParticipate in execution activities, including responsibility for managing standard workstreams such as preparing bakeoff decks, marketing materials and analytical models across M&A, debt and equity processes\n\\n\nBuild and apply valuation models based on financial research & analysis including comparable company analysis, discounted cash flow analysis and comparable acquisitions analysis\n\\n\nWork directly with our large-cap corporate, middle-market and founder-owned clients in executing on their strategic objectives\n\\n\nSupport broader sponsor coverage efforts and quarterly / annual business planning initiatives\n\\n\nConduct strategic advisory analyses, portfolio analytic reviews, corporate operations reviews, and synthesize / analyze large diligence data sets (census, datacube, WIPs, etc…)\n\\n\n\\n\nRequired qualifications, capabilities, and skills:\n\\n\n\\n\n1+ years of prior investment banking Coverage or M&A experience\n\\n\nResults driven and able to perform well under pressure and against tight deadlines\n\\n\nStrong analytical and numerical skills that put you at ease with financial data\n\\n\nProven team player who is able to effectively interact with a wide variety of internal groups and clients\n\\n\nStrong multi-tasking and communication skills\n\\n\nStrong Microsoft Office suite (Excel and PowerPoint a must) and financial reporting skills\n\\n\nBachelor's degree in finance, business, accounting, economics, mathematics or a related field\n\\n\nABOUT US\n\\n\n\\n\n\\n   JPMorganChase, one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\\n\n\\n\n\\n\n\\n\nWe offer a competitive total rewards package including base salary determined based on the role, experience, skill set and location. Those in eligible roles may receive commission-based pay and/or discretionary incentive compensation, paid in the form of cash and/or forfeitable equity, awarded in recognition of individual achievements and contributions. We also offer a range of benefits and programs to meet employee needs, based on eligibility. These benefits include comprehensive health care coverage, on-site health and wellness centers, a retirement savings plan, backup childcare, tuition reimbursement, mental health support, financial coaching and more. Additional details about total compensation and benefits will be provided during the hiring process.\n\\n\n\\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.\n\\n\nJPMorgan Chase & Co. is an Equal Opportunity Employer, including Disability/Veterans\n\\n\n\\n\n\\n\nABOUT THE TEAM\nJ.P. Morgan’s Commercial & Investment Bank is a global leader across banking, markets, securities services and payments. Corporations, governments and institutions throughout the world entrust us with their business in more than 100 countries. The Commercial & Investment Bank provides strategic advice, raises capital, manages risk and extends liquidity in markets around the world.\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=0ec6da68e16d7801&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfp3d75l0258c6&spon=0&xkcb=SoBw67M3pv6CdcW0BR0PbzkdCdPP&xfps=f8a5b724-9bb2-4e32-9e6a-2bcee86c1286&vjfrom=vjs&asub=mob&astse=ff612321f42433a3&assa=1414"
}