{
  "filename": "data_analyst_New_York__NY_page12_job13_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "OFF OF PAYROLL ADMINISTRATION",
  "location": "5 Manhattan W, Manhattan, NY 10001",
  "salary": "$114,930 - $140,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:26:51.845Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nBusiness Analyst\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nOFF OF PAYROLL ADMINISTRATION\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted On: 10/28/2025\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nFull-Time\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Location\\n\n\\n\n\\n          MANHATTAN\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nExam May Be Required\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n           Department\\n\n\\n\n\\n           Citywide Sys Business Analysis\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Salary Range:\\n\n\\n\n\\n          $114,930.00 – $140,000.00\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Description\n\\n\n\\n\n\\n\n\\n\n\\n      The NYC Financial Information Services Agency-Office of Payroll Administration (FISA-OPA) seeks to hire a Computer Specialist SW, L4 for the CityTime Business Payrules Operations Support Team. Under direction of the CityTime Payrules Support Manager, and with some latitude for independent initiative and judgement, the selected candidate will serve as a seasoned Business Analyst. This individual should have exceptional research, analytical skills with robust technical background.\nTypical areas of work include:\n\\n\n\\n\nBusiness requirements gathering & analysis\n\\n\nRead, comprehend, and decipher contractual documentation as well as City policy documentation\n\\n\nLead meetings with stakeholders (i.e., Timekeepers, Managers, Directors, Assistant/Associate Commissioners, etc...)\n\\n\nDocumentation of meetings\n\\n\nDocumentation of business requirements\n\\n\nDesign analysis\n\\n\nPerform design analysis to determine how the new requirements will need to be incorporated into the functional and or technical design of our functional system\n\\n\nFunctional requirements gathering & analysis\n\\n\nReview finalized business requirements with functional teams (i.e., Functional Analysis, QA, Development, etc...)\n\\n\nReview and assist with the documentation of the functional requirements\n\\n\nReview and assist with documentation of test case scenarios\n\\n\nReview and assist with the documentation of the technical design\n\\n\nImplementation\n\\n\nPerform “smoke tests” prior to rules being deployed to the production environment\n\\n\nCreate and distribute communications (i.e., bulletins, emails, etc..) to stakeholders prior to the rules being deployed to production to ensure that all stakeholders have ample time to prepare for the implementation\n\\n\nSupport\n\\n\nProvide support to NYC Office of Labor Relations\n\\n\nUnion inquiries\n\\n\nAgency Inquires\n\\n\nGrievance support\n\\n\nProvide support to agencies\n\\n\nProvide answers to inquires\n\\n\nPreferred Skills:\n\\n\n\\n\nExcellent analytical skills\n\\n\nExcellent critical thinking skills\n\\n\nLogic based thinker\n\\n\nExcellent communications skills\n\\n\nExcellent writing skills\n\\n\nExcellent computer skills\n\\n\nMicrosoft Excel\n\\n\nMicrosoft Word\n\\n\nMicrosoft Visio\n\\n\nSQL\n\\n\nKnowledgeable in payroll & timekeeping\n\\n\nMust currently be permanent in the civil service title of Computer Specialist (or comparable title).\n\\n\nAdditional Information:\n#O-TBD\nTo Apply:\nApplicants may visit the Jobs NYC website: www.nyc.gov/jobs and apply to Job ID: 753289. While all complete applications will be given consideration, only candidates selected for an interview will be contacted.\nHours/Shift:\n35 Hours/Day Shift\nWork Location:\n5 Manhattan West, New York, NY\nCOMPUTER SPECIALIST (SOFTWARE) - 13632\\n\n\\n\nMinimum Qualifications\n\\n\n(1) A baccalaureate degree from an accredited college, including or supplemented by twenty-four (24) semester credits in computer science or a related computer field and two (2) years of satisfactory full-time software experience in designing, programming, debugging, maintaining, implementing, and enhancing computer software applications, systems programming, systems analysis and design, data communication software, or database design and programming, including one year in a project leader capacity or as a major contributor on a complex project; or\n(2) A four-year high school diploma or its educational equivalent and six (6) years of full-time satisfactory software experience as described in “1\" above, including one year in a project leader capacity or as a major contributor on a complex project; or\n(3) A satisfactory combination of education and experience that is equivalent to (1) or (2) above. College education may be substituted for up to two years of the required experience in (2) above on the basis that sixty (60) semester credits from an accredited college is equated to one year of experience. A masters degree in computer science or a related computer field may be substituted for one year of the required experience in (1) or (2) above. However, all candidates must have a four year high school diploma or its educational equivalent, plus at least one (1) year of satisfactory full-time software experience in a project leader capacity or as a major contributor on a complex project.\nNOTE: In order to have your experience accepted as Project Leader or Major Contributor experience, you must explain in detail how your experience qualifies you as a project leader or as a major contributor. Experience in computer operations, technical support, quality assurance (QA), hardware installation, help desk, or as an end user will not be accepted for meeting the minimum qualification\nrequirements.\nSpecial Note\nTo be eligible for placement in Assignment Level IV, in addition to the Qualification Requirements stated above, individuals must have one year of satisfactory experience in a project leader capacity or as a major contributor on a complex project in data administration, database management systems, operating systems, data communications systems, capacity planning, and/or on-line applications programming.\n\\n\n55a Program\nThis position is also open to qualified persons with a disability who are eligible for the 55-a Program. Please indicate at the top of your resume and cover letter that you would like to be considered for the position through the 55-a Program.\n\\n\nPublic Service Loan Forgiveness\nAs a prospective employee of the City of New York, you may be eligible for federal loan forgiveness programs and state repayment assistance programs. For more information, please visit the U.S. Department of Education’s website at https://studentaid.gov/pslf/.\n\\n\nResidency Requirement\nNew York City Residency is not required for this position\n\\n\nAdditional Information\n\\n\n\\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n        Job ID\\n\n\\n\n\\n        753289\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title code\\n\n\\n\n\\n         13632\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Civil service title\\n\n\\n\n\\n         COMPUTER SPECIALIST (SOFTWARE)\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title classification\\n\n\\n\n\\n         Competitive-1\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Business title\\n\n\\n\n\\n         Business Analyst\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Experience Level:\\n\nExperienced (Non-Manager)\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Job level\\n\n\\n\n\\n         04\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Number of positions\\n\n\\n\n\\n         1\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Work location\\n\n\\n\n\\n         5 Manhattan West\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Category:\\n\nTechnology, Data & Innovation\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n      Business Analyst\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=50c4b4bdba8a93de&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoBe67M3pv5_3dy4ax0GbzkdCdPP&xfps=5960e789-5d60-47ee-82df-960d535240ed&vjfrom=vjs&asub=mob&astse=8d2abb70817e6509&assa=7335"
}