{
  "filename": "data_analyst_Houston__TX_page1_job4_Data_Analyst__Python_SQL___Fin.html",
  "job_title": "Data Analyst (Python/SQL + Finance knowledge) - Onsite",
  "company": "Quest Global",
  "location": "Houston, TX",
  "salary": "$45,000 - $54,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:43:35.549Z",
  "full_description": "\\n\nJob Requirements\n\\n\nQuest Global delivers world-class end-to-end engineering solutions by leveraging our deep industry knowledge and digital expertise. By bringing together technologies and industries, alongside the contributions of diverse individuals and their areas of expertise, we are able to solve problems better, faster. This multi-dimensional approach enables us to solve the most critical and large-scale challenges across the aerospace & defense, automotive, energy, hi-tech, healthcare, medical devices, rail and semiconductor industries.\n\\n\n\\n\nWe are looking for humble geniuses, who believe that engineering has the potential to make the impossible possible; innovators, who are not only inspired by technology and innovation, but also perpetually driven to design, develop, and test as a trusted partner for Fortune 500 customers. As a team of remarkably diverse engineers, we recognize that what we are really engineering is a brighter future for us all. If you want to contribute to meaningful work and be part of an organization that truly believes when you win, we all win, and when you fail, we all learn, then we’re eager to hear from you. The achievers and courageous challenge-crushers we seek, have the following characteristics and skills\n\\n\n\\n\nKey Responsibilities:\n\\n\n\\n\nDevelop and maintain data pipelines using Python and SQL\n\\n\nPerform financial data analysis and create dashboards/reports for financial metrics.\n\\n\nWork with Finance teams to interpret P&L, Balance Sheet, and other financial statements.\n\\n\nEnsure compliance with financial reporting standards.\n\\n\n\\n\nWork Experience\n\\n\nRequired Skills\n\\n\n\\n\nStrong proficiency in Python\n\\n\nAdvanced SQL knowledge\n\\n\nExperience with BI tools (Power BI, Tableau, etc.)\n\\n\nKnowledge with data modelling and ETL processes\n\\n\nUnderstanding of GL, P&L, Balance Sheet, and variance analysis\n\\n\nKnowledge of budgeting, forecasting, and financial KPIs\n\\n\nAbility to work cross-functionally with Finance and Data teams\n\\n\n\\n\nEducation\n\\n\nBachelor’s degree in data science, Computer Science, or related field.\n\\n\nRole Mix\n\\n\n\\n\n60–70% Data Analytics\n\\n\n30–40% Financial Analysis\n\\n\nBenefits\n\\n\nPay Range\n:$45k-$54k/annum\n\\n\nBenefits:\n\\n\n\\n\n401(k) matching\n\\n\nDental insurance\n\\n\nHealth insurance\n\\n\nPaid time off\n\\n\nVision insurance\n\\n\n\\n\nWork Requirements:\n\\n\nThis role is considered an on-site position located in\nHouston, TX\n\\n\n\\n\nYou must be able to commute to and from the location with your own transportation arrangements to meet the required working hours.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}