{
  "filename": "data_analyst_New_York__NY_page12_job9_Accelerate___Business_Insights.html",
  "job_title": "Accelerate - Business Insights Analyst (Post Graduation Opportunity)",
  "company": "Avis Budget Group",
  "location": "Parsippany-Troy Hills, NJ 07054",
  "salary": "$60,000 - $85,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:26:22.686Z",
  "full_description": "\\n\n\\n\nWant to accelerate your career? Join a team of driven people, performing with purpose.\n\\n\n\\n\nAt Avis Budget Group, we are proud to be a\nperformance driven organization. Our 21,000+ employees encourage\neach other to be at their best through outstanding leadership, training and tools and rewards.\n\\n\nAs a participant of our ABG Accelerate internship program you will be encouraged to explore different areas of our business to grow both personally and professionally to jump start a rewarding career.\n\\n\n\\n\n*This role is for DEC 2025 or MAY/JUNE 2026 grads ONLY*\n\\n\n\\n\nWhat you’ll do:\n\\n\n\\n\nEngage with business teams to understand challenges, provide thought leadership, and identify how advanced analytics solutions could be leveraged\n\\n\nDraw conclusions and make actionable recommendations based on analysis\n\\n\nHelp better leverage, utilize, and instill advanced analytics solutions throughout the organization\n\\n\nDesign and develop advanced analytics solutions\n\\n\nEnsure that advanced analytics solutions are practical and effective based on expertise and experience\n\\n\nDevelop processes and tools to measure and monitor solution performance and value achievement\n\\n\nContinually improve existing analytical based solutions\n\\n\n\\n\n\\n\nWhat we’re looking for:\n\\n\n\\n\nBachelor’s / Master's degree in Business Analytics, Data Engineering, Data Science, Econometrics, Statistics or related field\n\\n\nInternship experience delivering analytical solutions or equivalent combination of education and relevant internship experience in data analytic type roles.\n\\n\nExperience with database queries (e.g., Oracle, SQLServer) and at least one programming language (e.g. Python or R)\n\\n\nKnowledge of BI tools (e.g., Tableau, Power BI)\n\\n\nAbility to think strategically and identify critical success factors when developing solutions\n\\n\nStrong communication, organization, and time management skills\n\\n\nAbility to work effectively in a team oriented, high demand, and fast paced environment\n\\n\n\\n\n\\n\nThe annual starting salary for this position is between $60,000 – $85,000.\nFactors that may affect starting pay within this range include geography/market, skills, education, work experience, and other qualifications of the successful candidate.\n\\n\n\\n\nWho we are:\n\\n\nHere at Avis Budget Group, you will be joining a team of 25,000 driven people, performing with purpose. Together, we’re moving the future of transportation forward with our innovative, customer-focused solutions.\n\\n\nOur culture is performance driven, where we encourage and support each other to be at our best through leadership, training, tools, and rewards.\n\\n\nWe are proud to make a positive difference to the lives of our colleagues, customers, and communities where we operate.\n\\n\nAvis Budget Group is an Equal Opportunity Employer – Qualified applicants will receive consideration for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran or any other category protected by applicable law.\n\\n\n\\n\nThis advertisement does not constitute a promise or guarantee of employment. This advertisement describes the general nature and level of this position only. Essential functions and responsibilities may change as business needs require. The compensation and benefits information is accurate as of the date of this posting. The Company reserves the right to modify this information at any time, with or without notice, subject to applicable law. This position may be with any affiliate of Avis Budget Group.\n\\n\nParsippany\\n\nNew Jersey\\n\nUnited States of America\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=727f01aa6e0a29d9&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoBN67M3pv5_3dy4ax0CbzkdCdPP&xfps=88ef3b35-b4e9-42df-a3ea-659a650869f2&vjfrom=vjs&asub=mob&astse=d709965be014f1b2&assa=8303"
}