{
  "filename": "data_analyst_New_York__NY_page8_job2_Analyst.html",
  "job_title": "Analyst",
  "company": "Paul Hastings",
  "location": "New York, NY 10166",
  "salary": "$91,000 - $116,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:15:41.308Z",
  "full_description": "\\n\nPaul Hastings is a leading international law firm that provides innovative legal solutions to many of the world's top financial institutions and Fortune Global 500 companies. With a strong presence throughout the U.S., Asia, Europe, Latin America, and the Middle East, we have the global reach and extensive capabilities to provide personalized service wherever our clients’ needs take us. As one of the world’s leading law firms, we seek dynamic individuals who share our commitment to service, innovation, and professional growth.\n\\n\nWe have an opening for an Analyst, Legal Project Management.\n\\n\nThe Analyst, Legal Project Management is responsible for supporting the firm's legal project management (LPM) function. This includes helping to implement LPM policies and procedures, and managing the firm's LPM software and tools. The Analyst, Legal Project Management works closely with partners and clients to ensure that legal projects are completed on time, within budget, and to the highest possible standards. Candidates for the Analyst, Legal Project Management role will have strong interpersonal skills a background in project management and legal experience. They should also be familiar with the unique challenges and opportunities of working in a law firm environment.\n\\n\nIn this capacity, the Analyst, Legal Project Management will:\n\\n\n\\n\nWork with the LPM team that offers best in class LPM support in an AMLaw 50 firm;\n\\n\nSupport the firm's LPM strategy by leveraging and developing analytics and technology solutions;\n\\n\nAssist firm lawyers and staff in implementing LPM best practices;\n\\n\nManage/Implement the firm's LPM software and tools;\n\\n\nSupport the firm's LPM process for assigned practice groups;\n\\n\nWork with Legal Project Management team to develop and manage project budgets and timelines;\n\\n\nIdentify and implement process improvements;\n\\n\nHelp create tracking and reporting templates for scheduled reports and ad hoc needs; and\n\\n\nCreate and update data and dashboard solutions, with emphasis on visualizations.\n\\n\n\\n\nProficiencies:\n\\n\n\\n\nSuperior level of attention to detail – ensures the integrity/accuracy of the data;\n\\n\nStrong analytical and technical skills with experience working with large data sets;\n\\n\nAdvanced proficiency in Excel, PowerBI and/or other business intelligence tools;\n\\n\nStrong financial analysis skills, including the ability to prepare concise reports to assist firm management in assessing the effectiveness and financial impact of managed engagements;\n\\n\nStrong interpersonal and relationship-building skills, with the ability to interact effectively with attorneys and firm professional staff at all levels;\n\\n\nAbility to work independently and be proactive;\n\\n\nAbility to apply mathematical and basic statistical concepts, including fractions, percentages, and ratios, to large volumes of data to reach meaningful conclusions;\n\\n\nSuperior organizational skills, including the ability prioritize workload, coordinate multiple projects simultaneously, meet deadlines, and ability to be flexible and adapt to change;\n\\n\nAbility to learn, leverage and use additional programs, including LPM, Pricing, budgeting and financial management software;\n\\n\nWorking knowledge of legal services financial and billing systems preferred;\n\\n\nFamiliarity with pricing of legal services, including a strong working knowledge of non-hourly pricing models (alternative fee arrangements); and\n\\n\nAbility to protect and maintain confidential and sensitive information.\n\\n\n\\n\nQualifications:\n\\n\n\\n\nBachelor’s degree (preferred); and\n\\n\n3+ years related experience, in a law firm, in-house law department or other relevant office environment (required).\n\\n\n\\n\nEmployees will be provided with an excellent career opportunity in a collaborative environment, in addition to a generous total compensation package with the opportunity to earn bonuses based on individual contribution and firm profitability.\n\\n\nThe salary wage range that we expect to pay for this position is a minimum of $91,000 and a maximum of $116,000 annually. The actual pay wage may vary based on experience or other relevant factors.\n\\n\nEligible employees can participate in the Firm’s comprehensive benefits program, which include the following:\n\\n\n\\n\nMedical, Dental, Vision, Life/AD&D, Long Term Care, and Short- and Long-Term Disability\n\\n\nFlexible Spending Accounts and Health Savings Account\n\\n\nHealthcare Concierge and Advocacy\n\\n\nLifestyle Spending Account\n\\n\nVoluntary 401(k) Plan and Profit Sharing\n\\n\n10 Paid Holidays per year and a generous PTO Program\n\\n\nFamily Support including Paid Parental Leave, Fertility Benefits, Breast Milk Shipping, Back-up Child Care, Elder Care, and Tutoring\n\\n\nWellbeing programs (Employee Assistance Program, Relationship Support, Mental Health, Menopause and Midlife Health and Well-Being Events)\n\\n\nRetirement Plan Consulting\n\\n\nAnniversary Bonus Program\n\\n\nProfessional Development Programs\n\\n\nTransportation and Commuter Benefits\n\\n\nInternational Travel Insurance\n\\n\nCritical Illness, Hospital Indemnity and Accident Insurance\n\\n\nAuto/Home/Pet Insurance\n\\n\nPrepaid Legal Insurance\n\\n\nEmployee Discounts\n\\n\nAnd More!\n\\n\n\\n\n\\n\nThe Firm fosters an open and inclusive work environment that enables us to provide clients with the innovative thinking of teams rich in talent, experience and creativity. We regularly host programs intended to increase cultural competencies and address key topics related to community, opportunity and inclusion. Learn more about our Global Inclusion initiatives here: Global Inclusion.\n\\n\nPaul Hastings is an equal opportunity employer.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=8f320237d9d6223d&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoa4c0i8qp87r&spon=0&xkcb=SoBw67M3pv4nSMACJ70IbzkdCdPP&xfps=8072a728-c4a1-4b05-bed6-5c83e4864233&vjfrom=vjs&asub=mob&astse=8754c52d783af8d4&assa=1723"
}