{
  "filename": "data_analyst_New_York__NY_page9_job11_Free_People_Customer_Insights_.html",
  "job_title": "Free People Customer Insights Analyst",
  "company": "Free People",
  "location": "5000L South Broad Street, Philadelphia, PA 19112",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:19:37.729Z",
  "full_description": "\\n Role Summary: \\n\n\\n  Free People is seeking a Customer Insights Analyst. In this role, you’ll be a key member of the Consumer Insights Team, helping the business understand emerging trends and uncover new research opportunities. You’ll track macro-trends, validate research across digital, brand, and category teams, and dig into the nuances of consumer behavior in the fast-moving fashion landscape. Your work will help shape decisions that keep our brand connected to our customers.\\n\n\\n\n\\n\n\\n\nReports into: Manager, Global Customer Experience & Insights\\n\nRole Responsibilities: \\n\n\\n\nResearch & Analysis\n\\n\n\\n\n\\n\nLead comprehensive market intelligence initiatives by analyzing brand competitors, product offerings, promotions, macroeconomic trends to uncover critical external market influences.\n\\n\nSynthesize and integrate customer preference data and trend insights from external sources, augmenting internal data to inform decision-making.\n\\n\nProactively influence product development and brand positioning efforts by conducting SWOT analyses to identify and capitalize on opportunities derived from internal and external research.\n\\n\n\\n\n\\n\nProject Support & Management\n\\n\n\\n\n\\n\nManage customer panel initiatives and expand survey & focus group experiences to improve the breadth and depth of insights.\n\\n\nAssist in the launch and management of customer and non-customer panels for the US, UK, and FP Movement.\n\\n\nExplore and evaluate potential research partners to enhance current capabilities.\n\\n\nSupport diverse projects aimed at shaping consumer-centric strategies across the organization.\n\\n\n\\n\n\\n\nReporting & Presentation\n\\n\n\\n\n\\n\nCreate easily digestible presentations that summarize key learnings and recommendations to leadership.\n\\n\nIntroduce more routine insights reporting to ensure continuous visibility into customer trends and behaviors\n\\n\nRole Qualifications: \\n\n\\n\nBachelor’s degree in psychology, cognitive science, sociology, behavioral economics\n\\n\n1-3 years of experience in research, analytics, or marketing\n\\n\nStrong understanding of consumer behavior and curiosity to explore it further\n\\n\nMeticulous attention to detail with quality assurance expertise\n\\n\nAbility to articulate complex ideas clearly and effectively\n\\n\nExceptional time management, organization, and multitasking skills\n\\n\nProven ability to build cross-functional relationships and collaborate seamlessly\n\\n\n\\n\n\\n\nBonus Skills:\n\\n\n\\n\nExperience with or understanding of Qualtrics/similar logic-based survey software\n\\n\nFamiliarity with data visualization and BI tools such as Tableau or MicroStrategy\n\\n\nExperience with SPSS, SAS, R, or other statistical analysis program a plus\n\\n\nSQL/database knowledge\n\\n\n\\n\n\\n\n#LI-AZ1\nThe Perks: \\n\n\\n  URBN offers comprehensive Perks & Benefits to employees. Availability and eligibility to specific benefits may be subject to your location and employment status. Benefits include medical, dental, vision, PTO, generous employee discounts, retirement savings and much more! For additional information visit www.urbn.com/work-with-us/benefits\\n\nEEO Statement: \\n\nURBN celebrates diversity and is committed to creating an inclusive environment for all employees. We are proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, sex (including gender, pregnancy, sexual orientation, and gender identity or expression), religion, creed, age, physical or mental disability, national origin or ancestry, ethnicity, citizenship, service in the uniformed services, genetic information, or any other protected characteristic as established by law. We believe strongly in fostering a safe, fair and respectful work environment. To ensure compliance with our non-discrimination and anti-harassment policies, we offer anti-harassment training to managers and employees.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}