{
  "filename": "data_analyst_New_York__NY_page4_job10_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "Mpower Logic",
  "location": "242 Old New Brunswick Rd Ste 360, Piscataway, NJ 08854",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:58:04.847Z",
  "full_description": "Analyze business & end-user requirements into appropriate system & software functional requirement; translate business ideas & concepts into clearly defined system requirements using MS Office, RUP tolls, Requisite Pro, Clear Quest, Software Architect (RSA) & IBM business models & develop requirement traceability matrices; create business rules & pricing logic as reference for processing claims payment as per the company policies & the industry st&ards facilitate JAD sessions, analyze business problems & perform business process re-engineering (BPR); provide project level quality assurance leadership & guidance to maintaining the software quality assurance through every phase of the software life cycle; create test plans & test cases based on business requirement documents & manually execute test scripts. Relocation/ telecommuting may be required plus travel to various unanticipated client locations within the United States for short & long term assignments. Master's in computers/ business/ information systems/ Management Information Systems/ related. Will accept Bachelor's degree in computers/ business/ business information systems/ Management Information Systems/ related followed by 5 yrs. of progressive experience in the field or related field in lieu of Masters. Respond to HR Manager, Job #: BA/RG/17-6, MPower Logic, Inc., 242 Old New Brunswick Road, Suite # 360, Piscataway, NJ 08854.\n\\n\nWe have these immediate opportunities for our data management and KPO center. If you have what we are looking for, please apply online (Apply Online) or e-mail your resume to resumes@mpowerlogic.com",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=792542107d837211&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfn8f3pi9eb8ah&spon=0&xkcb=SoDq67M3pvmuMEygLZ0BbzkdCdPP&xfps=b5753b3c-fc9d-4161-a75a-aa4ee6b9e330&sjdu=plYPK8JzJpXbLTG6vynqOPC4s6I5s_CSpvmzeeaEQRcNlEqnnyDd2VrJNLrR65dSOOMt8krrczqyruE8DEchmA&vjfrom=vjs&asub=mob&astse=88d317ec935f7418&assa=9922"
}