{
  "filename": "data_analyst_New_York__NY_page6_job6_Senior_Technical_Business_Anal.html",
  "job_title": "Senior Technical Business Analyst",
  "company": "Quest Diagnostics",
  "location": "Secaucus, NJ",
  "salary": "$100,000 - $130,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:01:38.499Z",
  "full_description": "\\n\nA Technical Business Analyst bridges the gap between business needs and technical capabilities. The role combines business analysis and technical requirements gathering with analyzing existing systems, identifying areas for improvement, and designing and implementing technology solutions to meet requirements. The role collaborates closely with stakeholders to understand business needs, gather requirements, translate them into specifications, and ensure successful project delivery while maintaining alignment with overall business objectives.\n\\n\n\\n\n\\n\nPay Range: $100,000 - $130,000 / year\n\\n\n\\n\n\\n  Salary offers are based on a wide range of factors including relevant skills, training, experience, education, and, where applicable, certifications obtained. Market and organizational factors are also considered. Successful candidates may be eligible to receive annual performance bonus compensation.\\n\n\\n\n\\n\n\\n\nBenefits Information:\n\\n\n\\n\n\\n  We are proud to offer best-in-class benefits and programs to support employees and their families in living healthy, happy lives. Our pay and benefit plans have been designed to promote employee health in all respects – physical, financial, and developmental. Depending on whether it is a part-time or full-time position, some of the benefits offered may include:\\n\n\\n\n\\n\nMedical/Prescription Drugs\n\\n\nDental\n\\n\nVision\n\\n\nFlexible Spending Accounts (FSAs)\n\\n\nSupplemental Health Plans\n\\n\n401(k) Plan – Company match dollar-for-dollar up to 5%\n\\n\nEmployee Stock Purchase Plan (ESPP)\n\\n\nSupplemental Life Insurance\n\\n\nDependent Life Insurance\n\\n\nShort- and Long-Term Disability buy-up\n\\n\nBlueprint for Wellness\n\\n\nEmotional Well-Being Resources\n\\n\nEducational Assistance\n\\n\nPaid time off / Health Time\n\\n\nVariable Compensation Plans\n\\n\nSales Incentive Plans\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Quest Diagnostics honors our service members and encourages veterans to apply.\nWhile we appreciate and value our staffing partners, we do not accept unsolicited resumes from agencies. Quest will not be responsible for paying agency fees for any individual as to whom an agency has sent an unsolicited resume.\nEqual Opportunity Employer: Race/Color/Sex/Sexual Orientation/Gender Identity/Religion/National Origin/Disability/Vets or any other legally protected status.\\n\n\\n\n\\n\n\\n\n\\n\nBusiness Analysis\n\\n\n\\n\nAssist in gathering and documenting business requirements\n\\n\nSupport the creation of user stories, functional specifications, and process maps\n\\n\nIdentify gaps and propose potential solutions\n\\n\nSupport the definition of key success metrics and KPIs for ongoing product evaluation\n\\n\n\\n\n\\n\nTechnical Business Analysis\n\\n\n\\n\nCollaborate with technical teams to translate business requirements into actionable technical specifications\n\\n\nAssist in creating data flow diagrams, wireframes, and prototypes for communication with technical teams\n\\n\nProvide support in evaluating technical solutions to ensure alignment with business objectives.\n\\n\nParticipate in the integration and testing phases, ensuring solutions meet business and technical standards\n\\n\n\\n\n\\n\nProduct Development\n\\n\n\\n\nAssist in managing the product backlog ensuring alignment with business goals\n\\n\nSupport prioritization of tasks and requirements based on business value\n\\n\nHelp define and document user stories, ensuring clarity and technical feasibility\n\\n\nParticipate in Agile (or other software engineering methods) ceremonies, including sprint planning\n\\n\nEnsure timely delivery of functional requirements to development teams\n\\n\n\\n\n\\n\nCollaboration & Communication\n\\n\n\\n\nCommunicate with business and technical stakeholders\n\\n\nPrepare documentation as needed\n\\n\nParticipate in status meetings and share project progress with stakeholders\n\\n\n\\n\nQUALIFICATIONS\n\\n\nRequired Work Experience:\n\\n\n\\n\n1-3 years of experience in business analysis, technical analysis, or product development, ideally in healthcare or data analytics.\n\\n\nExposure to data systems, particularly healthcare data such as EHR or claims data.\n\\n\n\\n\n\\n\nPreferred Work Experience:\n\\n\n\\n\n2-5 years Business Analyst, Technical Product Manager, or Agile Product owner\n\\n\n\\n\n\\n\nPhysical and Mental Requirements:\n\\n\nN/A\n\\n\n\\n\nKnowledge\n:\n\\n\n\\n\nPrefer bachelors degree in Business, Information Technology, Healthcare, a related field, or relevant prior work experience.\n\\n\nCoursework in business analysis or product development are a plus.\n\\n\nFamiliarity with Agile methodologies and iterative development.\n\\n\nFamiliarity with SFDC process.\n\\n\n\\n\n\\n\nSkills:\n\\n\n\\n\nStrong communication skills, with the ability to collaborate with both technical and non-technical stakeholders.\n\\n\nBasic knowledge of project management tools (e.g., JIRA, Confluence) is an advantage.\n\\n\nStrong organizational skills and the ability to work on multiple tasks simultaneously.\n\\n\nAn eagerness to learn and develop new skills in business analysis and product development.\n\\n\n\\n\n\\n\nEDUCATION\n\\n\n\\n\nLICENSECERTIFICATIONS\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}