{
  "filename": "data_analyst_New_York__NY_page7_job11_Research_and_Data_Analyst___St.html",
  "job_title": "Research and Data Analyst – Strategic, Defense & Shareholder Advisory Team",
  "company": "Evercore",
  "location": "New York, NY 10022",
  "salary": "$70,000 - $90,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:14:48.174Z",
  "full_description": "\\n\n\\n  Region \\n\n\\n\n\\n\n\\n    Americas\\n\n\\n\n\\n\n\\n\n\\n  Location \\n\n\\n\n\\n\n\\n    New York\\n\n\\n\n\\n\n\\n\n\\n  Group \\n\n\\n\n\\n\n\\n    Investment Banking\\n\n\\n\n\\n\n\\n\n\\n  Job description \\n\n\\n\n\\n\n\\n\nWhat is the position?\nEvercore seeks to hire a Research and Data Analyst for its Strategic, Defense & Shareholder Advisory Team (“SDSA”) located in New York, NY. The SDSA team focuses on advising clients with respect to shareholder activism, raid defense, and related situations.\n\\n\nPrimary Responsibilities\n: The Analyst will support the Head and COO of the SDSA team and will be responsible for collecting, organizing, and maintaining data on companies, clients, and interactions to support the team’s day-to-day activities. This includes managing internal databases, tracking client interactions and key information, and assisting with research and data requests. The Analyst should have a proactive approach to ensure information is accurate, well-organized, and up-to-date. The Analyst will create materials for use in internal meetings and marketing initiatives. The Analyst will also be responsible for coordinating information and events involving external constituents (such as law firms and public company directors) and developing and enhancing firm networks.\n\\n\nSpecific Qualifications:\nThe Analyst will have strong attention to detail, clear communications style and be proactive, self-directed, creative and resourceful. We are seeking an academically accomplished candidate with the ability to multitask. This position comes with challenging work, an opportunity to work closely with senior leaders, and a demanding environment in a rapidly growing firm.\n\\n\nThe ideal candidate will have:\n\\n\n\\n\nOne year of professional experience\n\\n\nStrong academic record\n\\n\nAn excellent, team-based attitude\n\\n\nStrong work ethic and high energy level\n\\n\nExcellent communication skills (written and verbal)\n\\n\nProficient in Microsoft Office, specifically PowerPoint and Excel\n\\n\nExceptional attention to detail\n\\n\nCalm under pressure with a demonstrated track record of successfully managing multiple projects simultaneously\n\\n\nInterest in investment banking, paralegal work, or research/analytical roles encouraged\n\\n\n\\n\nExpected Base Salary Range: $70,000-$90,000\n\\n\nIn addition to a competitive base salary, employees may be eligible to receive a discretionary bonus delivered in the form of cash and/or deferred equity. Evercore also offers a variety of benefits and programs, subject to eligibility. These include, but are not limited to:\n\\n\n\\n\nMedical, prescription, dental, and vision insurance, including healthcare savings and reimbursements accounts\n\\n\n401(k) Retirement Plan\n\\n\nLife and disability insurance, including additional voluntary financial protection insurance\n\\n\nWell-being resources and programs, including mental health and mindfulness programs, digital wellness platforms, well-being events, and targeted on-site health services\n\\n\nFamily-building and family-support benefits\n\\n\nPaid parental, caregiver, marriage and bereavement leave\n\\n\nCommuter benefits, health club membership discounts, and other corporate discounts\n\\n\nPaid holidays, vacation days, personal days, sick days, and volunteer opportunities\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nAbout Evercore:\nEvercore (NYSE: EVR) is a premier global independent investment banking advisory firm. We are dedicated to helping our clients achieve superior results through trusted independent and innovative advice on matters of strategic significance to boards of directors, management teams, and shareholders - including mergers and acquisitions, shareholder advisory, restructurings, and capital structure. Evercore also assists clients in raising public, private capital, delivers equity research, equity sales and agency trading execution, in addition to providing wealth and investment management services to high-net-worth individuals. Founded in 1995, the Firm is headquartered in New York and maintains offices and affiliate offices in major financial centers in North America, Europe, the Middle East, and Asia. For more information, please visit www.evercore.com.\n\\n\nInclusion and Equal Opportunity Employment\n:\nEvercore is an equal employment opportunity employer and does not discriminate against individuals because of actual or perceived race, color, creed, religion, sex, pregnancy, national origin or ancestry, mental or physical disability, age, veteran status, military status, citizenship status, sexual orientation, gender identity or expression, genetic information, or immigration or citizenship status, or any other characteristic protected by applicable law (referred to as “protected status”), in accordance with applicable federal, state and local laws.\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=a8a3dab87edc9a38&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfo1hnsi8qp803&spon=0&xkcb=SoCp67M3pv4J5G2EiJ0AbzkdCdPP&xfps=f0fb3501-3fad-4625-85bf-15369088b0e4&vjfrom=vjs&asub=mob&astse=6f81d011bd1444e5&assa=8491"
}