{
  "filename": "data_analyst_New_York__NY_page1_job9_Data_Equity_Analyst.html",
  "job_title": "Data Equity Analyst",
  "company": "The Fund for Public Health in New York City",
  "location": "Queens, NY 11101•Hybrid work",
  "salary": "$70,000 - $75,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:52:46.054Z",
  "full_description": "Job Title:\nData Equity Analyst\nDepartment:\nData\nDivision:\nCenters for Disease Control and Prevention’s\nLocation:\n42-09 28th street, Long Island City, NY 11101\nSchedule & Hours:\n9:00am – 5:00pm Monday – Friday Hybrid\nWorkplace Flexibility Modality:\nIn-office, hybrid and remote work\nWork Environment:\nOffice\nSalary:\n$70,000 to $ 75,000\nFLSA Classification:\nNon-exempt\nWho We Are:\nThe Fund for Public Health in New York City (FPHNYC) is a 501(c)3 non-profit organization that is dedicated to the advancement of the health and well-being of all New Yorkers. To this end, in partnership with the New York City Department of Health and Mental Hygiene (DOHMH), FPHNYC incubates innovative public health initiatives implemented by DOHMH to advance community health throughout the city. It facilitates partnerships, often new and unconventional, between government and the private sector to develop, test, and launch new initiatives. These collaborations speed the execution of demonstration projects, effect expansion of successful pilot programs, and support rapid implementation to meet the public health needs of individuals, families, and communities across New York City.\nOur Culture:\nWe embrace a culture of learning, collaboration, innovation, and well-being, where open communication drives our impact.\nAbout the Program:\nEstablished in 1805, the New York City Department of Health and Mental Hygiene (DOHMH) is the oldest and largest health department in the country. DOHMH strives to protect and promote the health of all New Yorkers. With a vision to be a city where all New Yorkers can realize their full health potential, regardless of who they are, where they are from or where they live, our core values are science, equity, and compassion. A world-renowned public health agency responding to urgent public health crises from New York City’s yellow fever outbreak in 1822, to the COVID-19 pandemic, DOHMH has been a hub for public health innovation, expertise, and resource. From food policy, tobacco, HIV/AIDS, family child health, environmental health, mental health, and racial justice work, DOHMH’s impact to public policy across the nation has been vast. Our 7,000-plus team members bring extraordinary diversity to the work of public health. True to our value of equity, DOHMH has been a leader in recognizing and dismantling the impact of racism on the health of New Yorkers and more broadly. In 2021, the New York City Board of Health declared racism as a public health crisis. With commitment to dismantle systems that perpetuate inequitable power, opportunity, and access, DOHMH continues to work in and with communities with historic disinvestment and disease burden to decrease unfair and avoidable health outcomes so all New Yorkers can achieve their full health potential. The Division of Disease Control (DIS) serves as the infectious disease arm of DOHMH and includes seven bureaus including the Bureau of Public Health Clinics (BPHC). BPHC serves as direct care provider of the Division, operating 8 sexual health clinics, 4 tuberculosis chest centers, and COVID quickie clinics.\nAbout the Role:\nBPHC seeks a Data Equity Analyst to support data migration and reporting as it transitions from an existing electronic health record (EHR) to Epic. The Data Equity Analyst will be responsible for migrating historical patient data into the new Epic system, developing reports used by BPHC leadership to understand patient data, and conducting regular QA of Epic to ensure implementation is going smoothly. In addition, this individual will work collaboratively with BPHC stakeholders and IT ensure that patient demographics and clinical data are collected consistently and according to best practices. This position is funded through the Centers for Disease Control and Prevention’s (CDC) Epidemiology and Laboratory Capacity for Infectious Diseases Grant and will be hybrid.\nResponsibilities:\n\\n\n\\n\nLearn about the existing EMRs data structure and develop subject matter expertise\n\\n\nSupport data validation after EMR updates deployment\n\\n\nPerform data conversions including extracting data from non-Epic EHR systems, performing transformations upon the data, and importing it into Epic\n\\n\nSupport developing and executing test plans, exception-handling routines as well as source to target mappings for the purpose of archiving data of EMR systems and the migration data into Epic system\n\\n\nConduct data quality assurance activities throughout the migration process, as well as monitoring data quality after migration\n\\n\nContribute to data governance efforts including definitions, implementation, and organization\n\\n\nFollow data security and privacy policies, and stays up to date with recent data tools and trends\n\\n\nParticipate in meetings with multiple internal and external stakeholders to gather requirements, provide ongoing updates, and ensure business needs are met\n\\n\nSupport project management efforts of implementing new systems at the clinics\n\\n\nRequirements:\n\\n\n\\n\nBachelor's degree in IT, CSci, Health Informatics, data analysis, public health, master’s degree preferred\n\\n\nExperience using SQL, R or SAS\n\\n\nExperience with Epic and other EHRs\n\\n\nExperience with data migration to Epic system is highly preferred\n\\n\nExcellent written and oral communication skill\n\\n\nEmployment is contingent upon the successful completion of a background check\nBenefits:\n\\n\n\\n\nMeaningful work at an organization striving to advance health equity and social justice\n\\n\nThis position will be hired through a staffing agency. This position does not include benefits or paid holidays.\n\\n\nEqual Employment Opportunity Statement:\nFPHNY is an equal opportunity employer and prohibits discrimination and harassment of any kind. We provide equal employment opportunities to all employees and applicants without regard to race, color, religion, sex, national origin, age, disability, genetic information, marital status, veteran status, or any other legally protected status.\nAt-Will Employment Statement:\nEmployment with FPHNY is at-will, meaning that either the employee or the company may terminate the employment relationship at any time, with or without cause, and with or without notice. This job description does not constitute a contract of employment.\nResidency Requirement:\nYou must live in the New York City Tri-state area (NY, NJ, CT) to be considered for a position at FPHNY.",
  "apply_method": "indeed_apply",
  "apply_url": null
}