{
  "filename": "data_analyst_New_York__NY_page6_job2_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "Fortune Society Inc",
  "location": "29-76 Northern Boulevard, Long Island City, NY 11101",
  "salary": "$35.71 - $38.46 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:00:57.591Z",
  "full_description": "\\n\nTitle:\nData Analyst\n\\n\nUnit:\nEmployment Services\n\\n\nReports to:\nProgram Manager, Data – Education and Employment Services\n\\n\nStatus:\nFull-Time; Regular; Non-Exempt\n\\n\nSalary range:\n$35.71 - 38.46 per hour [Approximately $65,000 - $70,000 annually]\n\\n\nLocation:\nLong Island City, NY 11101\n\\n\nDays/Hours:\nMonday through Friday, 9:00am to 5:00pm\n\\n\n\\n\nOrganization Overview:\n\\n\nThe Fortune Society, Inc. (Fortune) has been working for over 57 years in service to our mission: to support successful reentry from incarceration and promote alternatives to incarceration, thus strengthening the fabric of our communities. The organization has evolved into one of the nation’s preeminent reentry and justice-informed service organizations, providing formerly-incarcerated people with the skills and wrap-around services needed to break the cycle of crime and incarceration and to build productive lives in their communities.\n\\n\n\\n\nFortune has grown steadily over the years to an agency just under $85 million in annual budget with just under 600 staff. We anticipate that we will keep growing, both in size and in depth of service. Fortune has a dual mission: both advocacy and service. The advocacy portion of our mission focuses on building a more just criminal legal system and reducing the barriers to reentry into society. The service side of Fortune has evolved to encompass a broad range of programs that started with employment and education and now includes a robust array of services, among them: alternatives to incarceration, supervised release, court advocacy, discharge planning within correctional facilities, licensed substance use and mental health treatment, a housing continuum ranging from emergency and transitional through permanent congregate and scattered site housing, assistance in obtaining benefits, a care management unit, HIV services, a food and nutrition program, and an arts program. Each service we provide is informed by the needs of the population we serve. Fortune currently serves approximately 14,000 people a year. Our participant population mirrors the incarcerated population in being approximately 85% male and over 90% people of color. Our program models are recognized, both nationally and internationally for their quality and innovation.\n\\n\n\\n\nPosition Summary:\n\\n\nUnder the direct supervision of the Program Manager, Data, the Data Analyst (DA) supports Fortune Society's RISE, Education and Employment Services programs through evaluation and reporting of data related to service delivery and outcomes. The position involves identifying and determining data points for collection, working with IT and Evaluation and Quality Improvement (EQI) staff to insure data collection points are available within our internal database, conducting quality assurance exercise to ensure accurate data collection is occurring with program staff, entering data into funder databases, submitting reporting to external funders, generating routine and ad-hoc reports that supports the program by monitoring activities, contract performance and program milestones.\n\\n\n\\n\nMission and Fit\n\\n\nThe DA must embody the values and mission of the Fortune Society. This includes meeting our participants where they are, demonstrating our values through compassion and understanding; and affirming that none of us should be measured against the worst things we have done.\n\\n\n\\n\nAttention to Detail\n\\n\nThe DA must demonstrate competency to develop systems and processes to organize and keep track of information or work progress; is routinely conscientious, thorough, accurate and reliable when performing and completing job tasks; and recognizes trends, detects inconsistencies, and determines essential details.\n\\n\n\\n\nCollaboration\n\\n\nThe DA should be comfortable collaborating with staff at all levels (senior staff and peers) within the RISE, Education and Employment Services and other department areas to understand complex problems and create solutions. The DA will be asked for input on department projects, so they should be comfortable contributing constructive feedback and be a team player in supporting the team in completing projects. The DA should be comfortable leading group conversations and facilitating meetings. The DA should be in command of critical issues, impacting both the assigned contracts and data needs of the department. The DA should be able to prioritize effectively as new projects come up and communicate project progress routinely.\n\\n\n\\n\nSystems Thinking\n\\n\nThe DA should possess an ability to do systems thinking and solve problems in a way that is creative and collaborative.\n\\n\n\\n\nData collection, analysis, and Excel expertise\n\\n\nThe DA needs to have experience using Excel for data analysis. They should understand basic Excel formulas and functions, PivotTables, charts, and graphs. The DA should also have familiarity with using client databases for data entry and reporting. The DA should have a foundational understanding of quantitative and qualitative methods and possess an ability to do \"big picture\" thinking and solve problems in a way that is creative and collaborative.\n\\n\n\\n\nEssential Duties and Responsibilities:\n\\n\n\\n\nDirectly, as well as through other relevant staff and interns, run reports and conduct ongoing internal and external analyses using the Agency’s Client Record Management System (CRM) as well as various external contract databases for RISE, Education and Employment Services’ related contracts and services;\n\\n\nEngage in process documentation, staff training, and regular quality assurance monitoring to ensure accuracy in performance outcomes documented in systems, in both agency and funder databases;\n\\n\nAdvise the unit management team members of RISE, Education and Employment Services on performance relative to contract goals, required level of client service, focus on specific subpopulations (e.g., individuals who are unhoused), or activities (e.g., employment verification and job retention) in order to assist department, produce timely outcomes and achieve required rates and levels of performance;\n\\n\nEngage in data analysis and reporting, data visualization, research and evaluation, and development of appropriate qualitative and quantitative methodologies, including weekly performance outcome tracking reports;\n\\n\nSupport unit management in coordinating departments’ partnership with the organization’s EQI and IT teams to develop and update tools that measure client performance and track milestone achievement, and ensure appropriate new report generation and modification;\n\\n\nPartner with unit management to insure appropriate employment/retention verification outcomes are in accordance with contract mandates, propound lists of clients in need of verification, and coordinate unit access of third party verification systems;\n\\n\nPrepare internal quality assurance reports and surveys (as requested by unit management) for the purpose of monitoring program performance, fidelity to practice, client satisfaction, etc.;\n\\n\nParticipate in grant development preparation meetings, contract start-up meetings, and contract renewal review meetings related to new or potential contracts;\n\\n\nRepresent the department in board report process and conduct reporting and data analysis as requested by senior management; and\n\\n\nPerform other duties as assigned.\n\\n\n\\n\n\\n\nQualifications:\n\\n\n\\n\nAssociate’s degree in public health, human services, criminal justice, sociology or related field preferred with a strong background in statistical analysis and/or data management . Bachelor's or master's degree a plus;\n\\n\nMust have a thorough knowledge of Client Record Management (CRM) database systems, Microsoft Office, including Excel at an advanced level that includes the utilization of the Analysis Toolpak; including but not limited to intermediate/advanced knowledge of Index Match formulas, VLOOKUP, XLOOKUP and Pivot Tables.\n\\n\nA minimum of two years relevant work experience, preferably in a nonprofit social service setting;\n\\n\nMust be detail-oriented with superior quantitative and qualitative analytical skills. Ability to do \"big picture\" thinking and solve problems in a way that is creative and collaborative;\n\\n\nExcellent presentation, oral and written communication skills coupled with exceptional people skills;\n\\n\nAlthough not required, knowledge of and proficiency in the following will be useful: SQL, CaseWorthy, query construction, and Visual Basic;\n\\n\nWorking knowledge and experience with compliance, quality assurance and/or quality improvement;\n\\n\nAbility to work independently and on a team;\n\\n\nInterest and appreciation of Fortune’s work in serving people who have been incarcerated and those who are at risk;\n\\n\nBilingual in Spanish/English a plus\n\\n\n\\n\nWe seek talented, dedicated individuals from all walks of life who possess a strong commitment to the Fortune Society’s mission. Relevant life experience is a plus.\n\\n\nTravel Requirements\n: LIC and may require travel to other Fortune offices, as well as NYC Jails and NYS DOCCS facilities.\n\\n\n\\n\nPhysical Demands:\n\\n\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The responsibilities and requirements listed are representative of the knowledge, skills, minimum education, training, licensing, experience and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions of the job.\n\\n\n\\n\nThe Fortune Society is an Equal Opportunity Employer. All qualified applicants will be afforded equal employment opportunities without discrimination because of conviction history, race, religion/creed, citizenship status, color, national origin, sex, age, disability, sexual orientation, gender identity, military status, predisposing genetic characteristics, victim of domestic violence status or marital status.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}