{
  "filename": "data_analyst_New_York__NY_page1_job3_Data_Solutions_Analyst.html",
  "job_title": "Data Solutions Analyst",
  "company": "Sensor Tower",
  "location": "New York, NY•Hybrid work",
  "salary": "$95,000 - $100,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:51:17.275Z",
  "full_description": "\\n\n\\n\nData Solutions Analyst\n\\n\n\\n\n\\n\n\\n  This role acts as a key connector between the Sales, Data Science, and Product teams, ensuring that data related requests are correctly validated, prioritized, and addressed.\\n\n\\n\n\\n  You will be the first line of defense for data validation inquiries, joining customer calls, and driving internal clarity around public and proprietary data discrepancies.\\n\n\\n\n\\n\n\\n\nSalary: $95-100K + Variable Quarterly Bonus\n\\n\n\\n\nWhat you will do:\n\\n\n\\n\nReview and Triage Data Validation Tickets\n\\n\nAssess incoming data related tickets for completeness, clarity, and accuracy.\n\\n\nJoin sales calls acting as a first line of defense to address data related concerns directly with clients.\n\\n\nAct as a subject matter expert to explain data nuances and prevent unnecessary escalations to the Data Science team.\n\\n\nValidate requests using internal tools and compare public data against proprietary (VGI/ST) sources.\n\\n\nCollaborate with the ST/VGI team to surface differences between public and internal data sets.\n\\n\nFlag and redirect any non actionable or duplicate requests.\n\\n\nPrioritize and Coordinate Workflows for Sales and Data Science teams\n\\n\nDevelop and maintain a ticket prioritization framework to help the Data Science team focus on high impact issues.\n\\n\nSupport cross functional initiatives between the Sales, Product, and Data Science teams.\n\\n\nProvide feedback and insights to improve internal data tools and customer experience.\n\\n\n\\n\nQualifications and Skill:\n\\n\n\\n\nA bachelor’s degree in a quantitative, analytical, or business-related field\n\\n\nAnalytical skills and high attention to detail\n\\n\nProficiency with pivot tables, lookups, basic formulas\n\\n\nFamiliarity with SQL for data querying and validation\n\\n\nExcellent communication and interpersonal skills, especially in cross functional settings\n\\n\nComfortable working with sales teams and customers to explain data insights and managing multiple tasks in possible time sensitive situations\n\\n\nAbility to research and synthesize market trends, competitor data, and industry benchmarks\n\\n\nExperience in reviewing and interpreting public financial statements\n\\n\n\\n\n\\n\n\\n\n*While we value fluency with AI tools in the workplace, we encourage candidates to refrain from using generative AI to produce answers for assessments or live interviews. Our goal is to see your genuine, unassisted thought process and approach*\\n\n\\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}