{
  "filename": "data_analyst_New_York__NY_page5_job1_Data_Analytics_Lead.html",
  "job_title": "Data Analytics Lead",
  "company": "RealSelf",
  "location": "New York, NY•Hybrid work",
  "salary": "$130,000 - $175,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:58:49.132Z",
  "full_description": "\\n\n\\n  Title: Data Analytics Lead (NYC)Location: New York City (Hybrid)\\n\n\\n\n\\n\nSalary Range:\n$130,000-$175,000 base salary + bonus\\n\n\\n\n\\n\nEmployment Type:\nFull-time\\n\n\\n\n\\n\n\\n\nAbout RealSelf\\n\n\\n\n\\n\n\\n\nFor two decades, RealSelf has been the most trusted authority in the aesthetics space. Now we're a dynamic digital ecosystem that puts consumers at the center of their aesthetic journey. As the only destination combining verified patient experiences, guidance from board-certified experts, and cutting-edge technology, RealSelf empowers millions to make confident decisions about their aesthetic goals.\\n\n\\n\n\\n\n\\n\nRole Overview\\n\n\\n\n\\n\n\\n\nRealSelf is looking for a Data Analytics Lead with the strategic vision and analytical acumen to level up our data stack, elevate data quality, empower teams with intuitive reporting, and establish a unified, company-wide culture of data-driven business growth.\\n\n\\n\n\\n\n\\n\nThis role goes far beyond reporting: it’s a strategic, high-ownership position for someone who knows how to create modern, resilient analytics foundations for complex marketplaces.\\n\n\\n\n\\n\n\\n\nPartnering closely with Engineering, Product, Provider Sales, Marketing, and Brand Partnerships, you will modernize our data infrastructure, drive efficiencies, enforce governance, inform business decisions, challenge assumptions, and ensure our entire organization operates from a shared, reliable source of truth.\\n\n\\n\n\\n\n\\n\nYou’ll draw on data to answer crucial questions about how consumers use RealSelf to discover and book aesthetic treatments, what really drives provider engagement and value, and how all our brand touchpoints influence consumer behavior and provider results.\\n\n\\n\n\\n\n\\n\nKey Responsibilities:\n\\n\n\\n\n\\n\n\\n\nIn this role, you will be expected to:\\n\n\\n\n\\n  Audit our data stack, define a strategic path forward, and drive those improvements\\n\n\\n\n\\n  Optimize data models and pipelines in SQL, BigQuery, Dbt, and a BI platform\\n\n\\n\n\\n  Ensure leadership and teams have reliable, flexible dashboards for KPIs, forecasting, revenue analysis, trends, and customer results\\n\n\\n\n\\n  Create frameworks for experimentation, attribution and funnel analysis that allow our business to scale with customer-first intelligence and confidence\\n\n\\n\n\\n  Translate complex data into actionable insights for non-technical stakeholders\\n\n\\n\n\\n  Maintain data quality, documentation, and governance practices\\n\n\\n\n\\n  Lead and develop a lean, high-performing team (currently 1 in-house analyst, a 1 data engineer, and an external vendor with 2 analysts/data scientists), scaling as the company grows\\n\n\\n\n\\n\n\\n\nRequirements:\n\\n\n\\n\n\\n\n\\n\nBachelor’s degree in Analytics, Statistics, Data Science or related field\\n\n\\n\n\\n  5+ years experience in a data analyst role, including at least 1 year managing or mentoring analysts\\n\n\\n\n\\n  Deep experience with SQL, BI tools (Looker/Tableau/Steep), and dbt or similar governance tools\\n\n\\n\n\\n  Experience with leveling up data stacks or leading complex data migrations\\n\n\\n\n\\n  Ability to thrive in an agile, fast-paced environment\\n\n\\n\n\\n  Strong communication skills, especially simplifying complexity for non-technical stakeholders\\n\n\\n\n\\n  Highly organized, detail-driven, and comfortable driving multiple priorities at once\\n\n\\n\n\\n  Experience with building or scaling lean, high-performing analytics teams\\n\n\\n\n\\n  NYC-based (Hybrid)\\n\n\\n\n\\n\n\\n\nBonus Qualities:\n\\n\n\\n\n\\n  Startup or fast-growth company background\\n\n\\n\n\\n  Familiarity with AI-assisted solutions to accelerate progress, without compromising quality\\n\n\\n\n\\n  Experience with two-sided marketplaces\\n\n\\n\n\\n\nPerks & Benefits\n\\n\n\\n\n\\n  You’ll work alongside our inspiring world-class team to create content and build products that connect and empower millions of people around the world, wherever they may be on their aesthetics journey\\n\n\\n\n\\n  Health benefits: We offer comprehensive benefits for medical, dental and vision 100% paid for by RealSelf at the employee level\\n\n\\n\n\\n  Work-life balance: Enjoy paid time off, including no work on your birthday and Summer Fridays, as well as generous leave options for life events such as becoming a parent401(k) matching: Plan for the future and take advantage of our 401(k) plan with a company match\\n\n\\n\n\\n  Treatment reimbursement: At RealSelf, we encourage our team to walk in our audience’s shoes. That’s why we offer a cosmetic treatment reimbursement program to employees who would like to take on a more active role as the consumer\\n\n\\n\n\\n  Company holidays: We believe in celebrating holidays! Enjoy time off during our 12 company-wide holidays + no work on your birthday!\\n\n\\n\n\\n  Hybrid NYC office: We recognize that there’s no “one size fits all” with office culture. That’s why we believe in a flexible hybrid schedule for our New York City employees, who can enjoy the benefits of in-person collaboration in our office as well as deep work time while remote at home\\n\n\\n\n\\n\n\\n\nRealSelf is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or protected veteran status.\n\\n\n\\n\n\\n\n\\n\nMore About RealSelf\n\\n\n\\n\n\\n\nForbes:\nInside RealSelf’s Rebrand\n\\n\n\\n\n\\n\nAdweek:\nCosmetic Surgery Platform RealSelf Appoints New CEO to Spur Editorial Expansion\n\\n\n\\n\n\\n\nTech Crunch:\nRealSelf, a community for cosmetic treatments, raises $40 million\n\\n\n\\n\n\\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}