{
  "filename": "data_analyst_New_York__NY_page4_job5_Geospatial_Data_Processing_Ana.html",
  "job_title": "Geospatial Data Processing Analyst",
  "company": "Ocean Surveys, Inc.",
  "location": "129 Mill Rock Road East, Old Saybrook, CT 06475",
  "salary": "$50,000 - $62,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:57:35.459Z",
  "full_description": "\\n\nTo apply, please send or e-mail your resume to:\n\\n\nOcean Surveys, Inc.\n129 Mill Rock Road East\nOld Saybrook, CT 06475\nJobs@OceanSurveys.com\n\\n\n\\n\n\\n\n\\n\nResponsible for processing and analyzing single beam, multibeam, side scan sonar, and other data sets utilizing a variety of custom and commercial software. The analyst will produce final data sets necessary for generating bathymetric images and maps. May also be responsible for producing digital and plotted maps, figures, and reports.\n\\n\nQualifications: Bachelors Degree of Science in the fields of: Earth Science, Physical Sciences, Computer Science, Geography, Geographic Information Systems, (or other closely related fields)\n\\n\n\\n\nMust have strong computer, communication and organizational skills.\n\\n\nMust have strong problem-solving and decision-making skills.\n\\n\nComfortable working within fluid timelines.\n\\n\nAble to work independently, with minimal supervision.\n\\n\nExperience with one or more programming languages (VBA, Python, C++, etc.) desired.\n\\n\n\\n\nKnowledge and experience with Hypack, CARIS Hips and Sips, Sonarwiz, POSPac, ARCGIS, Microstation, Inroads, MATLAB, Global Mapper, MicroStation, and AutoCAD, a plus.\n\\n\nSalary Range: $50,000 – $62,000\n\\n\nThe OSI salary range for this job position serves as a rough estimate and does not promise or guarantee a specific compensation amount. Additional variables that are considered while determining the salary offer encompass the scope of the job responsibilities, educational background, prior experience, expertise, skill set, capabilities, and internal equity considerations.\n\\n\nOcean Surveys, Inc. is an equal opportunity employer and offers a full benefits package.\n\\n\nJob Type: Temporarily or Full-time\n\\n\nOcean Surveys, Inc. is an equal opportunity employer and offers a full benefits package.",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=b84964ca8eb35b73&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfn8f3pi9eb8ah&spon=0&xkcb=SoAD67M3pvmuMEygLZ0ObzkdCdPP&xfps=f7783b52-7187-4cb7-9962-a9e2ab371d08&sjdu=pj3Kk47-5681RrtMx9vwdMaHoJYaj8stcEjvrhrkzYosC10wp4vjtOOjxGN-nvRT&vjfrom=vjs&asub=mob&astse=47a6fbc44aba331e&assa=196"
}