{
  "filename": "data_analyst_Houston__TX_page2_job12_Merchandise_System_Analyst_II_.html",
  "job_title": "Merchandise System Analyst II - PLM & Direct Sourcing",
  "company": "Tailored Shared Services, LLC",
  "location": "Houston, TX 77072•Hybrid work",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:47:05.348Z",
  "full_description": "\\n\n\\n  At Tailored Brands, we help people love the way they look and feel for their most important moments. Our Technology team loves the way they feel and thrive at work, with:\\n\n\\n\n\\n\nFlexible work opportunities, including remote and hybrid options\n\\n\nSmall, empowered teams that have fun delivering real value for our customers\n\\n\nA culture that values a 50-year legacy while eagerly embracing the future\n\\n\n\\n\n\\n\n\\n\nWant to be part of this?\n\\n\n\\n\n\\n  We currently have an exciting opportunity for\nMerchandise System Analyst II - Product Lifecycle Management & Direct Sourcing\nto join our Tailored Technology team. This role is ideal for a technically minded analyst who enjoys working with data, querying APIs, validating integrations, and ensuring systems operate reliably and efficiently. The analyst will collaborate closely with business partners, integration teams, and cloud solution architects to gather and document requirements, test integrations, validate data, and support the implementation of new systems or enhancements to existing platforms.\\n\n\\n\n\\n  This position plays a key role in connecting merchandising, planning, allocation, pricing, and product data across multiple cloud-based and on-prem systems.\\n\n\\n\n\\n\n\\n\nWhat you’ll do\n\\n\n\\n\n\\n\nSupport existing Merchandise systems to ensure they are functioning as intended, including:\n\\n\n\\n\n\\n  o PLM for Direct Sourcing and Product Design\\n\n\\n\n\\n  o Item setup and management, UPC and Pricing Management\\n\n\\n\n\\n  o Purchase Order and Inventory Management\\n\n\\n\n\\n  o CORE merchandise systems such as Replenishment and Forecasting, Merchandise Planning, and Merchandise Allocation\\n\n\\n\n\\n\nGather, document, and validate requirements for projects, work tasks, and issue resolution\n\\n\nAssess and validate REST/SOAP APIs and file-based interfaces between merchandising and external systems.\n\\n\nSupport the implementation of cloud-based integrations and assist with validation of middleware or message queues (e.g., Pub/Sub, API gateways).\n\\n\nDevelop and execute UAT test cases for new functionality, enhancements, and integrations\n\\n\nInvestigate data discrepancies, identify root causes, and support corrective actions or process improvements\n\\n\nCollaborate with Developers and the Merchandise Systems Architect to ensure system designs meet defined business and technical requirements\n\\n\nProvide subject matter expertise for research, reviews, new initiatives, internal efficiency projects, and problem resolution\n\\n\nAnalyze and validate data across multiple platforms, including PLM, MDM, ERP, Allocation, and Pricing systems\n\\n\nMaintain detailed documentation such as interface mappings, configuration notes, and process flows\n\\n\nPartner with managers and project managers to ensure projects are properly scoped, designed, and delivered on schedule, using either Agile or Waterfall methodologies\n\\n\n\\n\n\\n\n\\n\nWhat you’ll bring\n\\n\n\\n\n\\n\nExperience with Retail Systems is preferred, particularly in:\n\\n\n\\n\n\\n  o Product Lifecycle Management (PLM)\\n\n\\n\n\\n  o Product or Item Master Data Management (MDM)\\n\n\\n\n\\n  o Pricing or Inventory Management systems\\n\n\\n\n\\n\nFamiliarity with API testing tools such as Postman or similar platforms.\n\\n\nExposure to cloud platforms (Google Cloud, AWS, or Azure) and integration frameworks (e.g., Apigee, MuleSoft, Tibco, or REST-based services)\n\\n\nUnderstanding of data flows and integrations across enterprise systems\n\\n\nExperience with SQL or Python for data validation, analysis, and reconciliation is a plus\n\\n\nExperience with additional coding languages is a plus, including SQL, Python, and Pick-Basic\n\\n\nWorking knowledge of Excel, Confluence, JIRA, Linux, scripting, and systems administration is a plus\n\\n\nBachelor’s degree preferred\nin Information Systems, Computer Science, Business Analytics, Supply Chain, or a related field (or equivalent relevant experience)\n\\n\nProven ability to work with both Agile and Waterfall project lifecycle methodologies\n\\n\nDemonstrated ability to document and maintain requirements, design artifacts and testing plans\n\\n\nStrong written and verbal communication skills\n\\n\nAbility to manage shifting priorities in a dynamic environment\n\\n\nExperience working with EDI protocols and documents\n\\n\nFamiliarity with interface tools such as Tibco, SOAP and REST services, and MQ\n\\n\nAbility to learn and apply new skills, technologies, and programming languages to existing systems and processes\n\\n\n\\n\n\\n\n\\n\nIf you see yourself in this role, but fall short in any areas above, apply anyway! We love to invest in our team members!\\n\n\\n\n\\n\n\\n\nThe Best Kept Secret in Retail\n\\n\n\\n\n\\n\n\\n\nTailored Brands\nis North America’s leading specialty retailer of menswear, famous for world-class customer service and unique offerings like tailoring and custom suits. We are best known by our brands, including Men’s Wearhouse, Jos. A. Bank, K&G Fashion Superstore, and Moores Clothing for Men in Canada.\\n\n\\n\n\\n\n\\n\nWe are emerging from the pandemic with incredible momentum. We own a unique and special market segment experiencing record-level demand. This has inspired our 3-year journey to become Legendary; an exciting strategy that leans heavily upon a strong technology foundation.\\n\n\\n\n\\n\n\\n\nWith over 1,000 stores across the US and Canada, 15,000 employees, and over 35 million customers, we’re the perfect size! Large enough to demand leading-edge enterprise-worthy technology, but small enough to move quickly and empower our teams with significant scope & autonomy.\\n\n\\n\n\\n\n\\n\nApply now to power your career journey to Legendary!\n\\n\n\\n\n\\n\n\\n\nBenefits\n\\n\n\\n\n\\n  This role is eligible for healthcare including medical, dental and vision, retirement savings (401k with a company match), income protection programs such as life, accident and disability insurance, paid time off for sick leave, vacation, bereavement, jury duty, and holidays, wellbeing program, commuter, adoption assistance, education assistance, legal services, and employee merchandise discounts. For more detailed information go Tailoredbrands.com/working-here/people-culture.\\n\n\\n\n\\n\n\\n\nWork-Life Balance\n\\n\n\\n\n\\n  We understand the demands of work, school, family, and personal responsibilities. Through our work-life resources and programs we offer services for every stage of life to help you manage the day-to-day needs. We offer programs such as:\\n\n\\n\n\\n\nMeeting-Free Fridays (encouraged) | so you can catch up on work and self-development\n\\n\nSummer Fridays | from Memorial Day to Labor Day so you can enjoy a head-start to the weekend\n\\n\nHoliday Early Departure | close out early the business day before a company observed holiday\n\\n\n\\n\n\\n\n\\n\nWork Environment, Physical & Mental Demands\n\\n\n\\n\n\\n\nAbility to sit and work at a computer keyboard for extended periods of time\n\\n\nAbility to stoop, kneel, bend at the waist, and reach daily\n\\n\nAble to lift and move up to 25 pounds occasionally\n\\n\nMust utilize visual acuity, speech and hearing, hand and eye coordination and manual dexterity necessary to operate a computer and office equipment\n\\n\nHours regularly 40 hours per week, as work dictates, from the Houston, TX corporate office location.\n\\n\n\\n\n\\n\n\\n\nNote: To perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed are representative of the knowledge, skill, and/or ability required and are not intended to be an exhaustive list of all duties, responsibilities or qualifications associated with this job.\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=fe5e76890ebeaa96&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfmissbl03785n&spon=0&xkcb=SoDE67M3pvlEerygL50HbzkdCdPP&xfps=ec1eab4a-3e73-4848-8c4c-86e23743b30c&vjfrom=vjs&asub=mob&astse=abb80d4ec296e100&assa=5626"
}