{
  "filename": "data_analyst_New_York__NY_page12_job11_Consumer_Insights_Analyst.html",
  "job_title": "Consumer Insights Analyst",
  "company": "Atlantic Health System",
  "location": "Morristown, NJ 07960•Hybrid work",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:26:39.780Z",
  "full_description": "\\n\nAtlantic Health is seeking a highly motivated individual with a passion for consumer insights and a strong background in data analytics and storytelling.\n\\n\nThe Consumer Insights Analyst plays a critical role in shaping our understanding of the end-to-end consumer experience and driving decisions to alleviate pain points and friction for our patients across the consumer journey. Reporting into the Director of Digital Marketing, this person will lead market research strategy, methodology and execution with research partners including Qualtrics, NRC Health and MDRG to measure brand health, reputation and NPS of Atlantic Health over time. This person will also partner with Consumer Insights leads on the Patient Experience Team and all branches of the Marketing Department to measure the end-to-end consumer experience, identify pain points before, during and after clinical encounters, and assess and prioritize opportunities for optimization. Additionally, this person will partner with Digital Marketing and Consumer Experience Teams to connect the dots across advertising, communication, web and call center activity, and appointment scheduling, and provide insights, data visualization and storytelling to map consumer journeys and illustrate conversion funnels.\n\\n\nResponsibilities:\n\\n\n\\n\nLeads the development and implementation of consumer experience (CX) research strategies, methodologies, programs and reporting with quantitative and qualitative research partners including Qualtrics, NRC Health and MDRG\n\\n\nConducts data analysis and needs assessments to identify trends, insights and pain points in the end-to-end consumer experience\n\\n\nTracks CX KPIs, provides recommendations for improvement, and develops learning agendas and optimization strategies\n\\n\nCollaborates with Patient Experience and all branches of the Marketing Department to gather and integrate patient and prospect feedback and data from various sources; Aggregates, monitors and extracts insights from non-clinical patient feedback, including patient feedback surveys, ratings and reviews, social listening, emails, calls and web submissions\n\\n\nDevelops and maintains a deep understanding of patient preferences, needs and behaviors\n\\n\nInterprets and translates complex datasets into compelling visualizations and actionable insights, and delivers clear recommendations to leadership and business partners\n\\n\nEnsures data quality and accuracy in all CX research and analysis\n\\n\nParticipates in the development and implementation of new CX-related initiatives and projects\n\\n\nFosters a culture of consumer-centricity across Atlantic Health\n\\n\nContinuously identifies opportunities for process improvement and efficiency in CX research and analysis; Stays up-to-date on industry trends and best practices\n\\n\nLeads relationships with research partners and leads and manages Marketing’s research budget\n\\n\n\\n\n\\n\n\\n\nQualifications/Requirements:\n\\n\n\\n\nQuantitative research and statistical analysis experience required\n\\n\nProficient in developing research strategies and methodologies, crafting surveys, determining sampling requirements and quotas, and measuring the statistical significance of results\n\\n\nAbility to track multiple KPIs, identify and monitor trends, uncover early warning indicators and investigate potential root causes\n\\n\nDemonstrated ability to translate complex datasets into actionable insights, uncover trends, develop reporting and storytelling and deliver recommendations\n\\n\nAbility to aggregate disparate datasets from various sources and systems to gain a holistic view of the consumer experience\nProficient in data visualization tools, including PowerBI, and strong ability to create charts and visualizations in Excel, PowerPoint and Lucid\\n\n\\n\n\\n\nRelevant Experience:\n\\n\n\\n\nBachelor’s degree in mathematics, statistics or other quantitative field preferred\n\\n\n4+ years consumer insights, VOC or marketing analytics experience required\n\\n\nExcellent written and verbal communication skills\n\\n\nHighly collaborative; able to work effectively across departments and levels\n\\n\nConsumer-centric mindset with a passion for driving decisions that improve patient satisfaction, deepen engagement and increase loyalty\n\\n\nDeadline-oriented, organized and capable of driving multiple initiatives simultaneously\nHealthcare experience preferred\\n\n\\n\n\\n\nThis is a hybrid position with the flexibility to work from home a few days each week.\n\\n\n\\n\n\\n\n\\n\nAt Atlantic Health System, our promise to our communities is; Anyone who enters one of our facilities, will receive the highest quality care delivered at the right time, at the right place, and at the right cost. This commitment is also echoed in the respect, development and opportunities we give to our more than 20,000 team members. Headquartered in Morristown, New Jersey, we are one of the leading non-profit health care systems in the nation. Our facilities and sites of care include:\n\\n\n\\n\n\\n\nMorristown Medical Center, Morristown, NJ\n\\n\nOverlook Medical Center, Summit, NJ\n\\n\nNewton Medical Center, Newton, NJ\n\\n\nChilton Medical Center, Pompton Plains, NJ\n\\n\nHackettstown Medical Center, Hackettstown, NJ\n\\n\nGoryeb Children's Hospital, Morristown, NJ\n\\n\nCentraState Healthcare System, Freehold, NJ\n\\n\nAtlantic Home Care and Hospice\n\\n\nAtlantic Mobile Health\n\\n\nAtlantic Rehabilitation\n\\n\n\\n\n\\n\nWe also have more than 900 community-based healthcare providers affiliated through Atlantic Medical Group. Atlantic Accountable Care Organization is one of the largest ACOs in the nation, and we are a member of AllSpire Health Partners.\n\\n\nWe have received awards and recognition for the services we have provided to our patients, team members and communities. Below are just a few of our accolades:\n\\n\n\\n\n\\n\n100 Best Companies to Work For ® and FORTUNE® magazine for 15 years\n\\n\nBest Places to Work in Healthcare - Modern Healthcare\n\\n\n150 Top Places to work in Healthcare - Becker's Healthcare\n\\n\n100 Accountable Care Organizations to Know - Becker's Hospital Review\n\\n\nBest Employers for Workers over 50 - AARP\n\\n\nGold-Level \"Well Workplace\": Wellness Council of America (WELCOA)\n\\n\nOne of the 100 Best Workplaces for “Millennials” Great Place to Work® and FORTUNE® magazine\n\\n\nOne of the 20 Best Workplaces in Health Care: Great Place to Work® and FORTUNE® magazine\n\\n\nOfficial Health Care Partner of the New York Jets\n\\n\nNJ Sustainable Business\n\\n\n\\n\n\\n\nAtlantic Health System offers a competitive and comprehensive Total Rewards package\nthat supports the health, financial security, and well-being of all team members. Offerings vary based on role level (Team Member, Director, Executive). Below is a general summary, with role-specific enhancements highlighted:\n\\n\n\\n\n\\n\nTeam Member Benefits\n\\n\n\\n\n\\n\n\\n\nMedical, Dental, Vision, Prescription Coverage (22.5 hours per week or above for full-time and part-time team members)\n\\n\nLife & AD&D Insurance.\n\\n\nShort-Term and Long-Term Disability (with options to supplement)\n\\n\n403(b) Retirement Plan: Employer match, additional non-elective contribution\n\\n\nPTO & Paid Sick Leave\n\\n\nTuition Assistance, Advancement & Academic Advising\n\\n\nParental, Adoption, Surrogacy Leave\n\\n\nBackup and On-Site Childcare\n\\n\nWell-Being Rewards\n\\n\nEmployee Assistance Program (EAP)\n\\n\nFertility Benefits, Healthy Pregnancy Program\n\\n\nFlexible Spending & Commuter Accounts\n\\n\nPet, Home & Auto, Identity Theft and Legal Insurance\n\\n\n\\n\n____________________________________________\n\\n\n\\n\n\\n  Note: In Compliance with the NJ Pay Transparency Act (effective Sunday, June 1, 2025), all job postings will include the hourly wage or salary (or a range), as well as this summary of benefits. Final compensation and benefit eligibility may vary by role and employment status and will be confirmed at the time of offer.\n\\n\n\\n\n\\n  EEO STATEMENT\n\\n\n\\n\n\\n\n\\n  Atlantic Health System, Inc. is an equal employment opportunity employer and federal contractor or subcontractor and therefore abides by applicable laws to protect applicants and employees from discrimination in hiring, promotion, discharge, pay, fringe benefits, job training, classification, referral, and other aspects of employment, on the basis of race, color, religion, sex (including pregnancy, gender identity and sexual orientation), national origin, citizenship status, disability, age, genetics, or veteran status.\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=766019ac37baa53c&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoBk67M3pv5_3dy4ax0AbzkdCdPP&xfps=73b3bbbe-28da-40a2-9596-004c5f898679&vjfrom=vjs&asub=mob&astse=e65e5b2a57f53f27&assa=4383"
}