{
  "filename": "data_analyst_New_York__NY_page1_job8_ERP_BUSINESS_ANALYST___DEVELOP.html",
  "job_title": "ERP BUSINESS ANALYST / DEVELOPER",
  "company": "Valcor Engineering Corporation",
  "location": "2 Lawrence Road, Springfield, NJ 07081",
  "salary": "$100,000 - $140,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T10:52:34.811Z",
  "full_description": "\\n\nThe Epicor Business Analyst/Developer will play a crucial role in supporting our Epicor ERP system. This position will involve analyzing business requirements, developing solutions, and providing technical support to end-users. The ideal candidate will have a strong background in Epicor ERP, excellent problem-solving skills, and a passion for helping others.\n\\n\nResponsibilities\n:\n\\n\n\\n\nBusiness Analysis:\n\\n\n\\n\nCollaborate with stakeholders to gather and document business requirements\n\\n\nAnalyze existing processes and recommend improvements using Epicor ERP\n\\n\nCreate detailed functional specifications and process documentation\n\\n\n\\n\nDevelopment:\n\\n\n\\n\nDevelop and customize Epicor solutions, including reports, dashboards, and workflows\n\\n\nUtilize Epicor’s customization tools (e.g., BPM, dashboards, and custom code) to enhance system functionality\n\\n\nPerform system testing and validation to ensure quality deliverables\n\\n\n\\n\nHelp Desk Support:\n\\n\n\\n\nProvide first-level technical support for Epicor ERP users\n\\n\nTroubleshoot and resolve system issues and user inquiries efficiently\n\\n\nMaintain documentation of issues, resolutions, and knowledge base articles for root cause analysis of systemic issues\n\\n\n\\n\nTraining and Support:\n\\n\n\\n\nAssist in developing training materials and conducting user training sessions\n\\n\nSupport end-users in the effective use of the Epicor system, promoting best practices\n\\n\n\\n\nContinuous Improvement:\n\\n\n\\n\nStay updated on Epicor enhancements and industry trends\n\\n\nParticipate in system upgrades and improvements to optimize functionality\n\\n\n\\n\n\\n\nQualifications\n:\n\\n\n\\n\nBachelor’s degree in Computer Science, Information Systems, Business Administration, or related field\n\\n\nProven experience with Epicor ERP, preferably in a similar role\n\\n\nStrong analytical and problem-solving skills\n\\n\nProficiency in SQL and experience with reporting tools (e.g., SSRS, Epicor Report Designer)\n\\n\nExcellent communication and interpersonal skills\n\\n\nAbility to work independently and as part of a team in a fast-paced environment\n\\n\nExperience in a help desk or technical support role is a plus\n\\n\n\\n\nPreferred Skills:\n\\n\n\\n\nFamiliarity with manufacturing or distribution processes\n\\n\nKnowledge of Epicor modules (e.g., Finance, Supply Chain, Production) is a plus\n\\n\nExperience with integrations and API usage\n\\n\n\\n\nAll candidates must meet the US persons criteria.\n\\n\nPlease note: The salary range is based on our market pay structure. However, individual salaries are determined by a variety of factors including, but not limited to, business considerations, local market conditions, and internal equity, as well as candidate qualifications, such as skills, education, and experience.\n\\n\nEmployee Benefits: At Valcor Engineering, we support our employees in all aspects of their life, including their health and financial well-being. Regular employees scheduled to work 30+ hours per week are offered: health, dental, and vision insurance; health savings accounts; a 401(k) savings plan; long term disability coverage; and life and accident insurance. We also have an employee assistance program. Our leave programs include Vacation and PTO time off, paid holidays, as well as other types such as bereavement, and any applicable federal and state sick leave. Employees may participate in the company recognition program to receive monetary or non-monetary recognition awards.\n\\n\nWe are an equal opportunity employer and do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, genetic information, veteran status, sexual orientation, gender identity, or any other characteristic protected by law. All qualified applicants will be considered for employment without regard to these characteristics.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}