{
  "filename": "data_analyst_New_York__NY_page7_job12_Technical_Business_Analyst_Co_.html",
  "job_title": "Technical Business Analyst Co-op with Drexel University: Spring/Summer A Round",
  "company": "Susquehanna International Group",
  "location": "Bala-Cynwyd, PA",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T11:14:58.408Z",
  "full_description": "\\n\n\\n\n\\n   The Susquehanna Co-op Program gives you an opportunity to apply what you learn in class to real world business scenarios. As a Technical Business Analyst Co-op, you are working right in the heart of Susquehanna’s business, working with a variety of departments across the globe. In this role, you may find yourself acting as the bridge between our operations teams and our development and technical teams, translating business requests into tools, systems, and/or reports that directly impact business operations. In addition, you could also be directly involved with the production and maintenance of daily, monthly, and annual reports used by the Managing Directors in various decision making processes for the firm. In this role, you will have the opportunity to truly get to know our business and understand that data and technology behind the work we do, all the while interacting with key members of our trading, operations, technology, and management teams.\\n\n\\n\n\\n\n\\n\nIn this role, you will:\\n\n\\n\n\\n\nWorking between our Bala HQ and offices in Dublin and Sydney to support the development and implementation of universal calculations tools that are agnostic to location and\nsecurities type\n\\n\nAnalyze business processes and workflows, noting areas where processes and controls can be improved or implemented to reduce/mitigate risk\n\\n\nTests effectiveness of controls\n\\n\nSupporting the build-out of an internal system of books and records that incorporates counter-party data from varying trading systems and normalizes it for easier\nconsumption\n\\n\nManaging an initiative to put in place reconciliation tools that facilitate data comparison and trade reporting\n\\n\nAd-hoc projects as required\n\\n\nWhat we're looking for\n\\n\n\\n\nHands-on experience building solutions in relational databases such as Oracle, MySQL and/or MariaDB\nProficiency in one or more object-oriented programming languages \\n\n- most used languages include Python and VBA\n\\n\nExperience with HTML\n\\n\nKnowledge of SDLC models is a plus\n\\n\nInterest in the financial markets and building their functional and technical knowledge to support the needs of the business\n\\n\nExperience within a Trading Operations, Business Analyst, or related role is a plus\n\\n\nStrong analytical and problem-solving skills critical, with excellent time management/ prioritization abilities\n\\n\nExceptional communication skills (oral and written); ability to interact effectively with all levels of the organization and external vendors\n\\n\nDetail oriented; ability to handle multiple tasks in a fast paced environment\n\\n\nMust be a self-starter, a quick learner, and resourceful in solving problems\n\\n\nVisa sponsorship for work authorization is not available for this position now or in the future\n\\n\n\\n\n\\n\n\\n\nWhat’s in it for you\\n\n\\n\n\\n\nOur non-hierarchical culture allows employees of every level to thrive and make impact. We are not your typical trading firm – the environment is casual, collaborative and we focus on continuous development.\n\\n\n\\n\n\\n     Relaxed dress code (jeans and sneakers are the norm and team jerseys every Friday)\\n\n\\n\n\\n\n\\n     Co-op classes designed to teach about Susquehanna’s business and encourage professional development\\n\n\\n\n\\n\n\\n     Fully stocked kitchens for breakfast, lunch, snacks, and beverages\\n\n\\n\n\\n\n\\n     A forty thousand square-foot state of the art fitness facility with brand-new equipment, multi-purpose courts, group exercise classes, and locker room spaces\\n\n\\n\n\\n\n\\n     Discounts for dining, entertainment, shopping, travel, and attractions\\n\n\\n\n\\n\n\\n     Social events such as a poker tournament, holiday party, company outings, and more\\n\n\\n\n\\n\n\\n     On-site Wellness Center\\n\n\\n\n\\n\n\\n     On-site services such as a mailroom, barber, dry cleaning, and car maintenance\\n\n\\n\n\\n\n\\n     Opportunities to give back to the community through Susquehanna sponsored events and donation drives\\n\n\\n\n\\n\n\\n\n\\n\nAbout Susquehanna\\n\n\\n\n\\n   Susquehanna is a global quantitative trading firm powered by scientific rigor, curiosity, and innovation. Our culture is intellectually driven and highly collaborative, bringing together researchers, engineers, and traders to design and deploy impactful strategies in our systematic trading environment. To meet the unique challenges of global markets, Susquehanna applies machine learning and advanced quantitative research to vast datasets in order to uncover actionable insights and build effective strategies. By uniting deep market expertise with cutting-edge technology, we excel in solving complex problems and pushing boundaries together.\\n\n\\n\n\\n\n\\n\nIf you're a recruiting agency and want to partner with us, please reach out to recruiting@sig.com. Any resume or referral submitted in the absence of a signed agreement will not be eligible for an agency fee.\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=22cd52769cee702b&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfo1hnsi8qp803&spon=0&xkcb=SoAn67M3pv4J5G2EiJ0HbzkdCdPP&xfps=338faeab-fa6e-4503-bf7a-2746a1036108&vjfrom=vjs&asub=mob&astse=093b036a79a47edd&assa=8720"
}