{
  "filename": "data_analyst_New_York__NY_page2_job10_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "enfoTech & Consulting",
  "location": "1368 How Lane, North Brunswick, NJ 08902",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:54:49.910Z",
  "full_description": "\\n\n\\n\nLocation\n\\n\nenfoTech Headquarters, North Brunswick, NJ\n\\n\nResponsibilities\n\\n\n\\n\n\\n\nCoordinate project activities to deliver IT solutions to support environmental management.\n\\n\nFacilitate meeting discussion (prepare agenda, host meeting, capture minutes).\n\\n\nTrack action items and complete work assignments.\n\\n\nPerform requirements analysis and develop functional requirement documents.\n\\n\nProvide input to the system design, database design, and develop system design documents.\n\\n\nDevelop software reports using SSRS or Crystal Reports.\n\\n\nDevelop and maintain user and system documentation.\n\\n\nPerform system testing to ensure meeting the system design.\n\\n\nDeliver user training and provide technical support.\n\\n\n\\n\n\\n\nQualifications\n\\n\n\\n\n\\n\nBS or MS with demonstrated experiences in working with relational database (minimum qualification).\n\\n\nGood meeting facilitation, presentation, and writing/oral communication skills (minimum qualification).\n\\n\nGood problem-solving skills; ability to analyze problems, evaluate options, and recommend solutions (highly desirable).\n\\n\nExperience in SQL Server and understanding of relational database (highly desirable).\n\\n\nSelf-starter and quick learner who can work with limited supervision (highly desirable)Good organizational skills and attention to details.\n\\n\nGood interpersonal skills and a team player.\n\\n\nExperience with Microsoft Office Professional Suite (Word, Excel, PowerPoint, Project, Visio).\n\\n\n\\n\n\\n\nCompensation\n\\n\nCompetitive salary based on qualifications, Health/Dental/vision Insurances, 401K, Long Term Disability Insurance, Life Insurance, and others in accordance with Company’s policy.\n\\n\nHow to Apply\n\\n\nEmail your cover letter and resume to Human Resources Department or fax (732) 214-8619.\n\\n\nPlease include the following in your cover letter:\n\\n\n\\n\nAvailability\n\\n\nCitizenship or visa status\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=3deae7baeceaf2cc&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfn2hp0j73685t&spon=0&xkcb=SoCQ67M3pvmFm_Rbpp0BbzkdCdPP&xfps=77100a5a-6e65-4aff-bc3e-7a16217d6c72&sjdu=LZ7vOOV0nQi2jQc6G-ap9D5hBO3flm05cNmir2-7jjjuaQnayhVl3uDDOJ3tWnU-&vjfrom=vjs&asub=mob&astse=aa042b0095d74d39&assa=4746"
}