{
  "filename": "data_analyst_New_York__NY_page7_job14_Data_Systems_Analyst.html",
  "job_title": "Data Systems Analyst",
  "company": "Mastery Charter Schools",
  "location": "Philadelphia, PA",
  "salary": "$68,000 - $81,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:15:14.429Z",
  "full_description": "\\n\n\\n\nAbout Mastery:\n\\n\n\\n\n\\n\n\\n\nFounded in 2001, Mastery Schools is a public charter network of 23 K-12 schools in Philadelphia and Camden, serving more than 14,000 students.\\n\n\\n\n\\n\n\\n\nAt Mastery, we’re on a mission to provide all students with the academic and personal skills they need to succeed after graduation and pursue their dreams. Student achievement is not just a goal for our organization; it's the reason we exist, and every member of our team is dedicated to securing student success. We are also committed to pursuing equity, actively disrupting systemic racism, and addressing the disparities that limit our students' choices.\\n\n\\n\n\\n\n\\n\nOur culture is built on respect, service, and the belief that the success of our students, their families, and the communities we serve will help us achieve our mission. We foster a positive, open, and inclusive environment where honesty, humor, and continuous improvement are celebrated.\\n\n\\n\n\\n\n\\n\nJoin us in creating a model urban school district that serves all students with excellence. Together, we can make a lasting impact.\n\\n\n\\n\n\\n\n\\n\nPosition Summary:\n\\n\n\\n\n\\n\n\\n\nThe Data Systems Analyst (DSA) is responsible for configuration, maintenance, and user support of Mastery's academic and administrative data systems. The DSA ensures that systems effectively support the organization’s operational and analytic needs, while maintaining data accuracy and consistency. This role provides front-line user support, develops documentation, and delivers training to ensure correct and consistent system usage.\\n\n\\n\n\\n\n\\n\nThe DSA is a member of the Mastery Charter Network Support Team and reports to the Senior Director of Technology. The Technology department’s mission is to ensure consistent and effective delivery of information systems across the Mastery network.\\n\n\\n\n\\n\nDuties and Responsibilities:\n\\n\n\\n\nProvide front-line user support, including training and help-desk services.\n\\n\nMaintain Mastery’s information systems (e.g., student information system, gradebooks, assessment platforms, HR, and IEP management software).\n\\n\nSupport the implementation and rollout of new systems and initiatives.\n\\n\nLead or assist with ongoing operational tasks, including student scheduling.\n\\n\nAssist in producing recurring analyses, reports, and dashboards.\n\\n\nSupport data quality efforts by helping to develop and enforce data entry standards and protocols.\n\\n\nConduct regular quality assurance checks on data across Mastery’s information systems\n\\n\n\\n\nQualifications:\n\\n\n\\n\nFamiliarity with database platforms such as MS Access and SQL Server.\n\\n\nStrong analytical skills with exceptional attention to detail.\n\\n\nAbility and motivation to troubleshoot issues and resolve user-reported problems.\n\\n\nExperience with Microsoft Excel and a desire to expand Excel proficiency.\n\\n\nResults-oriented, flexible, and committed to problem-solving.\n\\n\nPassionate about contributing to high-quality educational experiences for students.\n\\n\nEffective organizational and interpersonal communication skills.\n\\n\n\\n\nEducation and Experience:\n\\n\n\\n\nDegree in Science, Math, MIS or Computer Science or equivalent professional experience\n\\n\nExperience working in a K-12 education environment and familiarity with K-12 software/databases is preferred.\n\\n\nPrior experience providing front-line user support and training a plus but not required; strong desire to work with end users is essential.\n\\n\n\\n\nOther Requirements:\n\\n\n\\n\nAbility to physically perform the essential duties of the role as outlined above, and to work in the environmental conditions required, such as traveling to network campuses, monitoring and interacting with students, in-person facilitation of trainings, etc;\n\\n\nThis role may require frequent travel between multiple locations. Reliable transportation is essential to fulfill job responsibilities.\n\\n\n\\n\nSalary and Bonus Information:\n\\n\n\\n\nData Analysts at Mastery can expect a starting salary between $68,000 - $81,000, based on education and experience, with opportunities for growth as your career progresses. Each offer is made in alignment with Mastery’s compensation philosophy and commitment to pay equity, ensuring fairness and consistency across our team.\n\\n\n\\n\nDisclaimer:\n\\n\n\\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist Mastery’s Talent Acquisition Team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.\n\\n\n\\n\n\\n\nMastery's Benefits Package:\n\\n\n\\n\n\\n\n\\n\nWe offer a full benefits program and opportunities for professional growth. Some of our most popular benefits include our 403(b) retirement plan for PA employees (with a 5% match from Mastery), enrollment in the State of New Jersey Pension Plan for NJ employees, a robust Employee Assistance Program, mental health and counseling programs, an annual Professional Development Fund, and discounts and perks at a myriad of retailers, travel organizations, insurance providers, and so much more, as well as a Benefits VIP Helpdesk to help you navigate various benefits-related topics.\nPlease go here to see all of our Benefits offerings\n!\n\\n\n\\n\n\\n\n\\n\nAnnual Calendar:\n\\n\n\\n\n\\n\n\\n\nAs you plan to make Mastery your new work home, please feel free to review our\nCalendar for the 25/26 School Year\n.\nWe like to think our calendar is a benefit of working here too!\\n\n\\n\n\\n\n\\n\nWhy You Should Apply:\n\\n\n\\n\n\\n\n\\n\nStudies have shown that women and people of color are less likely to apply for jobs unless they believe they can perform every job description task. We are most interested in finding the best candidate for the job, and that candidate may come from a less traditional background. Mastery may consider an equivalent combination of knowledge, skills, education, and experience to meet minimum qualifications.\nIf you are interested in applying, we encourage you to think broadly about your background and skill set for the role.\n\\n\n\\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist Mastery's Talent Acquisition Team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}