{
  "filename": "data_analyst_Houston__TX_page1_job8_O_G_Business_Analyst.html",
  "job_title": "O&G Business Analyst",
  "company": "GTS Geotech",
  "location": "410 Pierce St Ste 319, Houston, TX 77002",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:44:07.917Z",
  "full_description": "\\n\nOur Data Scout division has a requirement for an O&G Business Analyst in support of field data capture and production data flow processes. This is an office based position in the greater Houston area\n\\n\nAs the successful O&G Business Analyst candidate, you will be tasked with:\n\\n\nAssisting in design/ implementation of short and long-term strategic projects in support of field data capture and production data flow processes. This is a hybrid position requiring oil and gas production operations knowledge, advanced knowledge of database query design, and SSIS and API integration between systems along with the ability to prioritize and execute tasks effectively in a collaborative team environment. Interpersonal skills are also vital as direct interaction with a wide range of global users and vendors is expected.\n\\n\n\\n\nExperience working in the upstream oil / gas industry required\n\\n\nExperience with P2’s Merrick Suite of products (eVIN, Procount, and Carte) or Seven Lakes Joyn FDG required\n\\n\nStrong technical skills (SSIS, SSRS, SQL, C#, .NET, JSON, Postman) preferred\n\\n\nExperience using web API’s to integrate data between applications preferred\n\\n\nExperience supporting data flow from SCADA systems to production accounting systems preferred\n\\n\nExperience with collaborating between multiple stakeholders (Business, IT, and vendor) to understand requirements\n\\n\nBeing a Self-starter and possessing the ability to multi-task in a dynamic environment is critical\n\\n\nExcellent communication skills (verbal and written)\n\\n\n\\n\nWe are looking for someone with P2 application suite or Seven Lakes experience.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=b5968c035b097041&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfme75aj73689f&spon=0&xkcb=SoBc67M3pvk3MbRbpp0DbzkdCdPP&xfps=dcfea774-df94-47f3-a976-738a1ed75e1f&vjfrom=vjs&asub=mob&astse=a757944846d767d1&assa=8210"
}