{
  "filename": "data_analyst_New_York__NY_page9_job7_Lead_OMB_Data_Analyst.html",
  "job_title": "Lead OMB Data Analyst",
  "company": "City of New York",
  "location": "30-30 Thomson Avenue, New York, NY 11101",
  "salary": "$62,868 - $96,126 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:18:56.750Z",
  "full_description": "\\n\nJob Description\n\\n\nHours: Full-Time – 35 Hours\nWork Location: 30-30 Thomson Avenue, LIC, NY 11101\nThe Lead OMB Data Analyst is a key position within the Office of Management and Budget (OMB) Data Unit, responsible for supervising two staff members, managing and analyzing personnel data, coordinating the flow of information, and supporting various HR and personnel functions. Reporting to the Deputy Director and working closely with the Assistant Commissioner and Director of Personnel, the Lead OMB Data Analyst oversees the agency's Monthly Hiring Plan, ensuring accurate tracking of all personnel data, and producing detailed reports and visualizations. In the absence of the Deputy Director, the Lead OMB Data Analyst assumes their role, maintaining continuity in leadership and decision-making.\nA central duty of the Lead OMB Data Analyst is to manage the agency's Monthly Hiring Plan by supervising the OMB Data Analyst to ensure timely and accurate completion of the monthly OMB submission and all associated components. This includes reviewing new division vacancy requests and staff changes, analyzing and entering data into shared OneDrive files with the OMB taskforce, and maintaining the internal Human Resources Information System to ensure precise tracking of vacant positions, new hires, and staff changes. The Lead OMB Data Analyst is expected to escalate issues to the Deputy Director when appropriate.\nIn the area of data management and analysis, the Lead OMB Data Analyst leverages SQL and Python, other data manipulation software to extract, manipulate, and analyze data, and uses Power BI to create and manage dashboards and visual reports on hiring statuses, vacancy updates, and personnel trends. They are responsible for maintaining and querying personnel data and ensuring data integrity across systems.\nThe Lead OMB Data Analyst coordinates the flow of information across Personnel, Data Management, Employee Recruitment and Retention Units, and the Office of the Commissioner. They develop and review bi-weekly, monthly, and ad hoc reports on staffing metrics, including vacant and filled positions, new hires, division updates, and OMB approvals. Their scope of tracking includes candidate declinations, loaned positions, and all relevant personnel data, ensuring that reporting is accurate and timely.\nIn support of the agency’s managerial and non-managerial e-Performance Programs, the Lead OMB Data Analyst supervises the Personnel Data Analyst to ensure timely completion of e-performance reports for monthly division check-ins and provides updates upon request. They work closely with the Assistant Commissioner of Personnel to ensure compliance with agency-wide performance evaluation programs and provide guidance on both technical and qualitative troubleshooting of e-performance issues.\nAdditionally, the Lead OMB Data Analyst is responsible for developing and maintaining documentation related to data processes, reporting procedures, and performance management systems. This includes documenting standard operating procedures and best practices. Where applicable, the Lead OMB Data Analyst utilizes coding and programming skills to automate data processes and develop analytical tools and models to support personnel data management and analysis.\nAuthorization to work in the United States is required for this position. NYC Department of Design and Construction does not provide sponsorship for international employees for visa applications, extensions, or status changes, including STEM/OPT visas. Applicants are responsible for ensuring that they meet all qualifying requirements for this position, at the time of application.\nAll applicants, including City Employees:\nPlease go to NYC Government Jobs | Explore Careers | City of New York, go to Search for Open Jobs, and type in the Job ID # listed above. Submit job application as prompted. Do not apply via Employee Self-Service (ESS), e-mail, mail, or fax your resume to DDC directly.\nCOMMUNITY COORDINATOR - 56058\nQualifications\n\\n\n1. A baccalaureate degree from an accredited college and two years of experience in community work or community centered activities in an area related to the duties described above; or\n2. High school graduation or equivalent and six years of experience in community work or community centered activities in an area related to the duties as described above; or\n3. Education and/or experience which is equivalent to \"1\" or \"2\" above. However, all candidates must have at least one year of experience as described in \"1\" above.\nAdditional Information\n\\n\n\\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}