{
  "filename": "data_analyst_New_York__NY_page3_job9_Energy_Analyst__Energy_Efficie.html",
  "job_title": "Energy Analyst (Energy Efficiency)",
  "company": "Start, Inc.",
  "location": "Cherry Hill, NJ 08003",
  "salary": "$65,000 - $75,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:56:18.885Z",
  "full_description": "Under the direction of the Program Manager, the Technical Analyst will review energy assessment reports and create a scope of work for a home-based assessment report. The analyst will also be responsible for sending scope of work to contractors and follow up on work order request as needed. This role will also complete whole home assessments as needed and review whole home assessment reports. Assist with quality control and quality assurance of whole home assessments. Assessments may include assessing of building performance in depth data collection, interface with multiple databases, installation of energy saving devices, customer energy savings education and reporting on these findings.\n\\n\nDUTIES AND RESPONSIBILITIES\n\\n\n\\n\nHandle all assigned customer complaints related to Weatherization, ARP, and contractor installs.\n\\n\nWork as an auditor when needed.\n\\n\nPerforms related work as required.\n\\n\nReview Energy Assessment reports and create a scope of work for a home based on assessment reports.\n\\n\nSend scope of work to be completed by contractors.\n\\n\nAssistant Program Manager and provide feedback to contractors about the quality of work performed.\n\\n\nAttend and contribute to relevant program meetings as needed.\n\\n\nFollow up on work order request sent to contractors as needed.\n\\n\nData entry and maintain spreadsheets regarding work sent out to contractors as needed.\n\\n\nBe a resource for project specialists and contact center representatives to provide updates on work orders sent to contractors.\n\\n\nAssist Technical Project Manager and Program Manager with contractor onboarding as needed.\n\\n\nAssist Technical Project Manager train energy assessors on best practices for compiling assessment reports as needed.\n\\n\n\\n\nQualifications:\n\\n\n\\n\nBuilding Performance Institute (BPI) analyst certification required.\n\\n\nHVAC installation and repair.\n\\n\nTraining in weatherization and energy efficiency principals and techniques.\n\\n\nExcellent communication and interpersonal skills.\n\\n\nComfortable working in urban and rural setting with people of diverse background.\n\\n\nExercises good judgment and maintains safety at all times.\n\\n\nAble to lead, motivate, be diplomatic, and build positive rapport with customers.\n\\n\nCommunicate with technical and non-technical individuals.\n\\n\nWork independently and/or as a team member.\n\\n\nAble to work flexible schedule, including some later evenings and weekends.\n\\n\nAbility to bend, stoop and reach.\n\\n\nAble to learn and work with new technology (e.g. handheld data devices).\n\\n\nCurrent driver’s license and good driving record.\n\\n\n\\n\nMINIMUM REQUIREMENTS\n\\n\n\\n\nField experience in related disciplines including HVAC, HVAC-R, Building Sciences, or Energy Auditing.\n\\n\nAble to work in a very fast-paced environment and hold to deadlines.\n\\n\nProblem-solver. Able to respond to diverse set of challenges in the field and do whatever it takes to meet project deliverables on schedule.\n\\n\nAbility to communicate effectively with subordinates, peers, superiors and customers.\n\\n\nProficient in Microsoft Office applications (e.g., Word, Excel, Power Point)\n\\n\nKnowledge and understanding of energy audits and the direct install measures.\n\\n\n\\n\nPREFERRED QUALIFICATIONS\n\\n\n\\n\nKnowledge working in utility industry or with energy management programs.\n\\n\n\\n\nPay: $65,000.00 - $75,000.00 per year\n\\n\nBenefits:\n\\n\n\\n\n401(k)\n\\n\nDental insurance\n\\n\nHealth insurance\n\\n\nPaid time off\n\\n\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}