{
  "filename": "data_analyst_New_York__NY_page14_job2_Senior_Associate__Insights___A.html",
  "job_title": "Senior Associate, Insights & Analytics",
  "company": "New York Life",
  "location": "New York, NY•Hybrid work",
  "salary": "$79,000 - $113,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:29:24.225Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nRequisition ID\n\\n\n\\n     92987\\n\n\\n\n\\n\n\\n\nDepartment\n\\n\n\\n     Purchase Experience Value Stream\\n\n\\n\n\\n\n\\n\nJob Function\n\\n\n\\n     Purchase Experience Value Stream\\n\n\\n\n\\n\n\\n\nLocation\n\\n\n\\n     New York,New York,United States\\n\n\\n\n\\n\n\\n\nRole Location Designation\n\\n\n\\n     Hybrid - 1 day per week\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nLocation Designation:\nHybrid - 1 day per week\n\\n\n\\n\nNew York Life is seeking a motivated data professional to join the Insights & Analytics team within the Purchase Experience (PX) Value Stream. The team is responsible for monitoring, analyzing, and reporting on key operational and underwriting metrics that inform senior management’s understanding of program performance and risk outcomes. This position will primarily support analytics and reporting for New York Life’s accelerated underwriting programs and mortality risk predictive models; helping ensure the accuracy, consistency, and interpretability of data used in decision-making.\n\\n\n\\n\nThe role will be an integral part of the PX Insights & Analytics team, working with partners such as Risk, Actuarial, and Underwriting to deliver high-quality data analysis and reporting. It requires strong SQL skills, curiosity about how business processes translate into data, and a desire to grow into a subject matter expert on NYL’s underwriting programs and data sources.\n\\n\n\\n\nQualifications:\n\\n\n\\n\nBA Degree in Computer Science, Data Science, Data Analytics/Business Intelligence.\n\\n\n1-3 years Support monitoring and reporting for accelerated underwriting programs and related models by writing SQL queries, validating data, and maintaining recurring dashboards and reports used by business leadership and cross-functional partners.\n\\n\nAssist in preparing metrics and exhibits for recurring reports that summarize program performance, identify trends or anomalies, and support executive discussions.\n\\n\nConduct ad hoc analyses related to predictive model performance, fraud detection, protective value studies, and mortality risk, working in collaboration with other analysts.\n\\n\nContribute to data infrastructure improvements, including the replatforming of datasets from Redshift to Databricks and DBT, and the alignment of data definitions and metrics across multiple product lines.\n\\n\nCollaborate with IT and data partners to ensure data integrity, troubleshoot issues, and document key logic and data transformations used in reporting.\n\\n\nDevelop technical and business expertise in external underwriting data sources and their connection to underwriting and risk management.\n\\n\nEngage with business partners and end users to understand data needs, clarify metric definitions, and communicate results in a clear and actionable way.\n\\n\nDocument recurring processes and analytical logic to ensure transparency, repeatability, and continuous improvement of team reporting assets.\n\\n\nExpected to gain a thorough understanding of the business, developing both technical proficiency and subject matter expertise that enable independent analysis and effective collaboration with cross-functional teams.\n\\n\n\\n\n\\n\n\\n\nIn addition to the responsibilities listed above, candidates should have strong analytical and documentation skills, including proficiency in SQL for data extraction and validation, as well as Excel for analysis and quality checks.\\n\n\\n\n\\n\nFamiliarity with Tableau or other visualization tools is helpful for dashboard maintenance.\n\\n\nCandidates should be comfortable working with large relational datasets and integrating multiple data sources, with the ability to clearly document queries and data logic.\n\\n\nEffective communication skills and the ability to translate technical findings for business partners are also essential.\n\\n\n\\n\n\\n\nPay Transparency\n\\n\nSalary Range: $79,000-$113,000\n\\n\nOvertime eligible: Exempt\n\\n\nDiscretionary bonus eligible: Yes\n\\n\nSales bonus eligible: No\n\\n\nActual base salary will be determined based on several factors but not limited to individual’s experience, skills, qualifications, and job location. Additionally, employees are eligible for an annual discretionary bonus. In addition to base salary, employees may also be eligible to participate in an incentive program.\n\\n\n\\n\n\\n\nCompany Overview\n\\n\n\\n\n\\n\nAt New York Life, our 180-year legacy of purpose and integrity fuels our future. As we evolve into a more technology-, data-, and AI-enabled organization, we remain grounded in the values that drive lasting impact.\n\\n\n\\n\n\\n\nOur diverse business portfolio creates opportunities to make a difference across industries and communities—inviting bold thinking, collaborative problem-solving, and purpose-driven innovation. Here, you’ll find the rare balance of long-standing stability and forward momentum, supported by an inclusive team that honors tradition while embracing progress.\n\\n\n\\n\n\\n\nAs a Fortune 100 mutual company, we offer a place to grow your skills, contribute to meaningful work, and deliver solutions that matter. Your ideas drive what’s next, and your growth powers it.\n\\n\n\\n\n\\n\nOur Benefits\n\\n\nWe provide a full package of benefits for employees – and have unique offerings for a modern workforce, including leave programs, adoption assistance, and student loan repayment programs. Based on feedback from our employees, we continue to refine and add benefits to our offering, so that you can flourish both inside and outside of work.\nClick here\nto discover more about our comprehensive benefit options or visit our NYL Benefits Site.\n\\n\n\\n\nOur Commitment to Inclusion\nAt New York Life, fostering an inclusive workplace is fundamental to who we are and how we serve our communities. We have a longstanding commitment to creating an environment where individuals can contribute their best and succeed together. This foundation is rooted in our core values of humanity and integrity, ensuring that every employee feels valued and supported. By embracing a broad range of perspectives and experiences, we achieve greater success and fulfill our promise of providing financial security and peace of mind to families across all communities. Click here to learn more about New York Life’s leadership in this space.\n\\n\nRecognized as one of\nFortune’s\nWorld’s Most Admired Companies, New York Life is committed to improving local communities through a culture of employee giving and volunteerism, supported by the Foundation. We're proud that due to our mutuality, we operate in the best interests of our policy owners. To learn more about career opportunities at New York Life, please visit the Careers page of www.NewYorkLife.com.\n\\n\nVisit our LinkedIn to see how our employees and agents are leading the industry and impacting communities.\n\\n\nVisit our Newsroom to learn more about how our company is constantly evolving to meet our clients' and employees’ needs.\n\\n\n\\n\nJob Requisition ID: 92987\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=44102f37d9e309b5&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfp3d75l0258c6&spon=0&xkcb=SoBK67M3pv6CdcW0BR0JbzkdCdPP&xfps=87e6fad1-e203-4878-8813-9c26f17338ce&vjfrom=vjs&asub=mob&astse=097cea71093fd264&assa=9788"
}