{
  "filename": "data_analyst_New_York__NY_page10_job8_Marketing_and_Data_Analyst.html",
  "job_title": "Marketing and Data Analyst",
  "company": "Formosa Plastics Corporation, USA",
  "location": "9 Peach Tree Hill Road, Livingston, NJ 07039",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:21:32.703Z",
  "full_description": "Company Overview for Formosa Plastics Corporation, U.S.A.\nFounded in 1978, Formosa Plastics Corporation, U.S.A. (Formosa Plastics) is a growing, vertically-integrated supplier of plastic resins and petrochemicals. With annual revenues of more than $5 billion, we employ over 2,800 people who operate 20 production units in six business divisions - Olefins, Polyolefins, Vinyl, Specialty Polyvinyl Chloride, Chlor-Alkali, and Oil & Gas.\nFormosa Plastics offers a full line of polyvinyl chloride, polyethylene and polypropylene resins, caustic soda and other petrochemicals that deliver the consistency, performance and quality that customers demand. We market our polypropylene and polyethylene resins under the Formolene® tradename; we market our suspension PVC and specialty (dispersion) PVC resins under the Formolon® tradename. We also produce and sell caustic soda, ethylene dichloride, commercial bleach and hydrochloric acid.\nWe are committed to supplying the highest quality products and services to our customers, providing a safe and healthy workplace for our employees and contributing to the quality of life in the communities where we operate. This commitment is made possible through our dedicated people, consistent products, continued protection of the environment and ongoing investments in new product development, quality control systems and safe, modern and energy-efficient production facilities.\nFormosa Plastics is a privately held company headquartered in Livingston, New Jersey. Our core business, producing plastic resins and petrochemicals, takes place at three wholly-owned chemical manufacturing subsidiaries located in Delaware City, Delaware, Baton Rouge, Louisiana and Point Comfort, Texas.\nMarketing and Data Analyst\nPOSITION OBJECTIVE\nCollect, organize and analyze data on customers, markets and products. Coordinate the information with various teams and other work-related duties as assigned\nMAJOR AREAS OF ACCOUNTABILITY\n\\n\n\\n\nConduct research to identify market trends and customer preferences through customer feedback, market reports, internal and external databases\n\\n\nAnalyze trends, patterns and insights by conducting data analysis and provide reports on data to management team\n\\n\nUnderstand and analyze companies’ objectives while developing reports\n\\n\nIdentify and define Key performance indicators (KPIs) to measure impact of business activities\n\\n\nContinuously monitor market trends, competitors’ activities, and consumer preferences change to adjust marketing strategies.\n\\n\nAct as a liaison between different departments to monitor project progress and alignment with the goal.\n\\n\nPrepare reports through either Tableau or PowerBI\n\\n\nOther work as assigned\n\\n\nQUALIFICATIONS\n\\n\n\\n\n1-3 years’ experience with data analysis\n\\n\nExcellent English and/or multilingual proficiency.\n\\n\nTableau or PowerBI\n\\n\nDatabase tools\n\\n\nSQL\n\\n\nUse of Microsoft Office Excel, Word and Outlook\n\\n\nFour year college degree in a representative field of study\n\\n\nCheck Out Our Benefits\nHealth Coverage and Perks\nExcellent medical, dental, and vision insurance plans\nFlexible spending accounts for health, dependent care\nShort-term Disability\nLong-term Disability\nGroup Term Life, Dependent and\nSupplemental Life Insurance\nTuition Reimbursement\n​​​​​​​\nWork/Life Balance\n10 Paid Holidays\nPaid Time Off for a balanced life\n(Vacation, Sick and Personal Time)\nFlexTime Available\nCompetitive Compensation\nCompetitive salary, incentive/bonus, 401(k) plan with company match,\nCash Balance, Pension Plan",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=a690ad2cd8521685&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoj3k62dir088&spon=0&xkcb=SoDo67M3pv5DoOyJaB0DbzkdCdPP&xfps=6c3703bf-04b7-478a-a9e6-3d0f09721a46&vjfrom=vjs&asub=mob&astse=415073fef7109442&assa=3126"
}