{
  "filename": "data_analyst_New_York__NY_page6_job12_Business_Intelligence_Analyst.html",
  "job_title": "Business Intelligence Analyst",
  "company": "Quantum Integrators",
  "location": "Princeton, NJ",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:02:31.598Z",
  "full_description": "Job Description\nJob ID\nQI085\nExperience Level\nEntry-Level (1+ years)\nLocation\nPrinceton, NJ, USA\nEmployment Type\nFull-Time\nAbout the role\nThe Business Intelligence Analyst will design, implement, and maintain BI platforms that empower business teams with actionable insights from complex datasets. This role involves analyzing data requirements, creating robust data models, and developing ETL processes to populate data warehouses and other stores. The analyst will lead complex analyses, maintain regular metrics reporting, and collaborate with both technology teams and business stakeholders to design data flows that drive informed decisions. Additionally, this role supports data validation, troubleshooting, performance tuning, and automation of reports and dashboards, ensuring high-quality, reliable data insights.\nKey Responsibilities\nDesign and implement Business Intelligence platforms to provide business teams with ad-hoc access to large datasets and actionable insights.\nAnalyze complex data requirements, perform data discovery, and build data models, tables, views, procedures, and ETL jobs to populate data warehouses.\nLead complex data analyses and maintain regular metrics reporting to support stakeholder decision-making.\nPartner with technology teams and business stakeholders to design and optimize data flows for actionable insights.\nPerform data validation, error checking, troubleshooting, performance tuning, and maintain data schemas across application environments.\nDevelop, optimize, and maintain automated reports, dashboards, and data integration solutions.\nParticipate in testing database-related and BI solution changes, as well as application updates.\nCreate and maintain documentation on key findings, ongoing processes, and project roadmaps.\nTravel to client locations within the US as needed (approximately 1–2 times per month).\nRequired Qualifications\nMaster’s degree or foreign equivalent in Computer Science, Engineering, or Business Administration.\nMinimum 6 months of relevant work experience in Business Intelligence or data analysis.\nStrong understanding of data modeling, ETL processes, and data warehousing concepts.\nProficiency in SQL and experience with database management systems.\nAbility to analyze complex datasets and generate actionable insights.\nPreferred Skills\nExperience with BI tools such as Power BI, Tableau, or Looker.\nStrong analytical and problem-solving skills with attention to detail.\nExcellent communication and collaboration skills for working with cross-functional teams.\nFamiliarity with performance tuning, automation, and data integration best practices.\nWhat We Offer\nCompetitive salary and performance-based bonuses.\nComprehensive health insurance.\nLearning and professional development opportunities.\nFlexible working hours and remote work options.\nApplication Process\nIf you are interested, please send your updated resume to careers@quantumintegrators.com.",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=929283918189ca87&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnfc72293c07e&spon=0&xkcb=SoDd67M3pvmyVWACJ70HbzkdCdPP&xfps=83f23af7-cb7b-4dfa-a6cb-7c4f43a23940&vjfrom=vjs&asub=mob&astse=b74293c069deea4d&assa=2017"
}