{
  "filename": "data_analyst_New_York__NY_page5_job7_Call_Center_Data_Analyst.html",
  "job_title": "Call Center Data Analyst",
  "company": "Antech Diagnostics",
  "location": "400 Lakeville Road, Lake Success, NY 11042",
  "salary": "$56,320 - $70,400 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:59:33.694Z",
  "full_description": "We understand that the world we want tomorrow starts with how we do business today, and that’s why we’re inspired to make A Better World for Pets. Antech is comprised of a diverse team of individuals who are committed to each other’s growth and development. Our culture is centered on our guiding philosophy, The Five Principles: Quality, Responsibility, Mutuality, Efficiency and Freedom. Today Antech is driving the future of pet health as part of Mars Science & Diagnostics , a family-owned company focused on veterinary care.\nCurrent Associates will need to apply through the internal career site. Please log into Workday and click on Menu or View All Apps, select the Jobs Hub app, then click the magnifying glass to Browse Jobs.\nThe Target Pay Range for this position is as follows:\nLoveland, Colorado:\n$56,320-$70,400 annually\nLake Success, NY:\n$61,440- $76,800 annually\nAt Antech, pay decisions are determined using factors such as relevant job-related skills, experience, education, training and budget.\nJob Purpose/Overview\nThe Call Center Data Analyst delivers on the Antech Customer Service Vision of unwavering commitment to empathetic and caring veterinary diagnostic support via the Support Enablement Team. The Call Center Data Analyst will be responsible for collecting, analyzing, and reporting on a wide range of business critical Call Center performance metrics to support operational excellence and strategic decision-making. This role will focus on delivering actionable insights into business performance, agent productivity, quality assurance, workforce management, and customer experience. The analyst will work extensively with data sources such as Nice CXOne, Salesforce, and other reporting tools to ensure accurate, timely, and meaningful reporting for stakeholders across the organization.\nEssential Duties and Responsibilities\nCollect, organize, and analyze data related to Call Center Operations, including, but not limited to, workflow, resource utilization, performance and financial metrics.\nCollaborate with leaders in a ‘user centric’ approach to tool and report building that ensures requirements are aligned and outputs are optimized.\nOwn the end-to-end data lifecycle for Call Center Operations.\nBuild and maintain ETL processes to extract, transform, and load data from Nice CXOne, Salesforce, and various vendor sources.\nEnsure data cleanliness, consistency, and accuracy across systems.\nDevelop and maintain business intelligence dashboards (e.g., Power BI) and recurring reports to support operational and financial monitoring.\nConduct in-depth analysis to uncover trends, variances, and actionable insights.\nTrack and present key performance indicators (KPIs) such as speed of answer times, average handle times, service levels, call volume trends, a and other associated call center metrics.\nServe as the primary data partner for call center leadership, translating complex data into clear, impactful insights that support operational excellence.\nWork with management to assess, intake, prioritize, plan and execute data projects.\nCollaborate with Mars Petcare and Science and Diagnostics division data teams to ensure alignment with corporate data governance policies, data architecture standards, and business intelligence strategies.\nAlways represent Antech professionally.\nMay be asked to participate in enterprise initiatives, special projects, and other duties as assigned.\nEducation and Experience\nBachelor’s degree in data science, Business Analytics, Statistics, or a related field (master’s degree preferred).\n7-10+ years of experience in data analytics, ideally within a call center environment.\nProven experience operating effectively as a sole data analyst, or managing small analytics or reporting team, ideally in healthcare, laboratory, or operations-focused environment.\nKnowledge, Skills and Abilities\nProficiency in SQL, Excel, and data visualization best practices.\nProven experience designing and managing workflows and data pipelines.\nExpertise in business intelligence tools such as Power BI, Tableau, or similar platforms.\nExcellent communication skills with the ability to present technical findings to non-technical stakeholders.\nDemonstrated ability to think critically and creatively bringing innovative solutions to complex operational and data challenges\nComfortable working independently and managing multiple priorities in a fast-paced setting.\nStrong knowledge of laboratory operations, test coding (e.g., LOINC) is preferred\nWorking Conditions\nThe associate is regularly required to apply manual dexterity, including hand/wrist flexibility, for computer keyboarding. The associate frequently is required to sit for extended periods of time, stand, walk, and reach with hands and arms. The associate is frequently required to hear and speak in order to use the telephone, make presentations and communicate with people in an office environment. The associate is occasionally required to sit and stoop, bend, kneel, or crouch. The associate must occasionally lift and/or move up to 15 pounds.\nThe associate will primarily work in a typical office environment including use of cubicles, computers and overhead lighting. Temperature extremes will be minimal to nonexistent. The noise level in the work environment is usually moderate. The associate will be required to use a computer, spreadsheets, data base management, email, and the Internet. The associate may need to use a copy machine, fax machine, and phone system. The associate must occasionally use media equipment such as an overhead projector, PowerPoint, and Microsoft Teams.\nAbout Antech\nAntech is a leader in veterinary diagnostics, driven by our passion for innovation that delivers better animal health outcomes. Our products and services span 90+ reference laboratories around the globe; in-house diagnostic laboratory instruments and consumables, including rapid assay diagnostic products and digital cytology services; local and cloud-based data services; practice information management software and related software and support; veterinary imaging and technology; veterinary professional education and training; and board-certified specialist support services.\nAntech offers an industry competitive benefits package and continues to invest in and evolve benefits programs that meet the health, wellness and financial needs of our associates.\nAll Full-time associates are eligible for the following benefits and more:\nPaid Time Off & Holidays\nMedical, Dental, Vision (Multiple Plans Available)\nBasic Life (Company Paid) & Supplemental Life\nShort and Long Term Disability (Company Paid)\nFlexible Spending Accounts/Health Savings Accounts\nPaid Parental Leave\n401(k) with company match\nTuition/Continuing Education Reimbursement\nLife Assistance Program\nPet Care Discounts\nWe are proud to be an Equal Opportunity Employer - Veterans / Disabled. For a complete EEO statement, please see our Career page at Antech Careers .\nNote to Search Firms/Agencies\nAntech Diagnostics, Inc. and its subsidiaries and affiliates (Antech) do not compensate search firms for unsolicited assistance unless they have a written search agreement with Antech and the requisition is position-specific. Any resumes, curriculum vitae, and other unsolicited assistance from search firms that do not have a written search agreement or position-specific requisition submitted to any Associate of Antech will be deemed the sole property of Antech and no fee will be paid in the event the candidate is hired by Antech.",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=809ccc32298a2d0e&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnbj48jn1a803&spon=0&xkcb=SoBT67M3pvmhsM20BR0MbzkdCdPP&xfps=68912f6c-dc6b-4a12-b421-4c752cf4a27a&vjfrom=vjs&asub=mob&astse=597554d32761f3f0&assa=8630"
}