{
  "filename": "data_analyst_New_York__NY_page12_job3_Data_Analyst_and_Development_C.html",
  "job_title": "Data Analyst and Development Consultant - Per Diem at Penn Medicine",
  "company": "Penn Medicine",
  "location": "3400 Spruce Street, Philadelphia, PA 19104",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T11:25:36.662Z",
  "full_description": "\\n\nDescription\nPenn Medicine is dedicated to our tripartite mission of providing the highest level of care to patients, conducting innovative research, and educating future leaders in the field of medicine. Working for this leading academic medical center means collaboration with top clinical, technical and business professionals across all disciplines.\nToday at Penn Medicine, someone will make a breakthrough. Someone will heal a heart, deliver hopeful news, and give comfort and reassurance. Our employees shape our future each day. Are you living your life's work?\\n\nSummary:\n\\n\n\\n\nResponsibilities include researching, collecting, analyzing and interpreting the data to guide-decision making and improvement of operations. Assists with grant opportunities and works collaboratively with community engagement manager and team members. Provides administrative and logistical support as needed. Responsible for managing, summarize datasets, prepare graphics, report findings and conduct training on questionnaire design. Strong writing skills required.\n\\n\n\\n\nResponsibilities:\n\\n\n\\n\n\\n\nUnderstand research and evaluation goals in order to adapt appropriate research and evaluation methods, via Redcap and associated systems.\n\\n\nProficiency with Redcap system and developing instruments.\n\\n\nRun reports and perform training for collaborating staff.\n\\n\nAssist in grant writing and utilization of data to demonstrate program impact.\n\\n\nManages volunteer database, schedule and communications.\n\\n\nTracks food inventory, ordering, patron throughput, and bags distributed.\n\\n\nCollaborate with patients and hospital staff to deliver a coordinated and seamless service through referral process andassigning \"shoppers\" to work with client.\n\\n\nWorks within safety guidelines for volunteers, clients visitors maintaining clean environment and food safety.\n\\n\nCoordinates donation drop offs and checking delivery drop offs from community partners.\n\\n\nDesign basic training for staff to comply on Quality Improvement and Research methods.\n\\n\n\\n\n\\n\nEducation or Equivalent Experience:\n\\n\n\\n\nHigh School Diploma (Required)\n\\n\nBachelor of Arts or Science (Preferred) with Education Specialization: public health/ healthcare administrationEquivalent Experience:•And 1+ years Data analyzing experience.\n\\n\nWe believe that the best care for our patients starts with the best care for our employees. Our employee benefits programs help our employees get healthy and stay healthy. We offer a comprehensive compensation and benefits program that includes one of the finest prepaid tuition assistance programs in the region. Penn Medicine employees are actively engaged and committed to our mission. Together we will continue to make medical advances that help people live longer, healthier lives.\nLive Your Life's Work\\n\n\\n\nWe are an Equal Opportunity employer. Candidates are considered for employment without regard to race, ethnicity, color, sex, sexual orientation, gender identity, religion, national origin, ancestry, age, disability, marital status, familial status, genetic information, domestic or sexual violence victim status, citizenship status, military status, status as a protected veteran or any other status protected by applicable law.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=4e7892430f789006&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoAD67M3pv5_3dy4ax0IbzkdCdPP&xfps=d8271f60-5c22-438f-b9de-91de36e53dbd&vjfrom=vjs&asub=mob&astse=6eea013b2ca8d52d&assa=7014"
}