{
  "filename": "data_analyst_New_York__NY_page7_job7_Analyst__MASS_Models_Data_Coll.html",
  "job_title": "Analyst, MASS Models Data Collection, Reconciliation, and Reporting",
  "company": "BlackRock Investments",
  "location": "Princeton, NJ•Hybrid work",
  "salary": "$76,000 - $95,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:14:12.038Z",
  "full_description": "\\n\n\\n\n\\n   Location:\\n\n\\n\n\\n\n\\n\nPrinceton, New Jersey\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n   Team:\\n\n\\n\n\\n\nFund Accounting\n\\n\n\\n\n\\n\n\\n  Job Requisition #:\nR257761\n\\n\n\\n\n\\n  Date posted:\nDec. 24, 2025\n\\n\n\\n\n\\n\n\\n\n\\n\nJob description\n\\n\n\\n\nAbout this role\n\\n\nBlackRock’s purpose is to help more and more people experience financial well-being. As a fiduciary to investors and a leading provider of financial technology, our clients turn to us for the solutions they need when planning for their most important goals\n.\n\\n\nThis position supports operational functions of the BlackRock Multi-Asset Strategies & Solutions (MASS) Models team. The team is responsible for acquiring, harmonizing, and managing MASS Model third party client data for reporting purposes. The metrics produced by the team provides transparency at the client level and measures the success of the business.\n\\n\nAbout Client Experience\n\\n\nOur mission within the Client Experience (CX) organization is to make it easier for clients to do business with BlackRock, making service so simple it becomes a source of alpha. We are organized across 3 key pillars:\n\\n\n1. Client Experience Delivery, client-facing teams orchestrating all aspects of service delivery, and onboarding teams bringing new business onto our platform,\n\\n\n2. Client Experience Operations, core client operations teams driving reporting, billing, and onboarding due diligence across the globe, and\n\\n\n3. Client Experience Transformation, accelerating progress towards our CX mission via research and competitive insights, analytics, marketing, business and change management\n\\n\nRole Responsibilities\n\\n\n\\n\nWork closely with partners (Business Management, Sales, Product Strategy, Finance) to process Third Party Models Solutions reporting and provide client metrics to the BlackRock Multi-Manager & Models team while ensuring data integrity.\n\\n\nMaintain and reconcile Models Solutions AUM reporting data within core systems. This could include researching information across a variety of data sources from Clients, trading partners and other internal systems.\n\\n\nEnsure a robust control environment exists between with internal partners.\n\\n\nDrive increased efficiency and innovation through continuous review of operating procedures and planning / evaluating technology improvements.\n\\n\nResearching differences and/or anomalies between client reporting submissions using Excel / MS Access.\n\\n\nOpportunity to cross train with US Intermediary Payments Team which focuses on Operational and Recording disbursements and Distribution & Marketing disbursements to US financial intermediaries.\n\\n\n\\n\nExperience\n\\n\n\\n\nBachelor’s degree is required with 1-2 years of experience preferred\n\\n\nMajor or minor in Accounting or Finance preferred\n\\n\nThe ideal candidate should be fluent in Microsoft Office products with an emphasis on advanced Excel skills. Knowledge of AI applications is a plus.\n\\n\nA demonstrated ability to explain complex concepts to a broader audience (Communication Skills)\n\\n\nSelf-motivated, determined to achieve goals and works hard to meet those goals; ability to work independently as well as in a team environment (Drive, Determination and Execution)\n\\n\nTeam player able to work in an innovative, driven, and fast-paced environment\n\\n\nExcellent organizational and problem-solving skills; be able to lead and prioritize a wide variety of concurrent and competing projects\n\\n\nMakes timely decisions and is prepared to take action in conditions of uncertainty or ambiguity (Decision Making)\n\\n\nA strong attention to detail is imperative with the ability to multi-task and work under pressure to meet deadlines\n\\n\nAbility to identify and resolve data discrepancies quickly by using sound analytical and problem-solving skills\n\\n\nFor Princeton, NJ Only the salary range for this position is USD$76,000.00 - USD$95,000.00 . Additionally, employees are eligible for an annual discretionary bonus, and benefits including healthcare, leave benefits, and retirement benefits. BlackRock operates a pay-for-performance compensation philosophy and your total compensation may vary based on role, location, and firm, department and individual performance. \\n\nOur benefits\nTo help you stay energized, engaged and inspired, we offer a wide range of benefits including a strong retirement plan, tuition reimbursement, comprehensive healthcare, support for working parents and Flexible Time Off (FTO) so you can relax, recharge and be there for the people you care about.\n\\n\nOur hybrid work model\n\\n\nBlackRock’s hybrid work model is designed to enable a culture of collaboration and apprenticeship that enriches the experience of our employees, while supporting flexibility for all. Employees are currently required to work at least 4 days in the office per week, with the flexibility to work from home 1 day a week. Some business groups may require more time in the office due to their roles and responsibilities. We remain focused on increasing the impactful moments that arise when we work together in person – aligned with our commitment to performance and innovation. As a new joiner, you can count on this hybrid model to accelerate your learning and onboarding experience here at BlackRock.\n\\n\nAbout BlackRock\n\\n\nAt BlackRock, we are all connected by one mission: to help more and more people experience financial well-being. Our clients, and the people they serve, are saving for retirement, paying for their children’s educations, buying homes and starting businesses. Their investments also help to strengthen the global economy: support businesses small and large; finance infrastructure projects that connect and power cities; and facilitate innovations that drive progress.\n\\n\nThis mission would not be possible without our smartest investment – the one we make in our employees. It’s why we’re dedicated to creating an environment where our colleagues feel welcomed, valued and supported with networks, benefits and development opportunities to help them thrive.\n\\n\nFor additional information on BlackRock, please visit @blackrock | Twitter: @blackrock | LinkedIn: www.linkedin.com/company/blackrock\n\\n\n\\n\nBlackRock is proud to be an equal opportunity workplace. We are committed to equal employment opportunity to all applicants and existing employees, and we evaluate qualified applicants without regard to race, creed, color, national origin, sex (including pregnancy and gender identity/expression), sexual orientation, age, ancestry, physical or mental disability, marital status, political affiliation, religion, citizenship status, genetic information, veteran status, or any other basis protected under applicable federal, state, or local law.\nView the\nEEOC’s Know Your Rights poster and its supplement\nand the\npay transparency statement\n.\n\\n\n\\n\nBlackRock is committed to full inclusion of all qualified individuals and to providing reasonable accommodations or job modifications for individuals with disabilities. If reasonable accommodation/adjustments are needed throughout the employment process, please email Disability.Assistance@blackrock.com. All requests are treated in line with our\nprivacy policy\n.\nBlackRock will consider for employment qualified applicants with arrest or conviction records in a manner consistent with the requirements of the law, including any applicable fair chance law.\\n\n\\n\n\\n\n\\n\nJob Requisition #\nR257761\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=f78b555975eec790&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfo1hnsi8qp803&spon=0&xkcb=SoDd67M3pv4J5G2EiJ0MbzkdCdPP&xfps=8449d4b8-ee8b-4ee9-928d-497e415a2b66&vjfrom=vjs&asub=mob&astse=285ffb7160090770&assa=5921"
}