{
  "filename": "data_analyst_New_York__NY_page7_job4_Investor_Reporting___Fund_Oper.html",
  "job_title": "Investor Reporting & Fund Operations Analyst / Associate",
  "company": "Invesco",
  "location": "New York, NY 10281•Hybrid work",
  "salary": "$105,000 - $123,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:13:49.107Z",
  "full_description": "\\n\n\\n  About Invesco\\n\n\\n\n\\n\n\\n  As one of the world’s leading independent global investment firms, Invesco is dedicated to rethinking possibilities for our clients. By delivering the combined power of our distinctive investment management capabilities, we provide a wide range of investment strategies and vehicles to our clients around the world. If you're looking for challenging work, intelligent colleagues, and exposure across a global footprint, come explore your potential at Invesco.\\n\n\\n\n\\n\n\\n\n\\n\n\\n    What’s in it for you?\\n\n\\n\n\\n\n\\n\n\\n\n\\n    Our people are at the very core of our success. Invesco employees get more out of life through our comprehensive compensation and benefit offerings including:\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n      Flexible paid time off\\n\n\\n\n\\n\n\\n      Hybrid work schedule\\n\n\\n\n\\n\n\\n      401(K) matching of 100% up to the first 6% with a discretionary supplemental contribution\\n\n\\n\n\\n\n\\n      Health & wellbeing benefits\\n\n\\n\n\\n\n\\n      Parental Leave benefits\\n\n\\n\n\\n\n\\n      Employee stock purchase plan\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n    Job Description\\n\n\\n\n\\n\n\\n\n\\n\n\\n  Key Responsibilities\\n\n\\n\n\\n  Client Reporting\\n\n\\n\n\\n\n\\n\n\\n    Own the quarterly reporting process, including creating graphs, tables, and maintaining databases.\\n\n\\n\n\\n\n\\n    Prepare client materials for update calls, meetings, and annual reviews.\\n\n\\n\n\\n\n\\n    Assist in responding to client data requests, including unfunded commitment and loan summary reports.\\n\n\\n\n\\n\n\\n    Support the creation of fund extension materials and related analytics.\\n\n\\n\n\\n\n\\n    Review and refine client materials.\\n\n\\n\n\\n\n\\n    Coordinate with Investment Management teams to ensure data accuracy and timely reporting.\\n\n\\n\n\\n\n\\n    Support the preparation of presentation materials for client meetings, client update calls, and internal fund reviews.\\n\n\\n\n\\n\n\\n    Collaborate with team members to refine messaging and ensure consistency across client communications.\\n\n\\n\n\\n\n\\n  Fund Operations\\n\n\\n\n\\n\n\\n\n\\n    Assist in capital calls and distribution processes.\\n\n\\n\n\\n\n\\n    Review and validate waterfall calculations and advisory fee calculations.\\n\n\\n\n\\n\n\\n    Help track asset performance and capital deployment metrics.\\n\n\\n\n\\n\n\\n  Process Optimization & Presentation Support\\n\n\\n\n\\n\n\\n\n\\n    Enhance internal efficiency by automating reports and standardizing templates.\\n\n\\n\n\\n\n\\n    Create high-quality PowerPoint presentations with strong formatting.\\n\n\\n\n\\n\n\\n    Maintain and update reporting databases and fund models on a monthly basis.\\n\n\\n\n\\n\n\\n    Ensure presentation materials are tailored to audience needs, including institutional investors as well as internal stakeholders / committees.\\n\n\\n\n\\n\n\\n    Assist in developing templates and visual standards for recurring client and fund reporting decks.\\n\n\\n\n\\n\n\\n\n\\n\nQualifications\\n\n\\n\n\\n\n\\n\n\\n    Bachelor’s degree in Finance, Real Estate, Business Administration, or related field.\\n\n\\n\n\\n\n\\n    One+ year(s) of experience in real estate investment, fund operations, or investor relations preferred but not required.\\n\n\\n\n\\n\n\\n    Exceptional organizational skills with strong attention to detail.\\n\n\\n\n\\n\n\\n    Excellent written and verbal communication skills.\\n\n\\n\n\\n\n\\n    Proactive and act with sense of urgency with internal and client requests.\\n\n\\n\n\\n\n\\n    Demonstrated resourcefulness with strong problem-solving skills.\\n\n\\n\n\\n\n\\n    Ability to manage multiple priorities and meet deadlines in a fast-paced environment.\\n\n\\n\n\\n\n\\n    Advanced proficiency in Microsoft Excel and PowerPoint.\\n\n\\n\n\\n\n\\n    Familiarity with Yardi is a plus.\\n\n\\n\n\\n\n\\n  The total compensation offered for this position, which includes salary and incentive pay, will vary based on skills, experience and location. The salary range for this position in New York is $105,000 to $123,000 annually.\\n\n\\n\n\\n\n\\n  Full Time / Part Time\\n\n\\n\nFull time\\n\n\\n\n\\n  Worker Type\\n\n\\n\nEmployee\\n\n\\n\n\\n  Job Exempt (Yes / No)\\n\n\\n\nYes\\n\n\\n\n\\n  Workplace Model\\n\n\\n\n\\n\n\\n  Pursuant to Invesco’s Workplace Policy, employees are expected to comply with the firm’s most current workplace model, which as of October 1, 2025, includes spending at least four full days each week working in an Invesco office. This reflects our belief that spending time together in the office helps us build stronger relationships, collaborate more easily, and support each other’s growth and development.\\n\n\\n\n\\n\n\\n  The above information on this description has been designed to indicate the general nature and level of work performed by employees within this role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications required of employees assigned to this job. The job holder may be required to perform other duties as deemed appropriate by their manager from time to time.\\n\n\\n\n\\n\n\\n  Invesco's culture of inclusivity and its commitment to diversity in the workplace are demonstrated through our people practices. We are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, creed, color, religion, sex, gender, gender identity, sexual orientation, marital status, national origin, citizenship status, disability, age, or veteran status. Our equal opportunity employment efforts comply with all applicable U.S. state and federal laws governing non-discrimination in employment.\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=ed5538217c1feb1d&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfo1hnsi8qp803&spon=0&xkcb=SoBA67M3pv4J5G2EiJ0PbzkdCdPP&xfps=6147d46b-a7cc-45c4-8800-c3f5286ec430&vjfrom=vjs&asub=mob&astse=4a8ffa14acee0e62&assa=9484"
}