{
  "filename": "data_analyst_New_York__NY_page4_job4_Technical_Lead___Lead_Business.html",
  "job_title": "Technical Lead / Lead Business Functional Analyst",
  "company": "InfoQuest Consulting Group Inc.",
  "location": "Summit, NJ",
  "salary": null,
  "job_type": "Contract",
  "scraped_at": "2025-12-27T10:57:29.521Z",
  "full_description": "\\n\n\\n\nDuration & Type:\n12 months Contract with a major pharmaceutical industry client\n\\n\nLocation:\nSummit, New Jersey (This can be a remote role but the candidate should be able to come to the office occasionally as per business needs.)\n\\n\nDescription:\nThe application is a bespoke application built primarily for Sales Order Inventory Allocation and Forecast Optimization. It is integrated with SAP via Mulesoft APIs and is deployed into an Azure environment with MS SQL Server database at the backend. It uses Machine Learning algorithms, Python, JavaScript, and Angular JS.\n\\n\nResponsibilities:\n\\n\n\\n\nWork with IT system owner, platform lead and other stakeholders to create a transition plan to take on BAU support for the ap Technical Lead plication.\n\\n\nFacilitate work sessions and participate in meetings with existing IT support team to complete knowledge transition of the system/application and supporting technologies.\n\\n\nTrain junior members of the team to position them to take on BAU support activities of the application and interfaces/integration points.\n\\n\nCreate, maintain and update documentation related to architecture, BAU Operations, SOP’s.\n\\n\nPartner with other project team members from Infrastructure, Middleware, integrated apps/systems such as SAP to understand the architectural landscape and ecosystem for company’s supply chain, sales orders/demand management.\n\\n\nUse ITIL processes to resolve incidents, problem management, root cause investigation, change and release management.\n\\n\nRun daily health checks and monitoring activities to identify issues proactively.\n\\n\nEscalate issues as needed and work with other I&T teams to drive resolution of issues.\n\\n\nBAU Support during US business hours.\n\\n\nSupport for urgent/high severity issues/incidents will be needed outside of business hours especially during peak shipping season for flu vaccines during July – December time frame.\n\\n\nCommunicate with I&T and Business stakeholders as it related to BAU activities.\n\\n\n\\n\nRequired:\n\\n\n\\n\nFamiliarity with following Technologies is required: \\n\n\\n\nBack-end: Python, PL/SQL, MS SQL Server, Machine Learning\n\\n\nFront-end: JavaScript, Angular\n\\n\nAzure, Mulesoft, API Integration\n\\n\n\\n\nDesired domain experience: Forecast Optimization techniques, Data Science, Sales Order Management concepts, Supply Chain.\n\\n\n\\n\nFor consideration, please send resume to\ncareer@infoquestgroup.com\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=5cc4ce01b709fc7e&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfn8f3pi9eb8ah&spon=0&xkcb=SoC367M3pvmuMEygLZ0PbzkdCdPP&xfps=5618d429-a462-4d7c-873c-473ed1a7daab&sjdu=_MUXb9ZyjIpPbxoKXTguxnmwGj2tUJGoe_Pvn550oW9HtMlK3V6PZNODdZ6VdH8S&vjfrom=vjs&asub=mob&astse=28f9f5e20e7af50c&assa=3585"
}