{
  "filename": "data_analyst_New_York__NY_page6_job11_Logistics_Reporting_Analyst.html",
  "job_title": "Logistics Reporting Analyst",
  "company": "Broadridge",
  "location": "Edgewood, NY",
  "salary": "$19 - $22 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:02:21.353Z",
  "full_description": "\\n\n\\n  At Broadridge, we've built a culture where the highest goal is to empower others to accomplish more. If you’re passionate about developing your career, while helping others along the way, come join the Broadridge team.\\n\n\\n\n\\n\n\\n  Broadridge is growing! We are actively seeking a Logistics Reporting Analyst for our Edgewood facility.\\n\n\\n\n\\n\n\\n  Work Mode: This is an on-site role that will be assigned to a Broadridge location where you will work 100% of the time.\\n\n\\n\n\\n\n\\n  This opportunity is in our Customer Communications Division, which offers a full range of multi-channel communications solutions, such as integrated print, mail and digital solutions for transactional, marketing and compliance communications.\\n\n\\n\n\\n\n\\n  In this role, your main responsibility is to ensure that we receive accurate billing information from USPS and presort vendors in a timely manner. This allows Finance to bill for the jobs and ensure Broadridge is reimbursed sooner for postage and fees that were laid out on the client's behalf. This is an on-site role that will be assigned to a Broadridge location where you will work 100% of the time.\\n\n\\n\n\\n\n\\n  Responsibilities:\\n\n\\n\n\\n\n\\n\n\\n\n\\n    You will reconcile postage charges from USPS against Logistics postage statements to ensure accuracy of charges.\\n\n\\n\n\\n\n\\n    You'll develop and maintain operational reports consisting of volume and postage year over year which is sent out to managers on a weekly basis. 10%\\n\n\\n\n\\n\n\\n    You will identify if we were not billed accurately and follow up with USPS and vendors to make sure proper refunds and credits are collected when a job is billed incorrectly.\\n\n\\n\n\\n\n\\n    You'll research postage receipts in a dedicated fashion to avoid billing delays.\\n\n\\n\n\\n\n\\n    You will work closely with Process Control on jobs they request to solve issues or troubleshoot problems.\\n\n\\n\n\\n\n\\n    You'll update and maintain many Microsoft Access databases, Microsoft Excel spreadsheets and internal systems that store our postage receipts and billing data.\\n\n\\n\n\\n\n\\n    You will maintain the notice jobs and \"must mail\" spreadsheets ensuring Broadridge meets SLA’s.\\n\n\\n\n\\n\n\\n    You will communicate effectively and efficiently with USPS clerks, USPS supervisors, presort vendors and other areas of Production and Finance.\\n\n\\n\n\\n\n\\n    You'll communicate recurring errors to Logistics team so that they can make improvements.\\n\n\\n\n\\n\n\\n\n\\n  Qualifications:\\n\n\\n\n\\n\n\\n\n\\n\n\\n    1+ year related experience.\\n\n\\n\n\\n\n\\n    Beginner auditing and financial reconciliation skills.\\n\n\\n\n\\n\n\\n    Proficiency with Microsoft products, especially Access and Excel (charts, pivot tables, macros).\\n\n\\n\n\\n\n\\n    Validated organizational skills including expertise handling multiple priorities at a time and working under tight deadlines.\\n\n\\n\n\\n\n\\n    Strong research and analytical skills, attention to detail and the talent to effectively consolidate and report critical information.\\n\n\\n\n\\n\n\\n    Proven verbal and written communication skills.\\n\n\\n\n\\n\n\\n    Flexibility to work overtime as required (especially during quarter ends and proxy season).\\n\n\\n\n\\n\n\\n    Spanish communication skills are a plus.\\n\n\\n\n\\n\n\\n\n\\n  Shift: Monday – Friday 8:00am to 4:30pm\\n\n\\n\n\\n\n\\n\nCompensation:\nThe hourly rate for this position is $19.00 to $22.00 USD -Bonus Eligible.\n\\n\n\\n\n\\n\n\\n  Broadridge considers various factors when evaluating a candidate's final salary including, but not limited to, relevant experience, skills, and education.\\n\n\\n\n\\n\n\\n\nBenefits Information:\nPlease visit\n\\n\n\\n\nwww.broadridgebenefits.com\n\\n\nfor more information on our comprehensive benefit offerings.\n\\n\n\\n\n\\n\n\\n  We are dedicated to fostering a collaborative, engaging, and inclusive environment and are committed to providing a workplace that empowers associates to be authentic and bring their best to work. We believe that associates do their best when they feel safe, understood, and valued, and we work diligently and collaboratively to ensure Broadridge is a company—and ultimately a community—that recognizes and celebrates everyone’s unique perspective.\\n\n\\n\n\\n\n\\n  Use of AI in Hiring\\n\n\\n\n\\n  As part of the recruiting process, Broadridge may use technology, including artificial intelligence (AI)-based tools, to help review and evaluate applications. These tools are used only to support our recruiters and hiring managers, and all employment decisions include human review to ensure fairness, accuracy, and compliance with applicable laws. Please note that honesty and transparency are critical to our hiring process. Any attempt to falsify, misrepresent, or disguise information in an application, resume, assessment, or interview will result in disqualification from consideration.\\n\n\\n\n\\n\n\\n  US applicants: Click \\n\n\\n   here\\n\nto view the EEOC \"Know Your Rights\" poster.\\n\n\\n\n\\n\n\\n\nDisability Assistance\n\\n\n\\n\n\\n  We recognize that ensuring our long-term success means creating an environment where everyone is welcome, where everyone's strengths are valued, and where everyone can perform at their best. Broadridge provides equal employment opportunities to all associates and applicants for employment without regard to race, color, religion, sex (including sexual orientation, gender identity or expression, and pregnancy), marital status, national origin, ethnic origin, age, disability, genetic information, military or veteran status, and other protected characteristics protected by applicable federal, state, or local laws.\\n\n\\n\n\\n\n\\n  If you need assistance or would like to request reasonable accommodations during the application and/or hiring process, please contact us at 888-237-7769 or by sending an email to \\n\n\\n   BRcareers@broadridge.com\\n\n.\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=d0e6cb90ca31e203&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnfc72293c07e&spon=0&xkcb=SoBT67M3pvmyVWACJ70AbzkdCdPP&xfps=963b6a1d-faae-45aa-bc68-b9dd8c39f615&vjfrom=vjs&asub=mob&astse=d5c42090a243463c&assa=1727"
}