{
  "filename": "data_analyst_New_York__NY_page12_job8_Data_Support_Analyst__Internal.html",
  "job_title": "Data Support Analyst- Internal Medicine- 40/hrs, Day Shifts (Temple Faculty Practice)",
  "company": "Temple University Health System",
  "location": "Philadelphia, PA",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:26:17.105Z",
  "full_description": "\\n\nThe Data Analyst is responsible for reviewing charge errors coming into Centricity Business. This includes, but not limited to, interface error queues and Centricity Business Transaction Editing System. Under regular supervision, responsible for effectively developing and implementing various modifications and enhancements to the system interfaces and related process to assure the maximum level of improvements, benefits and user acceptability and data integrity. Analyzes errors, determines course of action and resolution of the error. Contacts appropriate resource to answer questions to resolve errors. Makes recommendations on resolving recurring errors or to improve the efficiency of the process. Plays a key role on new interface testing and in coordinating testing for any changes to the current interfaces.\n\\n\n\\n\nEducation\n\\n\n\\n\n\\n  Bachelors degree (Required)\\n\n\\n\n\\n  Relevant combination of education and experience may be considered in lieu of degree.\\n\n\\n\n\\n\n\\n\nExperience\n\\n\n\\n\n\\n  1 Year experience in a professional automated clinical and/or billing environment.(Required)\\n\n\\n\n\\n  General experience with Epic Electronic Medical Record, specifically with Bridges application, GE/IDX Practice Management system, Siemens Invision applications, Quest, Meditech and Lab corp. (Preferred)\\n\n\\n\n\\n\n\\n\nLocation: This will be onsite at Temple Hospital\n\\n\n\\n\n\\n\nSchedule: Monday- Friday, 8AM-5PM\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=a106c29273b6b30a&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoD567M3pv5_3dy4ax0DbzkdCdPP&xfps=9e708647-137f-4949-ae13-5716337800ae&vjfrom=vjs&asub=mob&astse=e92939cc523cc18f&assa=7516"
}