{
  "filename": "data_analyst_New_York__NY_page13_job6_Business_Analyst__GenAI___Enga.html",
  "job_title": "Business Analyst, GenAI & Engagement",
  "company": "Dow Jones",
  "location": "New York, NY 10176",
  "salary": "$65,000 - $80,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:27:52.382Z",
  "full_description": "\\n\nAbout the Team:\n\\n\nAt Dow Jones Newswires, we power the decisions of the most discerning financial professionals with timely, actionable content and data. As we deepen our use of machine content generation with machine learning and Generative AI, we seek a Business Analyst who can help us scale offerings for clients and partners in the financial services industry, through our use of automation, smarter content ingestion, and AI-enabled production. You'll play a vital role in contributing to the strategy, analyses and processes that transform raw into high-value intelligence for wealth managers, investors, asset managers and related use cases. The role will report to the Head of Newswires Business Management & Commercial Strategy, who is responsible for the successful execution of the Newswires go-to-market strategy.\n\\n\nAbout the Role\n\\n\nYou'll get to be at the nexus of world-renowned business journalism, content strategy, marketing, partnerships, operations, and AI, and helping shape next-gen news, analysis and data products for the B2B space. Reporting into the Head of Content Strategy, Newswires, you'll work with experienced content, business strategy and product teams in a collaborative ever-changing environment. Your impact will be direct as you help Newswires evolve into an even more vital offering for wealth managers and other professional consumers of market and business news and information. You will also have exposure to newsroom leadership and highly experienced industry professionals in a supportive environment, accelerating your professional growth in the areas of content, AI and financial media.\n\\n\nYou Will:\n\\n\n\\n\nAssist the Generative AI commercial owner and internal teams in the analysis and documentation of prospective client and partner deals.\n\\n\nConduct QA and compliance tests on output generated by partners and clients.\n\\n\nAssist with client engagement record keeping.\n\\n\nAssist with client and partner rollouts and certifications, including maintaining checklists for bespoke commercial engagements, as well as documenting and reporting on project milestones\n\\n\nAssist in gathering, analyzing and reporting on usage metrics.\n\\n\nManage the responses to customer feedback and customer service issues and directing them to closure.\n\\n\nAssist the Newswires business team in content and commercial strategy initiatives for a range of Dow Jones Newswires products.\n\\n\nAssist in the research, analysis, management and testing of new content and product features, often involving machine and AI generation\n\\n\nAssist the Newswires content and commercial strategy teams in identifying, reviewing and helping ingest new news, data and analysis content sets.\n\\n\nContribute to AI prompt writing, results testing, and research and development of new AI approaches, as Newswires creates tools, dataset and other content offerings for wealth managers.\n\\n\nContribute to content automation team in the creation and maintenance of machine language processes\n\\n\nContribute to the machine translation work overseen by the Newswires Content Strategy team\n\\n\n\\n\nYou Have:\n\\n\n\\n\n1-3 years experience\n\\n\nExperience with data analysis and using business intelligence tools like Tableau and spreadsheets.\n\\n\nExperience or demonstrable interest in leveraging large language models, generative content and automated content approaches in the content and media space.\n\\n\nDemonstrable analytical and research skills, with the ability to interpret, synthesize and distill information.\n\\n\nWork experience or related coursework in the generative AI, financial, investment, data science, human-computer interaction, and/or wealth management domains.\n\\n\nStrong attention to detail, organizational skills and commitment to high-quality output.\n\\n\nExcellent research, business analysis and communication skills and confidence to ask questions.\n\\n\nAbility to distill and explain ideas clearly and engage stakeholders.\n\\n\nAbility to work independently while collaborating fluidly across teams (news, product, engineering, events, education) and enjoy and thrive in a cross-functional environment\n\\n\nAptitude for thinking fluidly to solve problems, deflecting distraction and getting around obstacles\n\\n\nA strong ethical compass and respect for journalistic integrity, accuracy, and compliance.\n\\n\nMultilingual abilities beyond English a plus\n\\n\n\\n\nOur Benefits\n\\n\n\\n\nComprehensive Healthcare Plans\n\\n\nPaid Time Off\n\\n\nRetirement Plans\n\\n\nComprehensive Medical, Dental and Vision Insurance Plans\n\\n\nEducation Benefits\n\\n\nPaid Maternity and Paternity Leave\n\\n\nFamily Care Benefits\n\\n\nCommuter Transit Program\n\\n\nSubscription Discounts\n\\n\nEmployee Referral Program\n\\n\n\\n\nLearn more about all our US benefits\n\\n\nReasonable accommodation: Dow Jones, Making Careers Newsworthy - We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law. EEO/Disabled/Vets. Dow Jones is committed to providing reasonable accommodation for qualified individuals with disabilities, in our job application and/or interview process. If you need assistance or accommodation in completing your application, due to a disability, email us at talentresourceteam@dowjones.com. Please put \"Reasonable Accommodation\" in the subject line and provide a brief description of the type of assistance you need. This inbox will not be monitored for application status updates.\n\\n\nBusiness Area: Dow Jones - W&I - News & Insights\n\\n\nJob Category: Quality Management\n\\n\nUnion Status:\n\\n\nUnion role\n\\n\nPay Range: $65,000 - $80,000\n\\n\nWe recognize that attracting the best talent is key to our strategy and success as a company.As a result, we aim for flexibility in structuring competitive compensation offers to ensure we are able to attract the best candidates.The quoted salary range represents our good faith estimate as to what our ideal candidates are likely to expect, and we tailor our offers within the range based on the selected candidate's experience, industry knowledge, location, technical and communication skills, and other factors that may prove relevant during the interview process.\n\\n\nPay-for-performance is a key element in our strategy to attract, engage, and motivate talented people to do their best work. Similarly to salary, for bonus eligible roles, targets are set based on a variety of factors including competitive market practice.\n\\n\nFor benefits eligible roles, in addition to cash compensation, the company provides a comprehensive and highly competitive benefits package, with a variety of physical health, retirement and savings, caregiving, emotional wellbeing, transportation, and other benefits, including \"elective\" benefits employees may select to best fit the needs and personal situations of our diverse workforce..\n\\n\nSince 1882, Dow Jones has been finding new ways to bring information to the world’s top business entities. Beginning as a niche news agency in an obscure Wall Street basement, Dow Jones has grown to be a worldwide news and information powerhouse, with prestigious brands including The Wall Street Journal, Dow Jones Newswires, Factiva, Barron’s, MarketWatch and Financial News.\n\\n\nThis longevity and success is due to a relentless pursuit of accuracy, depth and innovation, enhanced by the wisdom of past experience and a solid grasp on the future ahead. More than its individual brands, Dow Jones is a modern gateway to intelligence, with innovative technology, advanced data feeds, integrated solutions, expert research, award-winning journalism and customizable apps and delivery systems to bring the information that matters most to customers, when and where they need it, every day.\n\\n\nReq ID: 50623\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=623d84202d1a5d87&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfovnurkuq78l9&spon=0&xkcb=SoDY67M3pv5w3QyMTJ0NbzkdCdPP&xfps=db1e7cc3-1cb9-4c26-8e78-e9cca3ffe0e2&vjfrom=vjs&asub=mob&astse=5681f73459513a94&assa=7456"
}