{
  "filename": "data_analyst_New_York__NY_page6_job3_Business_Analyst___Hybrid__PA.html",
  "job_title": "Business Analyst - Hybrid, PA",
  "company": "Ocean Blue Solutions",
  "location": "Philadelphia, PA•Hybrid work",
  "salary": null,
  "job_type": "Contract",
  "scraped_at": "2025-12-27T11:01:07.799Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\nBusiness Analyst - Hybrid, PA\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n3 months 15 days ago\n\\n\n\\n\n\\n\nphiladelphia,pennsylvania\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSubmission Due Date:\n09/12/2025\\n\n\\n\n\\n\nClient\n- State of PA\\n\n\\n\n\\n\nPosition is a hybrid, both on-site and remote.\n\\n\n\\n\n\\n\nREQUIREMENTS:\n\\n\n\\n\n\\n     The Business Analyst is responsible for the set of tasks and techniques used to work as a liaison among stakeholders in order to understand the structure, policies, and operations of an organization, and to recommend solutions that enable the organization to achieve its goals.\\n\n\\n\n\\n     Experience conducting Facilitated Workshops for requirements analysis.\\n\n\\n\n\\n     Experience creating workflows using formal notation such as the Business Process Modeling Notation (BPMN).\\n\n\\n\n\\n     Knowledge of formal requirements gathering methodologies.\\n\n\\n\n\\n     Experience developing Business Requirements - project initiation document, what the needed achievements will be, and the quality measures.\\n\n\\n\n\\n     Experience developing Functional requirements - describe what the system, process, or product/service must do in order to fulfill the business requirements.\\n\n\\n\n\\n     Experience developing User (stakeholder) requirements - are a very important part of the deliverables, the needs of the stakeholders will have to be correctly interpreted. This deliverable can also reflect how the product will be designed, developed, and define how test cases must be formulated.\\n\n\\n\n\\n     Experience developing Quality-of-service (non-functional) requirements - requirements that do not perform a specific function for the business requirement but are needed to support the functionality. For example: performance, scalability, quality of service (QoS), security and usability.\\n\n\\n\n\\n     Experience developing Report Specifications - define the purpose of a report, its justification, attributes and columns, owners and runtime parameters.\\n\n\\n\n\\n     Experience developing Requirements Traceability Matrix - a cross matrix for recording the requirements through each stage of the requirements gathering process.\\n\n\\n\n\\n     Strong organization and writing skills.\\n\n\\n\n\\n     Experienced developing graphic representations of complex business processes.\\n\n\\n\n\\n\nWork Location / Telework Policy:\n\\n\n\\n\n\\n     The selected candidate will be required to report to the office at least '1' day per month. There are some months that this in-office date will be identified for them due to Operational Needs, and other months based on candidate preference. (This 'minimum' requirement is also subject to change based on critical operational needs)\\n\n\\n\n\\n\nSKILLS AND EXPERIENCE REQUIREMENTS:\n\\n\n\\n\n\\n     Experience using formal requirements gathering methodologies\\n\n\\n\n\\n     Experience developing business, functional, and non-functional requirements\\n\n\\n\n\\n     Experience developing Requirements Traceability Matrix\\n\n\\n\n\\n     4 year college degree or equivalent\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=cbca18907c52befb&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnfc72293c07e&spon=0&xkcb=SoA067M3pvmyVWACJ70IbzkdCdPP&xfps=7e90e528-f018-4b80-b9c9-6ded352db72a&vjfrom=vjs&asub=mob&astse=d3aa6a8ac07cb5fc&assa=8218"
}