{
  "filename": "data_analyst_New_York__NY_page5_job12_Senior_Specialist_Client_Data_.html",
  "job_title": "Senior Specialist Client Data, Sales Analytics & AI",
  "company": "Deutsche Bank",
  "location": "New York, NY",
  "salary": "$82,000 - $143,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:00:26.243Z",
  "full_description": "\\n\n\\n\nSenior Specialist Client Data, Sales Analytics & AI\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob ID:\nR0396426\\n\n\\n\n\\n\nFull/Part-Time:\nFull-time\\n\n\\n\n\\n\n\\n\n\\n\nRegular/Temporary:\nRegular\\n\n\\n\n\\n\nListed:\n2025-09-30\\n\n\\n\n\\n\n\\n\n\\n\nLocation:\nNew York\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPosition Overview\n\\n\n\\n\nEmployer:\nDWS Group\n\\n\nTitle:\nSenior Client Data Specialist\n\\n\nLocation:\nNew York/Chicago\n\\n\nJob Code:\n#LI-LV2 #LI-02\n\\n\n\\n\nAbout DWS:\n\\n\nToday, markets face a whole new set of pressures – but also a whole lot of opportunity too. Opportunity to innovate differently. Opportunity to invest responsibly. And opportunity to make change.\n\\n\n\\n\nJoin us at DWS, and you can be part of an industry-leading firm with a global presence. You can lead ambitious opportunities and shape the future of investing. You can support our clients, local communities, and the environment.\n\\n\n\\n\nWe’re looking for creative thinkers and innovators to join us as the world continues to transform. As whole markets change, one thing remains clear; our people always work together to capture the opportunities of tomorrow. That’s why we are ‘Investors for a new now’.\n\\n\n\\n\nAs investors on behalf of our clients, it is our role to find investment solutions. Ensuring the best possible foundation for our clients’ financial future. And in return, we’ll give you the support and platform to develop new skills, make an impact and work alongside some of the industry’s greatest thought leaders. This is your chance to achieve your goals and lead an extraordinary career.\n\\n\n\\n\nThis is your chance to invest in your future.\n\\n\n\\n\nRead more about DWS and who we are here.\n\\n\n\\n\nTeam / Division Overview\n\\n\nThe Client Data Team is part of the Client Coverage Division. Its core task is the development of sales-relevant KPIs, dashboards, client segmentation and analysis, as well as the implementation of these within our Salesforce CRM processes in close collaboration with IT.\n\\n\n\\n\nRole Details\n\\n\nAs a/an Senior Client Data Specialist, you will (be):\n\\n\n\\n\nSupport US client facing staff make the best out of their time with data driven segmentation\n\\n\nCreate client focus lists and next best action recommendations\n\\n\nDrive the adoption of Sales KPIs and best practices in data management\n\\n\nCreate visualization strategy in order to provide actionable insights to sales and marketing teams\n\\n\nDevelop the US client segmentation strategy in the Wholesale business\n\\n\nCollaborate with the CRM team to reflect US needs in the Global data model\n\\n\nDevelop US specific dashboards, reports and analyses supported by Client Data team in India and the IT\n\\n\n\\n\n\\n\nWe are looking for:\n\\n\n\\n\nProfound understanding of the asset management industry, preferably in a B2B environment\n\\n\nUnderstanding of sales performance management and related KPIs\n\\n\nProficient in handling large and complex data sets\n\\n\nExperience in client facing role is a plus\n\\n\nUnderstanding of CRM concepts and best practices. Prior experience with Salesforce is a plus\n\\n\nConfidence in managing relationships with senior stakeholders\n\\n\nMust be detail-oriented and have an analytical mindset with the ability to deliver key insights through ‘out of the box’ thinking\n\\n\nBachelor’s degree required\n\\n\n\\n\n\\n\nLicense(s) required:\n\\n\n\\n\nN/A\n\\n\n\\n\n\\n\nWhat we’ll offer you:\n\\n\nAt DWS we’re serious about diversity, equity and creating an inclusive culture where colleagues can be themselves and it’s important to us that you enjoy coming to work - feeling healthy, happy and rewarded. At DWS, you’ll have access to a range of benefits which you can choose from to create a personalized plan unique to your lifestyle. Whether you’re interested in healthcare, company perks, or are thinking about your retirement plan, there’s something for everyone.\n\\n\n\\n\nThe salary range for this position in New York is $82,000 to $143,000. Actual salaries may be based on a number of factors including, but not limited to, a candidate’s skill set, experience, education, work location and other qualifications. Posted salary ranges do not include incentive compensation or any other type of renumeration.\n\\n\n\\n\nAt DWS, we recognize that our benefit programs have a profound impact on our colleagues. That’s why we are focused on providing benefits and perks that enable our colleagues to live authentically and be their whole selves, at every stage of life. We provide access to physical, emotional, and financial wellness benefits that allow our colleagues to stay financially secure and strike balance between work and home. Click here to learn more!\n\\n\n\\n\nDWS’ Hybrid Working model is designed to find the right balance between in-person collaboration and engagement in the office, which is core to our working culture, and working from home. Each business group varies on the split between time spent in the office and at home, but this will be discussed and made clear as part of your application and interview process. We will continue to review and evolve our working environments and methods to ensure that we are working in the best way possible for our people.\n\\n\n\\n\nIf you require any adjustments or changes to be made to the interview process for any reason including, or related to a disability or long-term health condition, then please contact your recruiter and let them know what assistance you may need. Examples of adjustments include providing a change to the format of the interview or providing assistance when at the DWS office. This will not affect your application and your recruitment team will discuss options with you.\n\\n\n\\n\nPrivacy Statement\n\\n\nThe California Consumer Privacy Act outlines how companies can use personal information. Click here to view DWS’ Privacy Notice.\n\\n\n\\n\nWe strive for a culture in which we are empowered to excel together every day. This includes acting responsibly, thinking commercially, taking initiative and working collaboratively.\nTogether we share and celebrate the successes of our people. Together we are Deutsche Bank Group.\nWe welcome applications from all people and promote a positive, fair and inclusive work environment.\nQualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status or other characteristics protected by law. Click these links to view \"Deutsche Bank’s Equal Opportunity Policy Statement\" and the following notices: \"EEOC Know Your Rights\" ; \"Employee Rights and Responsibilities under the Family and Medical Leave Act\" ; and \"Employee Polygraph Protection Act\" .\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=66030cb3f4697e9f&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnbj48jn1a803&spon=0&xkcb=SoCp67M3pvmhsM20BR0HbzkdCdPP&xfps=e49c0006-6468-4338-a24d-38ed4d549844&vjfrom=vjs&asub=mob&astse=f1b05e871ba32edb&assa=6591"
}