{
  "filename": "data_analyst_New_York__NY_page11_job9_Data_Analyst__Work_Order_Manag.html",
  "job_title": "Data Analyst [Work Order Management System] - DA 25-34631",
  "company": "NavitsPartners",
  "location": "Jersey City, NJ",
  "salary": "$25 - $28 an hour",
  "job_type": null,
  "scraped_at": "2025-12-27T11:24:11.795Z",
  "full_description": "\\n\nJob Title: Data Analyst\n\\n\nJob Location:\nHackensack, NJ\nAssignment Duration:\n4 months\n\\n\n\\n\nPosition Overview\n\\n\nUnder the direction of the Program Manager, the Data Analyst will support work order management and data review activities. This role focuses on analyzing information from multiple electronic sources to determine the status and closure of work orders within a centralized management system.\n\\n\n\\n\nKey Responsibilities\n\\n\n\\n\nReview and close work orders within a work order management system using existing documentation\n\\n\nCompare and validate data from multiple electronic sources to determine whether work orders can or should be closed\n\\n\nTrack and analyze lead work activities using spreadsheet tools\n\\n\nUtilize company-approved electronic systems and applications, including work order management tools, GIS platforms, and productivity software\n\\n\nMaintain accurate records with a high level of attention to detail\n\\n\nManage multiple tasks simultaneously while meeting deadlines\n\\n\n\\n\n\\n\nRequired Qualifications\n\\n\n\\n\nStrong experience using\nGoogle Sheets or similar applications (e.g., Microsoft Excel)\n\\n\n\\n\nAbility to build and use formulas such as\nCOUNTIF, SUMIF\n, and similar functions\n\\n\n\\n\nHigh attention to detail and strong analytical skills\n\\n\nExcellent organizational, computer, and interpersonal abilities\n\\n\nAbility to work both independently and collaboratively in a team environment\n\\n\nStrong verbal and written communication skills\n\\n\nEffective time-management skills with the ability to prioritize competing tasks\n\\n\n\\n\n\\n\nPreferred Qualifications\n\\n\n\\n\nExperience with\nwork order management systems\n(HexaGon experience preferred but not required)\n\\n\nESRI / GIS experience\nis a plus\n\\n\n\\n\nFor more details reach at\nvgill@navitassols.com\nor Call / Text at\n516-862-1203\n.\n\\n\nAbout Navitas Partners, LLC:\nIt is a certified WBENC and one of the fastest-growing\nTechnical / IT\nstaffing firms in the US providing services to numerous clients. We offer the most competitive pay for every position. We understand this is a partnership. You will not be blindsided and your salary will be discussed upfront.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}