{
  "filename": "data_analyst_New_York__NY_page12_job10_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "DEPARTMENT FOR THE AGING",
  "location": "2 Lafayette St, Manhattan, NY 10007",
  "salary": "$72,190 - $79,410 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:26:32.975Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nData Analyst\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDEPARTMENT FOR THE AGING\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted On: 11/13/2025\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nFull-Time\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Location\\n\n\\n\n\\n          MANHATTAN\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nNo Exam Required\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n           Department\\n\n\\n\n\\n           DATA ANALYSIS & REPORTING\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Salary Range:\\n\n\\n\n\\n          $72,190.00 – $79,410.00\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Description\n\\n\n\\n\n\\n\n\\n\n\\n      With an overarching mission to eliminate ageism and ensure the dignity and quality of life of approximately 1.8 million older New Yorkers, the NYC Department for the Aging is deeply committed to helping older adults age in their homes and creating a community-care approach that reflects a model age-inclusive city.\nThe New York City Department for the Aging (NYC Aging) is a local government agency as well as the largest Area Agency on Aging (AAA) in the United States. The Department administers and promotes the development and provision of accessible services for older persons and serves as an advocate on legislative and policy issues. NYC Aging’s mission is to work for the empowerment, independence, dignity, and quality of life of New York City’s diverse older adults and for the support of their families through advocacy, education, and the coordination and delivery of services.\nBureau of Planning and Strategic Initiatives (PSI) is a planning, research, and data analysis arm of NYC Aging. Under the leadership of the PSI’s Office of Planning and Analytics, the Data Analytics Unit (DAU) plays a key role in support of NYC Aging’s data and technology modernization efforts and is the unit responsible for producing a wide range of data reports and special analyses that enable the NYC Aging, its providers, and its oversight agencies to track progress in delivering services to older New Yorkers, as well as plan for the future of Aging Services.\nThe Data Analyst will play a crucial part in the maintaining, developing, and designing data reports to aid in provider monitoring and decision-making, and assisting in data extraction, cleaning, and validation processes. Additionally, the Data Analyst will conduct in-depth analyses of NYC Aging programs, synthesizing complex information into presentations and reports tailored for various audiences. Strong written and verbal communication skills are paramount for success in this role, as the Data Analyst will be required to effectively communicate intricate findings to diverse stakeholders.\nAs a member of the DAU team, the Data Analyst will actively work with program staff, senior staff, and external partners to effectively collect, pull, and analyze data to track service provision, and support the development of new data driven programs and policies that enable older New Yorkers to remain active and vibrant in their communities, or safely supported at home. This position requires someone who is comfortable working in a dynamic and fast-paced environment. The Data Analyst’s responsibilities include, but are not limited to:\n\\n\n\\n\nUse different coding and/or programming platforms, including the use of data management software such as SQL, Tableau, Python, etc., to accurately pull data from NYC Aging’s data sources.\n\\n\nClean, validate, and reconcile data to ensure accuracy and consistency.\n\\n\nImplement data quality checks and processes to maintain data integrity.\n\\n\nWork on analytical projects aimed at enhancing aging services.\n\\n\nRespond to requests for information on programs and services.\n\\n\nGenerate reports and analyses to address specific inquiries or support program evaluation efforts.\n\\n\nProvide reports, charts, graphs, maps and data models into presentations for internal and external distribution.\n\\n\n\\n\n\\n\nNon-City rate (Non-City candidates & candidates with less than 2 years of City Service)\n\\n\n**City incumbent rate (Candidates with 2 or more active years of City Service\nCITY RESEARCH SCIENTIST - 21744\\n\n\\n\nMinimum Qualifications\n\\n\n1. For Assignment Level I (only physical, biological and environmental sciences and public health) A master's degree from an accredited college or university with a specialization in an appropriate field of physical, biological or environmental science or in public health.\nTo be appointed to Assignment Level II and above, candidates must have:\n1. A doctorate degree from an accredited college or university with specialization in an appropriate field of physical, biological, environmental or social science and one year of full-time experience in a responsible supervisory, administrative or research capacity in the appropriate field of specialization; or\n2. A master's degree from an accredited college or university with specialization in an appropriate field of physical, biological, environmental or social science and three years of responsible full-time research experience in the appropriate field of specialization; or\n3. Education and/or experience which is equivalent to \"1\" or \"2\" above. However, all candidates must have at least a master's degree in an appropriate field of specialization and at least two years of experience described in \"2\" above. Two years as a City Research Scientist Level I can be substituted for the experience required in \"1\" and \"2\" above.\nNOTE:\nProbationary Period\nAppointments to this position are subject to a minimum probationary period of one year.\n\\n\nPreferred Skills\nStrong coding and/or programming platform knowledge preferred. Use of data management software such as SQL, Tableau, Python, etc. a plus.\n\\n\nPublic Service Loan Forgiveness\nAs a prospective employee of the City of New York, you may be eligible for federal loan forgiveness programs and state repayment assistance programs. For more information, please visit the U.S. Department of Education’s website at https://studentaid.gov/pslf/.\n\\n\nResidency Requirement\nNew York City residency is generally required within 90 days of appointment. However, City Employees in certain titles who have worked for the City for 2 continuous years may also be eligible to reside in Nassau, Suffolk, Putnam, Westchester, Rockland, or Orange County. To determine if the residency requirement applies to you, please discuss with the agency representative at the time of interview.\n\\n\nAdditional Information\n\\n\n\\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n        Job ID\\n\n\\n\n\\n        706585\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted until\\n\n\\n\n\\n         05/11/2026\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title code\\n\n\\n\n\\n         21744\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Civil service title\\n\n\\n\n\\n         CITY RESEARCH SCIENTIST\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title classification\\n\n\\n\n\\n         Non-Competitive-5\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Business title\\n\n\\n\n\\n         Data Analyst\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Experience Level:\\n\nExperienced (Non-Manager)\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Job level\\n\n\\n\n\\n         01\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Number of positions\\n\n\\n\n\\n         1\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Work location\\n\n\\n\n\\n         2 Lafayette St., N.Y.\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Category:\\n\nPolicy, Research & Analysis\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n      Data Analyst\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=a6b635022080512e&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoDQ67M3pv5_3dy4ax0BbzkdCdPP&xfps=a61d2e8b-110e-4396-9b86-6727bb032c22&vjfrom=vjs&asub=mob&astse=0aecc500c85c39b5&assa=3433"
}