{
  "filename": "data_analyst_New_York__NY_page1_job12_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "Artitech",
  "location": "Brooklyn, NY 11213",
  "salary": "$84,591.26 - $101,873.34 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:53:16.830Z",
  "full_description": "Job Summary\nWe are seeking a detail-oriented and analytical Business Analyst to join our team. The ideal candidate will play a critical role in bridging the gap between business needs and technology solutions by analyzing data, designing processes, and supporting project initiatives. This position offers an exciting opportunity to work with a variety of data tools and methodologies, including Tableau, Power BI, Looker, and ETL processes. The Business Analyst will collaborate with cross-functional teams to deliver actionable insights and drive strategic decision-making.\n\\n\nResponsibilities\n\\n\n\\n\nGather, analyze, and document business requirements to support project development and process improvements.\n\\n\nDevelop dashboards, reports, and visualizations using Tableau, Power BI, and Looker to communicate key insights effectively.\n\\n\nSupport Agile project management methodologies by participating in sprint planning, stand-ups, and retrospectives.\n\\n\nDesign and optimize databases using Microsoft SQL Server, Oracle, and database design principles to ensure data integrity and efficiency.\n\\n\nPerform data analysis using SQL, R, Python, VBA, Bash (Unix shell), and Talend for data extraction, transformation (ETL), and loading processes.\n\\n\nCollaborate with technical teams on SDLC (Software Development Life Cycle) activities to ensure successful project delivery.\n\\n\nConduct business analysis activities including process modeling with Visio and defining data requirements for linked data initiatives.\n\\n\nAssist in project management tasks such as timeline tracking, risk assessment, and stakeholder communication.\n\\n\nStay current with industry trends in analytics tools and techniques to recommend innovative solutions for business challenges.\n\\n\n\\n\nExperience\n\\n\n\\n\nProven experience as a Business Analyst or similar role with a strong understanding of data analysis skills.\n\\n\nHands-on experience with Tableau, Power BI, Looker, or other visualization tools.\n\\n\nFamiliarity with Agile methodologies and project management practices.\n\\n\nStrong knowledge of SDLC processes for software development projects.\n\\n\nProficiency in SQL Server, Oracle databases, and database design principles.\n\\n\nExperience working with ETL tools such as Talend or similar platforms.\n\\n\nProgramming skills in R, Python, VBA, Bash (Unix shell) are highly desirable.\n\\n\nKnowledge of Linked Data concepts and analytics techniques is a plus.\n\\n\nExcellent analysis skills combined with the ability to communicate complex findings clearly to stakeholders. This role is ideal for candidates passionate about leveraging data analytics to influence business decisions while working within a dynamic team environment that values innovation and continuous learning.\n\\n\n\\n\nJob Type: Full-time\n\\n\nPay: $84,591.26 - $101,873.34 per year\n\\n\nBenefits:\n\\n\n\\n\n401(k)\n\\n\nDental insurance\n\\n\nHealth insurance\n\\n\nPaid holidays\n\\n\nPaid time off\n\\n\nTuition reimbursement\n\\n\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}