{
  "filename": "data_analyst_New_York__NY_page1_job13_Process_and_Data_Solutions_Ana.html",
  "job_title": "Process and Data Solutions Analyst",
  "company": "WisEngineering",
  "location": "Dover, NJ",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:53:27.068Z",
  "full_description": "WisEngineering is seeking a highly motivated and experienced Process and Data Solutions Analyst to drive digital transformation and operational efficiency for our government customer. The ideal candidate will possess a strategic mindset for process optimization combined with deep technical skills in the Microsoft 365 Enterprise ecosystem, particularly the Power Platform. This role requires managing sensitive government data (CUI, PII, PHI) and includes secondary responsibilities in simple IT support.\nKey Responsibilities\n1. Strategic Optimization and Knowledge Management (40%)\n•\nProcess Analysis:\nEvaluate current workforce strategies and existing business processes to identify gaps, inefficiencies, and opportunities for automation and optimization.\n•\nStrategy Development:\nDesign and recommend data-driven strategies to improve overall organizational efficiency and workflow performance.\n•\nKnowledge Management:\nDevelop and implement effective knowledge management systems (KMS) and organizational structures within SharePoint and Microsoft Teams to enhance collaboration and information sharing across the organization.\n2. Digital Workflow Automation and App Development (40%)\n•\nSolution Design:\nDevelop, deploy, and maintain custom solutions—including automated workflows and data-driven tools—to replace manual processes (e.g., status reporting, credit card approvals, data collection).\n•\nPower Platform Expertise:\nUtilize the Microsoft Power Platform to build solutions:\n•\nDeveloping business applications using Power Apps (Canvas and Model-Driven).\n•\nCreating complex, multi-step automated processes using Power Automate (Flow).\n•\nData Architecture:\nRe-organize and consolidate numerous disparate data sources into a more coherent and sustainable data store architecture (leveraging SharePoint Lists or Dataverse).\n3. Data-Driven Decision Making (10%)\n•\nReporting & Analytics:\nDevelop interactive reports, visualizations, and dashboards using Power BI to enable data-driven decision-making across leadership and operational teams.\n•\nData Modeling:\nPerform data modeling and transformation within Power BI to ensure accuracy, coherence, and integrity of key performance indicators (KPIs).\n4. System Administration & IT Support (10%)\n•\nAct as the primary point of contact for simple Tier 1 IT issues and hardware lifecycle management.\n•\nSet up, image, and issue new IT equipment (laptops, peripherals).\n•\nObtain and utilize required authorities (e.g., local admin rights) to handle simple technical tasks such as software installation, driver installation, and basic troubleshooting.\n•\nAssist with user access issues, including password resets.\nRequired Qualifications and Skills\n•\nProven experience developing and deploying solutions using Microsoft Power Apps, Power Automate, and Power BI.\n•\nStrong understanding of Microsoft SharePoint architecture for content and data management.\n•\nDemonstrated ability to perform business process analysis, requirements gathering, and strategic planning.\n•\nMust be 'clearable' and able to handle Controlled Unclassified Information (CUI), Personally Identifiable Information (PII), and Protected Health Information (PHI) in compliance with government regulations.\nHighly Desired Qualifications (Plus Factors)\n•\nPrior experience with government systems for time tracking, financial management, or other federal/state internal applications.\n•\nExperience with basic system administration tasks (imaging, software deployment, Tier 1 help desk support).\nWisEngineering features competitive salaries, comprehensive benefits, and an excellent career-building atmosphere. We work on a wide range of projects that are sure to capture your passion while providing the challenge of developing cutting-edge technologies. As a member of our team, we will provide on-the-job training and a smooth transition into your new position. WisEngineering is an Equal Opportunity/Affirmative Action Employer.\nTo perform a job successfully with WisE, LLC and it's business customers, an individual must be able to perform each essential job duty satisfactorily. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform essential job functions.",
  "apply_method": "indeed_apply",
  "apply_url": null
}