{
  "filename": "data_analyst_New_York__NY_page14_job3_Analyst_Associate__Business_Su.html",
  "job_title": "Analyst/Associate, Business Support – Sales & Trading / Treasury (Bilingual Japanese-English)",
  "company": "MUFG Bank, Ltd.",
  "location": "New York, NY 10020•Hybrid work",
  "salary": "$69,000 - $100,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:29:30.209Z",
  "full_description": "\\n\nDo you want your voice heard and your actions to count?\n\\n\n\\n\nDiscover your opportunity with Mitsubishi UFJ Financial Group (MUFG), one of the world’s leading financial groups. Across the globe, we’re 150,000 colleagues, striving to make a difference for every client, organization, and community we serve. We stand for our values, building long-term relationships, serving society, and fostering shared and sustainable growth for a better world.\n\\n\n\\n\nWith a vision to be the world’s most trusted financial group, it’s part of our culture to put people first, listen to new and diverse ideas and collaborate toward greater innovation, speed and agility. This means investing in talent, technologies, and tools that empower you to own your career.\n\\n\n\\n\nJoin MUFG, where being inspired is expected and making a meaningful impact is rewarded.\n\\n\nThe selected colleague will work at an MUFG office or client sites four days per week and work remotely one day. A member of our recruitment team will provide more details.\\n\n\\n\nSummary:\nJoin a leading financial services firm as an entry-level\nBusiness Support Analyst\nin our front office\nSales & Trading and Treasury team\n. This role provides\noperational support\n,\nonboarding coordination\n, and\nKPI reporting\nfor front office Sales & Trading, Treasury staffs including expats from our Head Office (Japan). Ideal for candidates seeking exposure to dynamic\nglobal markets\nand complex\nfinancial operations\n, and\nglobal &\ncross-functional collaboration\n.\n\\n\nResponsibilities:\n\\n\n\\n\nSupport\nSales, Trading, and Treasury staffs\nonboarding by collaborating IT and facilities (desk set up, Bloomberg terminal, market data access, shared drive permissions, etc.).\n\\n\nMaintain business unit specific\nHR information\n,\ndelegation of authority forms\n, and cross-entity assignments and liaise with legal and compliance team\n\\n\nProduce predefined desk\nKPI reports\nperiodically\n\\n\nTrack and process staff expenses and vendor invoices by working with Finance and Account Payable\n\\n\nHelp to\narrange & facilitate\nmid-large sized meetings in person / remote\n\\n\nCoordinate with\nIT, HR, Compliance\n,\nFinance\nand other internal teams for ad hoc inquiry from\nSales & Trading and Treasury team\nand Head office\n\\n\nProvide\nbilingual Japanese-English communication support\n, including document translation and meeting assistance.\n\\n\n\\n\nQualifications:\n\\n\n\\n\nBachelor’s degree in\nfinance, Business, Economics\n, or related field\n\\n\nFluency in Japanese and English\n(verbal and written)\n\\n\nStrong communication skills to facilitate troubleshooting and meticulous follow-up with stakeholders\n\\n\nStrong desktop work skills and proficiency in\nMicrosoft Excel, Word, PowerPoint\n,\nTeams\nand\nCopilot\n\\n\nMutli-tasking, self-disciplined step by step task management / execution skills\n\\n\n\\n\nPreferred Qualifications\n\\n\n\\n\nFamiliarity with financial markets, trading systems, or treasury operations.\n\\n\nPrior internship or experience in financial services (Global Bank / Sales & Trading / Broker-Dealer) is a plus (but not mandatory)\n\\n\n\\n\n\\n\nThe typical base pay range for this role is between $69K - $100K depending on job-related knowledge, skills, experience and location. This role may also be eligible for certain discretionary performance-based bonus and/or incentive compensation. Additionally, our Total Rewards program provides colleagues with a competitive benefits package (in accordance with the eligibility requirements and respective terms of each) that includes comprehensive health and wellness benefits, retirement plans, educational assistance and training programs, income replacement for qualified employees with disabilities, paid maternity and parental bonding leave, and paid vacation, sick days, and holidays. For more information on our Total Rewards package, please click the link below.\n\\n\nMUFG Benefits Summary\n\\n\nWe will consider for employment all qualified applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws (including (i) the San Francisco Fair Chance Ordinance, (ii) the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance, (iii) the Los Angeles County Fair Chance Ordinance, and (iv) the California Fair Chance Act) to the extent that (a) an applicant is not subject to a statutory disqualification pursuant to Section 3(a)(39) of the Securities and Exchange Act of 1934 or Section 8a(2) or 8a(3) of the Commodity Exchange Act, and (b) they do not conflict with the background screening requirements of the Financial Industry Regulatory Authority (FINRA) and the National Futures Association (NFA). The major responsibilities listed above are the material job duties of this role for which the Company reasonably believes that criminal history may have a direct, adverse and negative relationship potentially resulting in the withdrawal of conditional offer of employment, if any.\\n\nThe above statements are intended to describe the general nature and level of work being performed. They are not intended to be construed as an exhaustive list of all responsibilities duties and skills required of personnel so classified.\\n\nWe are proud to be an Equal Opportunity Employer and committed to leveraging the diverse backgrounds, perspectives and experience of our workforce to create opportunities for our colleagues and our business. We do not discriminate on the basis of race, color, national origin, religion, gender expression, gender identity, sex, age, ancestry, marital status, protected veteran and military status, disability, medical condition, sexual orientation, genetic information, or any other status of an individual or that individual’s associates or relatives that is protected under applicable federal, state, or local law.\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=142c731b18f1f59f&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfp3d75l0258c6&spon=0&xkcb=SoD-67M3pv6CdcW0BR0IbzkdCdPP&xfps=2ae960e1-33b7-4bf0-89bb-3f178bac4532&vjfrom=vjs&asub=mob&astse=7459ad452cdaad1a&assa=5500"
}