{
  "filename": "data_analyst_Houston__TX_page2_job10_Tubular_Analyst.html",
  "job_title": "Tubular Analyst",
  "company": "Precision Drilling Corporation",
  "location": "14041 Vickery Drive, Houston, TX 77032",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:46:44.856Z",
  "full_description": "\\n\n\\n\n\\n\nCompany: Precision Drilling\n\\n\nLocation: 14041 Vickery Dr., Houston, TX 77032\n\\n\nWork Arrangements: On-Site (Monday-Friday)\n\\n\n\\n\nAt Precision Drilling, our mission is to deliver safe, sustainable, and high-performance drilling solutions that reduce risks and optimize resources for our customers across global markets. Driven by our Core Values, we empower our people, invest in cutting-edge technology, and foster lasting relationships built on integrity, collaboration, and an unwavering pursuit of excellence.\n\\n\n\\n\nCULTURE:\n\\n\nPrecision Drilling promotes a strong safety culture through our \"Target Zero\" initiative, emphasizing employee well-being and environmental responsibility. We support career growth through robust training and development, encouraging innovation and collaboration. With competitive benefits, a casual work environment, generous time-off policies, and a culture grounded in respect and integrity, we create a workplace where people feel empowered and valued.\n\\n\n\\n\nDAY IN THE LIFE:\n\\n\n\\n\nStandardize and oversee drill pipe management, including inspections, repairs, transportation, inventory control, and asset integrity\n\\n\nMaintain accurate drill pipe data in SAP and asset systems; provide user training and support\n\\n\nCoordinate drill pipe inventory, scheduling, and movement across rigs and storage locations to meet operational needs\n\\n\nCollaborate with Rig Managers, Field Superintendents, Billing, Sales, and Tubular teams to share data, technical details, and wear calculations\n\\n\nPerform administrative, analytical, and continuous improvement activities, including invoicing/POs, data analysis, and 24-hour on-call support\n\\n\n\\n\n\\n\nWHAT WE NEED FROM YOU:\n\\n\n\\n\nUniversity/college degree or equivalent experience; technical diploma considered an asset\n\\n\nStrong communication and collaboration skills, with the ability to clearly present findings verbally and in writing\n\\n\nHigh attention to detail with a focus on data accuracy, integrity, and well-documented processes\n\\n\nStrong problem-solving, organizational, and time-management skills; self-motivated and adaptable\n\\n\nIntermediate to advanced Microsoft Excel proficiency and a commitment to continuous process and reporting improvement\n\\n\n\\n\n\\n\nDrive your career forward with Precision Drilling—apply today and take the lead in shaping the future of energy with a company that values safety, performance, and your potential.\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=306d97320ee9ab92&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfmissbl03785n&spon=0&xkcb=SoD-67M3pvlEerygL50BbzkdCdPP&xfps=cf520903-0fe4-41d8-ad81-733c49ce42ce&vjfrom=vjs&asub=mob&astse=2da15b2e7faa13f2&assa=5167"
}