{
  "filename": "data_analyst_New_York__NY_page6_job13_Power_Analyst.html",
  "job_title": "Power Analyst",
  "company": "Susquehanna International Group",
  "location": "Bala-Cynwyd, PA",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T11:02:41.753Z",
  "full_description": "\\n\n\\n\n\\n   Susquehanna’s energy and power trading is informed by a strong fundamental understanding of supply, demand, and transmission. As an analyst on our Energy desk, you will analyze data and look for ways to optimize processes that will help drive business decisions. You will analyze information and datasets to improve Susquehanna’s modeling and understanding the United States power grid.\\n\n\\n\n\\n\n\\n\nWhat You'll Do\\n\n\\n\n\\n\nMaintain internal data systems to standardize our historical and forecasted fundamental data involving electricity supply, demand, and transmission.\n\\n\nAnalyze historical transmission and price data in our power mapping software.\n\\n\nUtilize data findings to highlight geographic patterns to help inform energy forecasts.\n\\n\nCompare different electricity topologies to identify differences that could lead to divergence between nodal costs and payoffs.\n\\n\nWhat we're looking for\n\\n\n\\n\nBachelor's degree required; specialization in Electrical Engineering or a related discipline a plus.\n\\n\nCreative problem solving and intellectual curiosity about electricity markets and fundamentals.\n\\n\nStrong communication skills; ability to interact effectively with all levels of the organization.\n\\n\nAbility to work as part of a team while having the confidence to act autonomously.\n\\n\nStrong attention to detail; ability to complete data entry and mapping.\n\\n\nExperience with VBA, SQL and/or scripting (i.e. Python) preferred.\n\\n\n\\n\n\\n\n\\n\nAbout Susquehanna\\n\n\\n\n\\n   Susquehanna is a global quantitative trading firm powered by scientific rigor, curiosity, and innovation. Our culture is intellectually driven and highly collaborative, bringing together researchers, engineers, and traders to design and deploy impactful strategies in our systematic trading environment. To meet the unique challenges of global markets, Susquehanna applies machine learning and advanced quantitative research to vast datasets in order to uncover actionable insights and build effective strategies. By uniting deep market expertise with cutting-edge technology, we excel in solving complex problems and pushing boundaries together.\\n\n\\n\n\\n\n\\n\nIf you're a recruiting agency and want to partner with us, please reach out to recruiting@sig.com. Any resume or referral submitted in the absence of a signed agreement will not be eligible for an agency fee.\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=6e7b2584fe7eeba8&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnfc72293c07e&spon=0&xkcb=SoBp67M3pvmyVWACJ70GbzkdCdPP&xfps=a944e216-9e3e-4c2a-83ad-8caa420e3091&vjfrom=vjs&asub=mob&astse=07ec672c268f3c10&assa=2165"
}