{
  "filename": "data_analyst_New_York__NY_page11_job14_Lead_Capital_Program_Analyst.html",
  "job_title": "Lead Capital Program Analyst",
  "company": "DEPARTMENT OF TRANSPORTATION",
  "location": "55 Water Street, Manhattan, NY 10004",
  "salary": "$62,868 - $97,593 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:24:59.614Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nLead Capital Program Analyst\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDEPARTMENT OF TRANSPORTATION\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted On: 12/19/2025\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nFull-Time\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Location\\n\n\\n\n\\n          MANHATTAN\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nNo Exam Required\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n           Department\\n\n\\n\n\\n           Roadsway Capital Proj Mgmt\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Salary Range:\\n\n\\n\n\\n          $62,868.00 – $97,593.00\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Description\n\\n\n\\n\n\\n\n\\n\nServes as a Lead Capital Program Analyst in the roadway Capital Planning & Initiation (CPI) unit, within the division of Budget and Capital Program Management (BCPM). Reporting to one of the CPI Assistant Directors, and in collaboration with the CPI Director and other staff members in BCPM, leads the tracking and funding of Capital projects, reviews and maintains the Street Reconstruction capital budget, and prepares all materials needed for DOT’s Capital Street Reconstruction Plan budget submissions. Coordinates with DOT Intergovernmental Affairs, Borough Commissioners, Capital Budget, Grants, and other teams on the application and solicitation of discretionary funding such as Reso A, Competitive Grants, and Federal Earmarks.\nAnalyzes the needs of the CPI/BCPM team and program, making recommendations on process improvements and procedures, including but not limited to Capital project funding priorities, Capital project and Capital Street Reconstruction Plan evaluation metrics, and capital project funding solicitation. Serves as BCPM IT Governance Liaison and provides data and analysis in support of CPI/BCPM’s portfolio. Designs, builds, and maintains data pipelines for complex data sets, ensuring high data quality and legibility.\nPerforms transportation/project planning and coordination work – both internal and external – for DOT funded street reconstruction projects. Supports an effective capital program by developing, evaluating and prioritizing requests for projects in coordination with community members, agency project sponsors and other stakeholders. Prepares reports, performs analyses, and reviews traffic studies, program plans, funding, and performance. Manages and develops various prep materials, presentations, spreadsheets and annual reports. In place of the CPI Director, and Executive Director, step in to lead conversations on Rezonings and Greenways.\nCOMMUNITY COORDINATOR - 56058\n\\n\nMinimum Qualifications\n\\n\n1. A baccalaureate degree from an accredited college and two years of experience in community work or community centered activities in an area related to the duties described above; or\n2. High school graduation or equivalent and six years of experience in community work or community centered activities in an area related to the duties as described above; or\n3. Education and/or experience which is equivalent to \"1\" or \"2\" above. However, all candidates must have at least one year of experience as described in \"1\" above.\n\\n\nPreferred Skills\nDetail oriented, collaborative and possess a commitment to ensuring both traffic safety, good asset management, resiliency, and sustainability on city streets. Familiarity with the Microsoft Office suite, GIS, Python, SQL, and Microsoft Access is necessary, AutoCAD and Adobe Creative Suite is a plus. Excellent writing and strong organizational skills.\n\\n\nPublic Service Loan Forgiveness\nAs a prospective employee of the City of New York, you may be eligible for federal loan forgiveness programs and state repayment assistance programs. For more information, please visit the U.S. Department of Education’s website at https://studentaid.gov/pslf/.\n\\n\nResidency Requirement\nNew York City residency is generally required within 90 days of appointment. However, City Employees in certain titles who have worked for the City for 2 continuous years may also be eligible to reside in Nassau, Suffolk, Putnam, Westchester, Rockland, or Orange County. To determine if the residency requirement applies to you, please discuss with the agency representative at the time of interview.\n\\n\nAdditional Information\n\\n\n\\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n        Job ID\\n\n\\n\n\\n        762336\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted until\\n\n\\n\n\\n         12/31/2025\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title code\\n\n\\n\n\\n         56058\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Civil service title\\n\n\\n\n\\n         COMMUNITY COORDINATOR\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title classification\\n\n\\n\n\\n         Non-Competitive-5\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Business title\\n\n\\n\n\\n         Lead Capital Program Analyst\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Experience Level:\\n\nExperienced (Non-Manager)\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Job level\\n\n\\n\n\\n         00\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Number of positions\\n\n\\n\n\\n         1\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Work location\\n\n\\n\n\\n         55 Water St Ny Ny\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Category:\\n\nEngineering, Architecture, & Planning\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n      Lead Capital Program Analyst\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=24bb96f3f45e4010&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfonhnakuq7821&spon=0&xkcb=SoDw67M3pv5R5RSC4J0FbzkdCdPP&xfps=2dc8f1ef-c4bc-40f6-bb07-efbb925f8663&vjfrom=vjs&asub=mob&astse=10f96d6af0daabbb&assa=9998"
}