{
  "filename": "data_analyst_New_York__NY_page8_job9_Clinical_Business_Analyst___Le.html",
  "job_title": "Clinical Business Analyst - Level III",
  "company": "NYC Health + Hospitals",
  "location": "New York, NY",
  "salary": "$88,555 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:16:52.952Z",
  "full_description": "\\n\n\\n\n\\n\nAbout NYC Health + Hospitals\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSince 1875, South Brooklyn Health has established its reputation for clinical excellence and culturally competent care. It has designations as a Certified Percutaneous Coronary Intervention (PCI) Center, an Advanced Primary Stroke Center, an accredited Baby-Friendly Hospital, a U.S. News & World Report high performing hospital. The hospital's staff is as diverse as the patients they serve. Interpreter services can be provided at any time of the day or night in over 130 languages.\n\\n\nAt NYC Health + Hospitals, our mission is to deliver high quality care health services, without exception. Every employee takes a person-centered approach that exemplifies the ICARE values (Integrity, Compassion, Accountability, Respect, and Excellence) through empathic communication and partnerships between all persons.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nWork Shifts\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n9:00 A.M – 5:00 P.M\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDuties & Responsibilities\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPurpose of Position\n:\nUnder varying levels of direction and expertise, is responsible for the on-going assessment, design, development and implementation of system-wide clinical systems. Specifically, collect and transform large quantities of information into meaningful business requirements; develop and modify requirements documentation for the design and implementation of clinical information systems; critically evaluate information from various sources; distinguish user needs from actual business needs and partner with business users, project managers, programmers, consultants and IT leadership in optimizing the scope, benefits and risks of actual and proposed projects as well as assist in managing stakeholder expectations.\nExamples of Typical Tasks\n:\n\\n\nAt a higher level, performs the typical tasks of Assignment Level I:\n\\n\nAt a higher level, performs the typical tasks of Assignment Level I:\n\\n\n1. Analyze and document business requirements and processes; communicate requirements to technical personnel through the construction of basic conceptual data, process models and flowcharts, and technical specifications.\n\\n\n2. Interview end users, stakeholders, and project sponsors in order to assess business and clinical needs; create business, functional, and technical requirements document based on captured data and, in accordance with departmental protocol/standards.\n\\n\n3. Convert information gathered into specific details including data sources, data and user types, interface components, interface navigation needs, reporting needs and administrative system needs.\n\\n\n4. Define external interfaces, constraints, quality issues and other non-functional requirements.\n\\n\n5. Provide project management team with identified risks, concerns, and ambiguities discovered during the gathering of requirements; assist team in developing solutions.\n\\n\n6. Partner with project managers to complete requirements documentation, in accordance with project schedule.\n\\n\n7. Plan, organize, facilitate, and lead meetings and workgroups as well as oversee and execute follow-up activities.\n\\n\n8. Ensure software development team accounts for all defined technical requirements, in coordination with quality assurance team. Ensure that all quality standards comply with internal policies and industry standards.\n\\n\n9. Document changes to baseline requirements through standard change control process. Document software test plans, technical requirements, release notes, user and training guidelines and other materials.\n10. Plan, coordinate, and support unit acceptance testing and subsequent deployments, in coordination with other team leaders.\n\\n\n11. Perform end user and application support functions including problem solving and resolution of application function defects. Provide systems and application training.\n\\n\n12. Develop and execute project presentations.\n13. Participate in special projects, as required.\n14. Provide training to and serve as a mentor for junior clinical business analysts and/or other appropriate project team members; manage and evaluate work products for assigned team members.\n15. Participate in the development of various departmental training initiatives.\n16. Interview junior clinical business analysts and/or other appropriate project team members.\n\\n\nAt a higher level, also performs the typical tasks of Assignment Level II:\n\\n\n1. Identify opportunities for process improvements and provide analysis and propose change and communicate strategies.\n2. Provide supervision and guidance to junior clinical business analysts, clinical business analysts assigned at Level I, consultants, and/or other appropriate project team members.\n3. Interview junior clinical business analysts, clinical business analysts assigned at Level I, consultants, and/or other appropriate project team members.\n\\n\nIn addition to performing the typical tasks of Assignment Levels I and II at a higher level, as described above, performs the following:\n\\n\n1.\nLead the training, development, and implementation of process improvements for all projects and applications.\n\\n\n2.\nProvide supervision and direction to junior clinical business analysts, clinical business analysts assigned at Levels I and II, consultants, and/or other appropriate project team members.\n\\n\n3.\nInterview junior clinical business analysts, clinical business analysts assigned at Levels I and II, consultants, and/or other appropriate project team members.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nMinimum Qualifications\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n1. A Masters Degree or advanced clinical degree from an accredited college or university and two years of experience serving as a lead in soliciting, defining, and managing requirements for internally and externally developed software in a clinical, allied health, non-allied health, behavioral health, information technology, information services, business, analytics or related area; or, one year of experience in a relevant clinical and/or healthcare administration role/function; or\n2. A Baccalaureate Degree from an accredited college or university and five years of experience as described above; or\n3. A satisfactory combination of education, training, and experience.\n4. Specialty certification(s) issued by a national commercially available program, state, professional society, academic or technical institution in an area(s) listed above, may be credited on a month-to-month basis toward the required work experience for a total of one year.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDepartment Preferences\n\\n\n\\n\n\\n\n\\n\n\\n\nKnowledge of Information Systems used within the facility, such as PeopleSoft, Mainframe, and EPIC\n\\n\nTechnical ability to develop Access or Excel databases to aid in various budget administration tasks.\n\\n\nUnderstanding of basic Accounting principles, including but not limited to, General Ledger operations.\n\\n\nDeal with Department Heads in a timely, courteous, and professional manner.\n\\n\nDeal with Central Office personnel in a timely, courteous, and professional manner.\n\\n\nProvide assistance to facility and Central Office personnel and gather information as required\n\\n\nRecognizes potential budgeting/expenditure problems and inform Budget Director of same.\n\\n\nAbility to understand systems and processes of financial operation and work within that context.\n\\n\nIdentify opportunities for process improvements with the finance department and provide analysis and propose change and communication strategies.\n\\n\nRecognizes own limitations and seeks appropriate assistance as needed.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nBenefits\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nNYC Health and Hospitals offers a competitive benefits package that includes:\n\\n\n\\n\nComprehensive Health Benefits for employees hired to work 20+ hrs. per week\n\\n\nRetirement Savings and Pension Plans\n\\n\nPaid Holidays and Vacation in accordance with employees' Collectively bargained contracts\n\\n\nLoan Forgiveness Programs for eligible employees\n\\n\nCollege tuition discounts and professional development opportunities\n\\n\nCollege Savings Program\n\\n\nUnion Benefits for eligible titles\n\\n\nMultiple employee discounts programs\n\\n\nCommuter Benefits Programs\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nHow To Apply\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nIf you wish to apply for this position, please apply online by clicking the \"Apply for Job\" button.\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=f8fc0d1eab032430&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoa4c0i8qp87r&spon=0&xkcb=SoCj67M3pv4nSMACJ70BbzkdCdPP&xfps=247cd293-a336-46b4-a2bb-f7136eb032d4&vjfrom=vjs&asub=mob&astse=d4a4a5aca2b54b04&assa=3416"
}