{
  "filename": "data_analyst_New_York__NY_page5_job4_Business_Analyst__Strategy___B.html",
  "job_title": "Business Analyst, Strategy & Business Modeling",
  "company": "BTS",
  "location": "New York, NY 10118•Hybrid work",
  "salary": "$75,000 - $90,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:59:07.638Z",
  "full_description": "\\n\nBTS is a consultancy specializing in the people side of strategy. For over three decades we’ve been designing powerful experiences that have a profound and lasting impact on businesses and their people. We help the world’s leading companies turn strategy into results.\n\\n\nOur next-generation approach combines deep business knowledge with transformational development to help people and their company evolve together. We equip leaders for tomorrow, inspire new ways of thinking, and build critical capabilities through targeted interventions, including working sessions, workshops, offsites, and more.\n\\n\nAs a Business Analyst on the Strategy & Business Modeling team, you’ll work directly with leaders from the world’s leading corporations. You’ll learn their strategies and how their businesses work, and you’ll shape the leadership capabilities of their senior management. A BTS consultant also cultivates the skills of thousands of developing leaders across the globe.\n\\n\nA Strategy & Business Modeler (SBMer) is responsible for designing and building the business simulations and models that are the foundation of many BTS experiences. Our simulation models help leaders at organizations visualize their role in their company’s strategy and understand how their decisions impact organizational performance.\n\\n\nThe SBMer is a key member of the BTS consultant team that conducts discovery interviews with client stakeholders, co-creates a design with the client to deliver on their objectives, builds the modeling component of the experience, and delivers, facilitates, and presents the end solution to the client. An SBMer brings specialized knowledge to the BTS team by helping to simplify complex business models, highlighting tradeoffs within the client’s business model, and bringing strong business and financial expertise to the team.\n\\n\nThere are no industry verticals at BTS, and you will have all the variety you want in your clients and work. You’ll be staffed on multiple projects at one time, across different industries, and with different internal teams.\n\\n\nWe feel that regularly working together in the office is the best situation for career development, so we are not hiring remote employees at this time. However, we have a hybrid work environment where you can work from home a few days a week. As for travel, you will be expected to travel for internal working sessions, client milestone meetings, and client facilitations. You can expect that you’ll travel around 25-30% of the time, going to different cities to facilitate the incredible experiences you’ve designed.\n\\n\n\\n\nWhat We’re Looking For\n\\n\nCuriosity. Resourcefulness. A humble and inclusive spirit. These are core attributes of BTS all-stars.\n\\n\nStrong business and financial acumen and a love for problem solving with a structured approach to scoping solutions to those problems. Modeling and Advanced Excel skills (INDEX/MATCH, Lookups, IF statements) are a must. Experience with programming languages, especially VBA, and openness/curiosity to using AI to enhance work are big pluses. Backgrounds in engineering, finance, science, math, or economics are well-suited. We have team members from all kinds of backgrounds, work experience, and education. We love diversity and variety.\n\\n\nWe do have a few requirements. Bachelor’s degree or equivalent experience is needed, as are strong written and verbal communication skills. Willingness to travel as indicated above.\n\\n\nLastly, we require eligibility to work in the US permanently without sponsorship.\n\\n\n\\n\nSalary Information\n\\n\nAnnual Salary Range: $75,000 - $90,000\n\\n\n\\n\nThis range is for Business Analyst and Senior Business Analyst, and Consultant level roles. Starting salary is determined by experience and education/degree level.\n\\n\n\\n\n\\n\n#LI-Hybrid\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=9348fc701a737a8c&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnbj48jn1a803&spon=0&xkcb=SoDO67M3pvmhsM20BR0PbzkdCdPP&xfps=72833e0d-7879-4fca-94c6-67423a500eac&vjfrom=vjs&asub=mob&astse=0153f97d6b44b147&assa=1890"
}