{
  "filename": "data_analyst_New_York__NY_page6_job7_Hourly_Data_Analyst__Part_time.html",
  "job_title": "Hourly Data Analyst (Part-time)",
  "company": "New Jersey Institute of Technology",
  "location": "Newark, NJ 07102",
  "salary": "$35 an hour",
  "job_type": "Part-time",
  "scraped_at": "2025-12-27T11:01:44.711Z",
  "full_description": "\\n\nTitle:\nHourly Data Analyst (Part-time)\nDepartment:\nCenter for Natural Resources\nReports To:\nDirector, Center for Natural Resources\nPosition Type:\nStaff\nPosition Summary:\nThe Hourly Data Analyst (part-time) will play a key role in REACH project at the Center for Natural Resources (CNR). This position will evaluate machine learning approaches and implement techniques for deep learning as applied to various storms over different watersheds.\nEssential Functions:\n\\n\n\\n\nEvaluate various machine learning approaches.\n\\n\nImplement various techniques for deep learning as applied to various storms over different watersheds.\n\\n\nForecast based on easily measurable quantities the water level and streamflows at various locations.\n\\n\nProvide progress reports to Dr. Boufadel.\n\\n\nPerforms other related duties as assigned or requested by the Center Director.\n\\n\nPrerequisite Qualifications:\n\\n\n\\n\nPhD in Computer Science, Data Science or equivalent or related disciplines.\n\\n\nExperience working with research centers, government-funded environmental projects (e.g., NJDEP, EPA, NOAA).\n\\n\nExperience with application of machine learning in Environmental projects.\n\\n\nExperience collaborating with scientists, engineers, and community partners on outreach initiatives.\n\\n\nAt the university's discretion, the education and experience prerequisites may be exempted where the candidate can demonstrate to the satisfaction of the university, an equivalent combination of education and experience specifically preparing the candidate for success in the position.\n\\n\nSalary Information:\nIn compliance with the NJ Pay Transparency Law, the hourly rate for this position is $35.00 (USD). NJIT considers factors such as (but not limited to) scope and responsibilities of the position, candidate's work experience, education/training, key skills, internal peer equity, as well as, market and organizational considerations when extending an offer. This pay range represents base pay only and excludes any additional items such as incentives, bonuses or other items.\nFLSA:\nNon-Exempt\nPart-Time\\n\n\\n\n\\n\n\\n\nNew Jersey Institute of Technology (NJIT) is an Equal Employment Opportunity (EEO) employer committed to fostering a diverse, equitable, and inclusive environment across our teaching, research, and workplace communities. NJIT does not discriminate on the basis of race, color, national origin, sex, sexual orientation, gender identity or expression, disability, age, religion, ancestry, genetic information, military or veteran status, or any other characteristic protected by law. We strongly encourage applications from women, minorities, individuals with disabilities, and veterans, and are dedicated to ensuring access, equal opportunity, and reasonable accommodations for individuals with disabilities in all employment, programs, services, and activities.\n\\n\nEmployment at NJIT is subject to the provisions of New Jersey First Act which mandates new employees, who are not NJ residents, to establish primary residence in New Jersey within one year of their appointment to certain positions. The law does not apply to any individual employed at NJIT on a temporary or per semester basis as a visiting or adjunct professor, teacher, lecturer, researcher or administrator. For more information on the act please click here.\n\\n\nIf special accommodations are needed in applying for a position, please visit the Department of Human Resources located in Fenster Hall, Room 500, University Heights, Newark, NJ 07102 or call (973) 596-3140. If you have questions, please email the Human Resources Department at hr@njit.edu.\n\\n\nInformation regarding NJIT campus security, personal safety, and fire safety including topics such as, disciplinary procedures, crime prevention, NJIT Police law enforcement authority, crime reporting policies, and crime statistics for the most recent three year period is available on the NJIT Department of Public Safety here.\n\\n\nNJIT is an E-Verify employer and uses E-Verify to confirm work authorization of each new hire.\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=8e92d796f6c4d138&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnfc72293c07e&spon=0&xkcb=SoAn67M3pvmyVWACJ70MbzkdCdPP&xfps=53a9b234-61b5-49ca-bb98-03df900e2797&vjfrom=vjs&asub=mob&astse=c2b87ca6c56d27b0&assa=9243"
}