{
  "filename": "data_analyst_Houston__TX_page1_job1_Energy_Data_Analyst.html",
  "job_title": "Energy Data Analyst",
  "company": "Prudential Energy",
  "location": "Houston, TX",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:42:56.042Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\nResponsibilities:\n\\n\n\\n\nManage the day-to-day workflow associated with Prudential Energy’s front-end software. Involves onboarding, maintain, auditing and tracking performance.\n\\n\nAnalyze Prudential Energy front-end software and identify inefficiencies and areas where improvement is required. Work with internal team as well as 3rd party development partners to improve data accuracy and usability. Monitor results and report progress.\n\\n\nFacilitate systematic processing of energy deals by analyzing customer historical energy usage and creating pricing quotes.\n\\n\nAssist the pricing team with the RFP process: Initiation, analysis, final work product and quality control\n\\n\nAccountable for data accuracy in all workflow aspects\n\\n\nProactively communicate across team, to manage project progress and meet deadlines.\n\\n\nInput accurate deal level data points: Contact info, start/end date, account size, rate type etc.\n\\n\nContract data entry into back office software throughout contract lifecycle.\n\\n\nIdentify, design, and implement solutions to improve quality, standardization, accuracy of analytical work product\n\\n\nComplete reporting requirements including dashboards and other analytical reports\n\\n\n\\n\nNecessary Qualities:\n\\n\n\\n\nDedication to project outcomes\n\\n\nAbility to think creatively and strategically, take a proactive and aggressive goal setting approach to assist in developing continuous improvement culture\n\\n\nCollaborate effectively in a fast-paced, team environment\n\\n\nSelf-motivated; committed to the execution of quality, team work\n\\n\nInterest in learning all core business functions and processes; drawing connections to the bigger picture is of paramount importance\n\\n\nStrong sense of urgency and attention to strategic timing considerations\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=f55f73da9eca7fda&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfme75aj73689f&spon=0&xkcb=SoCP67M3pvk3MbRbpp0KbzkdCdPP&xfps=1072cf0b-ae9e-402b-9baa-555d2fb1d25a&vjfrom=vjs&asub=mob&astse=3a990c0294fb74df&assa=6380"
}