{
  "filename": "data_analyst_Houston__TX_page2_job1_Product_Analyst.html",
  "job_title": "Product Analyst",
  "company": "Reynolds and Reynolds",
  "location": "College Station, TX 77845",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:45:20.423Z",
  "full_description": "As a Product Analyst, you will be responsible for all aspects of the product life cycle including the technical, functional, and business foundations of our products. You will act as the liaison between cross-functional teams including but not limited to; Change Management, Design, Software Development, and the Call Center. Your goal is to effectively manage multiple simultaneous projects, deadlines and deliverables all while communicating the overall product delivery to your team. In addition to product management, you will be responsible for testing a variety of software applications to help ensure our products are to the highest quality and align with our clients business goals. If you feel comfortable working in a fast-paced, time-sensitive environment, this is the position for you!\n\\n\nRequirements:\n\\n\n\\n\nA Bachelor's degree with technical, marketing, or business emphasis preferred or equivalent experience\n\\n\nAutomotive or dealership experience is a plus, but not required\n\\n\nAbility to multi-task, prioritize, and meet deadlines\n\\n\nMust have reliable transportation as well as a valid driver’s license, with fewer than 2 moving violations in the last three years and no OVI/DUI/DWI violations in the last five years\n\\n\nUnderstanding of business intelligence and data analytics\n\\n\nEffective oral and written communication skills\n\\n\nAbility to identify issues, research and solve problems\n\\n\n\\n\nBenefits:\n\\n\nOur associates receive medical, dental, vision, and life insurance. We also offer company contributions to your HSA, 6% match on 401 (k), and a work/life balance with paid time off. At our College Station facility, you can take advantage of our great training programs and facility amenities, including an onsite dining facility offering complimentary breakfast and lunch, a fitness center, and an onsite medical center. We also offer a wide variety of sports and social leagues to participate in after work, along with volunteering initiatives through our Associate Foundation.\n\\n\nWhat We Do At Reynolds\n\\n\nFounded in Dayton, Ohio in 1866, Reynolds and Reynolds is a leading provider of car dealership software, services, and forms to help dealerships deliver better results and transform the customer experience.\n\\n\nReynolds and Reynolds is headquartered in Dayton, Ohio, with major U.S. operations in Houston and College Station, Texas, Celina, Ohio, and Tampa, Florida, as well as operations in Canada, in the U.K., and Europe.\n\\n\nWith products in over 70% of U.S. dealerships, Reynolds features the industry’s only Retail Management System. If you’ve ever purchased a vehicle at a dealership, there’s a good chance we had a hand in that transaction.\n\\n\nReynolds and Reynolds promotes a healthy lifestyle by providing a non-smoking environment. Reynolds and Reynolds is an equal opportunity employer.\n\\n\nReynolds and Reynolds encourages applicants of all ages and experience to apply, as we do not discriminate on the basis of age.\n\\n\nJob Type: Full-time\n\\n\nBenefits:\n\\n\n\\n\n401(k)\n\\n\nDental insurance\n\\n\nHealth insurance\n\\n\nPaid time off\n\\n\nVision insurance\n\\n\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}