{
  "filename": "data_analyst_New_York__NY_page4_job9_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "Mpower Logic",
  "location": "7 Lincoln Highway, Edison, NJ 08820",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:57:59.222Z",
  "full_description": "Business Analyst (Edison, NJ) (Multiple Openings) Design & develop process flow diagrams using Oracle Business Process Management tool (OBPM) to develop the as-is and to-be diagrams to simulate the process flow; develop domain models, logical & physical data models for Oracle, SQL Server databases using ERWIN tool.; Create & manage Business Requirements, Functional Requirements, Use Cases & traceability relationships in Rational Requisite Pro; create Use Case specifications, Business Flow diagrams, Activity/state diagram & Sequence diagram using Rational Rose; develop complex database queries & manually building data for database loads for testing using SQL Developer & TOAD; design & develop reports generated by Cognos reporting tool; develop the test plans & detailed test cases, execute the test cases & logging/tracking the defects in HP Quality Center. Travel to multiple client locations nationwide. Must have Bachelors in computers/ electronics/ related + 1 year exp as Programmer Analyst/Soft. Engineer/ Developer/ related. Respond to HR Manager, Job ID: BA/RM/14, MPower Logic, Inc., 7 Lincoln Highway, Suite # 227B, Edison, NJ 08820.\n\\n\nWe have these immediate opportunities for our data management and KPO center. If you have what we are looking for, please apply online (Apply Online) or e-mail your resume to resumes@mpowerlogic.com",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=fc22d7c22c7913e1&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfn8f3pi9eb8ah&spon=0&xkcb=SoB367M3pvmuMEygLZ0CbzkdCdPP&xfps=8c000ac7-3bff-4a9c-83d5-ad1e8a7afdcb&sjdu=plYPK8JzJpXbLTG6vynqOPC4s6I5s_CSpvmzeeaEQRcNlEqnnyDd2VrJNLrR65dSOOMt8krrczqyruE8DEchmA&vjfrom=vjs&asub=mob&astse=8ec31169b5d75eb9&assa=4429"
}