{
  "filename": "data_analyst_New_York__NY_page10_job5_Business_Insights_Analyst.html",
  "job_title": "Business Insights Analyst",
  "company": "Avis Budget Group",
  "location": "Parsippany-Troy Hills, NJ 07054",
  "salary": "$57,600 - $98,548 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:21:01.967Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\nJoin Avis Budget Group as a Business Insights Analyst and help drive smarter decisions through data. In this role, you'll engage with business teams to understand challenges, provide thought leadership, and identify how advanced analytics solutions could be leveraged.\n\\n\n\\n\n\\n\n\\n\nWhat You'll Do:\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDraw conclusions and make actionable recommendations based on analysis\n\\n\n\\n\n\\n\n\\n\n\\n\nHelp better leverage, utilize, and instill advanced analytics solutions throughout the organization\n\\n\n\\n\n\\n\n\\n\n\\n\nDesign and develop advanced analytics solutions\n\\n\n\\n\n\\n\n\\n\n\\n\nEnsure that advanced analytics solutions are practical and effective based on expertise and experience\n\\n\n\\n\n\\n\n\\n\n\\n\nDevelop processes and tools to measure and monitor solution performance and value achievement\n\\n\n\\n\n\\n\n\\n\n\\n\nContinually improve existing advanced analytics solutions\n\\n\n\\n\n\\n\n\\n\n\\n\nPerks\nYou’ll\nGet:\n\\n\n\\n\n\\n\n\\n\n\\n\nPaid time off\n\\n\n\\n\n\\n\n\\n\n\\n\n401K retirement plan with company matched contributions\n\\n\n\\n\n\\n\n\\n\n\\n\nAccess to Medical, Dental, Vision, Life and Disability insurance\n\\n\n\\n\n\\n\n\\n\n\\n\nEligible to elect other voluntary benefits including: Group Legal, Identity Theft, Insurance, FSA, additional life insurance coverages\n\\n\n\\n\n\\n\n\\n\n\\n\nContribute up to $260 as a tax free benefit for public transportation or parking expenses\n\\n\n\\n\n\\n\n\\n\n\\n\nEmployee discounts, including discounted prices on purchase of Avis / Budget cars\n\\n\n\\n\n\\n\n\\n\n\\n\nAccess to an Employee Assistance Program for services including counseling, financial and legal consultation, referrals for care service, and more\n\\n\n\\n\n\\n\n\\n\n\\n\nWhat We're Looking For:\n\\n\n\\n\n\\n\n\\n\n\\n\nMaster's degree in Business Analytics, Data Engineering, Data Science, Econometrics or related field\n\\n\n\\n\n\\n\n\\n\n\\n\n1-2 years’ experience delivering advanced analytics solutions or equivalent combination of education and relevant internship experience in data analytic type roles.\n\\n\n\\n\n\\n\n\\n\n\\n\nExperience with database queries (e.g., Oracle, SQLServer, Access, Hadoop/HiveSQL), and at least one programming language (e.g. Python or R)\n\\n\n\\n\n\\n\n\\n\n\\n\nKnowledge of BI tools (e.g., Tableau, Power BI)\n\\n\n\\n\n\\n\n\\n\n\\n\nAbility to think strategically and identify critical success factors when developing solutions\n\\n\n\\n\n\\n\n\\n\n\\n\nStrong communication, organization, and time management skills\n\\n\n\\n\n\\n\n\\n\n\\n\nAbility to work effectively in a team oriented, high demand, and fast paced environment\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nThe annual starting salary for this position is between $57,600 – $98,548 annually. Factors that may affect starting pay within this range include geography/market, skills, education, experience, and other qualifications of the successful candidate.\n\\n\n\\n\n\\n\n\\n\nWho We Are:\n\\n\n\\n\n\\n\n\\n\nHere at Avis Budget Group, you will be joining a team of 25,000 driven people, performing with purpose. Together, we’re moving the future of transportation forward with our innovative, customer-focused solutions.\n\\n\n\\n\n\\n\n\\n\nOur culture is performance driven, where we encourage and support each other to be at our best through leadership, training, tools, and rewards.\n\\n\n\\n\n\\n\n\\n\nWe are proud to make a positive difference to the lives of our colleagues, customers, and communities where we operate.\n\\n\n\\n\n\\n\n\\n\nAvis Budget Group is an Equal Opportunity Employer – Qualified applicants will receive consideration for employment without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, status as a protected veteran or any other category protected by applicable law.\n\\n\n\\n\n\\n\n\\n\nThis advertisement\ndoes not constitute\na promise or guarantee of employment. This advertisement describes the general nature and level of this position only. Essential functions and responsibilities may change as business needs require. The compensation and benefits information\nis\naccurate\nas of the date of this posting. The Company reserves the right to\nmodify\nthis information at any time, with or without notice, subject to applicable law. This position may be with any affiliate of Avis Budget Group.\n\\n\n\\n\n\\n\n\\n\nParsippany\\n\nNew Jersey\\n\nUnited States of America\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=e490c1e20fc742e2&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoj3k62dir088&spon=0&xkcb=SoAo67M3pv5DoOyJaB0ObzkdCdPP&xfps=f54380b7-56a8-482b-b8b9-b31febaa1789&vjfrom=vjs&asub=mob&astse=25416ad1c175bbfb&assa=2328"
}