{
  "filename": "data_analyst_Houston__TX_page2_job7_Business_Systems_Analyst__Part.html",
  "job_title": "Business Systems Analyst (Partial Remote) - Supply Chain Business Operations and Systems",
  "company": "UTMB Health",
  "location": "Galveston, TX•Hybrid work",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:46:12.893Z",
  "full_description": "\\n\nMinimum Qualifications:\n\\n\nBachelor’s degree or equivalent and 1 year of related experience.\n\\n\n\\n\nJob Summary:\n\\n\nTo participate in the design, development, testing, implementation, and maintenance of business systems and processes based on the departmental function. Uses information technology to provide reporting and analysis in support of the current and future business environment as required according to institutional guidelines.\n\\n\n\\n\nJob Duties:\n\\n\n\\n\nDesigns and develops simple to moderately complex reports and documents for existing business processes and business rules using information systems. May require creating new databases or using existing ones.\n\\n\nModifies processes to solve business issues utilizing current information systems.\n\\n\nUses the application of technology to support the current and future business environment; works independently or with appropriate information technology staff.\n\\n\nAssists in the development of high-level project definition and cost assessment of projects.\n\\n\nPrepares detailed functional specifications from high-level project definition.\n\\n\nAssists with the design and development of user test plans for new or enhanced business systems. Participates in user testing and coordinates results with appropriate information technology staff.\n\\n\nPartners with customers to facilitate oral and written communications, including the design and delivery of presentations.\n\\n\nTrains users in new procedures and systems. May design and develop simple to moderately complex training materials.\n\\n\nParticipates as a team member.\n\\n\nAdheres to internal controls and reporting structure.\n\\n\nPerforms related duties as assigned.\n\\n\n\\n\n\\n\nSalary Range:\n\\n\nActual salary commensurate with experience.\n\\n\n\\n\nWork Schedule:\n\\n\nMonday through Friday, 8 am-5 pm, partial remote to be determined by the department.\n\\n\n\\n\nEqual Employment Opportunity\n\\n\nUTMB Health strives to provide equal opportunity employment without regard to race, color, religion, age, national origin, sex, gender, sexual orientation, gender identity/expression, genetic information, disability, veteran status, or any other basis protected by institutional policy or by federal, state or local laws unless such distinction is required by law. As a Federal Contractor, UTMB Health takes affirmative action to hire and advance protected veterans and individuals with disabilities.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=87046a8e4d699fe8&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfmissbl03785n&spon=0&xkcb=SoA-67M3pvlEerygL50MbzkdCdPP&xfps=50009b44-e635-49cc-9d9a-1c6822f2cea2&vjfrom=vjs&asub=mob&astse=c592f53cef13ef25&assa=3217"
}