{
  "filename": "data_analyst_New_York__NY_page6_job9_Financial_Analyst___Reporting.html",
  "job_title": "Financial Analyst - Reporting",
  "company": "PMA Companies",
  "location": "Blue Bell, PA 19422",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T11:02:00.809Z",
  "full_description": "\\n\nAs a member of PMA's Financial reporting department, you will play a key role in reporting third-party administrator financial performance to Old Republic International (PMA Companies' parent company), including completion of various quarterly financial reporting packages. You will also be responsible for preparing monthly journal entries and internal financial reporting schedules for PMA.\n\\n\n\\n\nResponsibilities\n\\n\n\\n\nComplete and reference financial reporting package on a quarterly basis.\n\\n\nPrepare quarterly pre-close and management schedules for PMA Companies.\n\\n\nPreparation of various general ledger journal entries.\n\\n\nPrepare monthly or quarterly reconciliations for various balance sheet accounts.\n\\n\nPrepare ad-hoc reports as needed.\n\\n\nContribute to the accuracy of financial statements using internal control guidelines.\n\\n\nAnalyze current processes to identify and implement efficiencies.\n\\n\nCoordinate with teams across the company to gather information for quarterly reporting.\n\\n\nDemonstrate commitment to Company's Code of Business Conduct and Ethics, and apply knowledge of compliance policies and procedures, standards and laws applicable to job responsibilities in the performance of work.\n\\n\nRequirements: \\n\n\\n\nBachelor's degree in Accounting / Finance or equivalent insurance-related work experience is required.\n\\n\nMinimum of one year experience in accounting/finance or related field.\n\\n\nStrong verbal and written communication skills.\n\\n\nProven critical thinking skills that demonstrate analysis/judgment and sound decision making with focus on attention to detail and quality awareness.\n\\n\nStrong organizational skills with the ability to work independently and deal with multiple tasks simultaneously.\n\\n\nStrong computer skills, including Excel and other Microsoft Office products, as well as accounting/GL software (EAS general ledger preferred).\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=11910ec147f62635&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnfc72293c07e&spon=0&xkcb=SoB667M3pvmyVWACJ70CbzkdCdPP&xfps=1807d17d-463a-47b0-988c-cde7f422ddce&vjfrom=vjs&asub=mob&astse=e8bcf6ff1281921d&assa=1128"
}