{
  "filename": "data_analyst_New_York__NY_page4_job12_Data_Analyst_I___Entry_Level.html",
  "job_title": "Data Analyst I - Entry Level",
  "company": "Cobbs Creek Healthcare",
  "location": "3803 W Chester Pike, Newtown Square, PA 19073",
  "salary": "$55,000 - $65,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:58:20.761Z",
  "full_description": "As a entry level Data Analyst, you will play a critical role in helping pharmaceutical companies make better decisions that improve health outcomes by providing solid data fundation to generate actionable insights.\n\\n\nResponsibilities:\n\\n\n· Become proficient at working with healthcare data and carry a deep understanding of the healthcare industry.\n\\n\n· Consume, analyze, and manage data using Python, SQL, and other programming languages.\n\\n\n· Conduct basic business analyses such as exploratory data analysis and reporting.\n\\n\n· Transform results into digestible visualizations.\n\\n\n· Communicate analysis in a team-based environment.\n\\n\nQualification:\n\\n\nWe expect you’ll have a Bachelor’s or Master's degree in a quantitative discipline (Statistics, Mathematics, Computer Science etc.), strong problem-solving skills, excellent work ethic, self-directed approach, and a team-oriented demeanor.\n\\n\nBesides an understanding of coding languages like Python and SQL, you’ll also need experience with Microsoft Office applications (Excel, PowerPoint, Word, etc.). Statistical modeling, data manipulation, and BI tools (Tableau, Qlik, PowerBI, etc.) experiences is a plus.\n\\n\nWork with Us\n\\n\nWe help some of the most innovative pharma companies on the planet work smarter. That requires constant curiosity and a relentless focus on “What are we solving for?” If you want to help enable insights that create successful health outcomes for patients, we want to hear from you.\n\\n\nWe provide an extensive training program that builds foundational mastery and cultivates personal process to maximize efficiency and output while also serving as a launching pad for your career. We have built a knowledge-sharing culture that rewards a consultative mindset with growth and opportunity. You'll learn quickly while solving real problems with a direct impact on the business.\n\\n\nNote: New hires are required to be in office for 5 days a week for the first 6 months. After 6 months, 3 days a week in office will be required.\n\\n\nJob Type: Full-time\n\\n\nPay: $55,000.00 - $65,000.00 per year\n\\n\nBenefits:\n\\n\n\\n\n401(k)\n\\n\nDental insurance\n\\n\nDisability insurance\n\\n\nFlexible schedule\n\\n\nHealth insurance\n\\n\nHealth savings account\n\\n\nLife insurance\n\\n\nPaid holidays\n\\n\nPaid sick time\n\\n\nPaid time off\n\\n\nVision insurance\n\\n\n\\n\nLocation:\n\\n\n\\n\nNewtown Square, PA 19073 (Preferred)\n\\n\n\\n\nAbility to Commute:\n\\n\n\\n\nNewtown Square, PA 19073 (Required)\n\\n\n\\n\nAbility to Relocate:\n\\n\n\\n\nNewtown Square, PA 19073: Relocate before starting work (Required)\n\\n\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}