{
  "filename": "data_analyst_Houston__TX_page1_job6_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "KHSSP Solutions",
  "location": "Houston, TX",
  "salary": "$30.36 - $45.27 an hour",
  "job_type": "Part-time, Full-time",
  "scraped_at": "2025-12-27T10:43:47.403Z",
  "full_description": "Job Summary\nWe are seeking a dynamic and detail-oriented Data Analyst to join our innovative team. In this role, you will harness your analytical expertise to transform complex data into actionable insights that drive strategic decision-making. Your enthusiasm for data analysis, combined with your proficiency in various tools and methodologies, will empower our organization to optimize operations, enhance business processes, and uncover new opportunities for growth. This position offers an exciting opportunity to work on diverse projects within a collaborative environment that values continuous learning and innovation.\n\\n\nDuties\n\\n\n\\n\nCollect, clean, and analyze large datasets using SQL, R, Python, and ETL (Extract, Transform, Load) processes to ensure data integrity and accuracy.\n\\n\nDevelop interactive dashboards and visualizations with Tableau, Power BI, Looker, and other BI tools to communicate insights clearly to stakeholders.\n\\n\nDesign and implement database structures using Microsoft SQL Server, Oracle, and database design principles to support efficient data storage and retrieval.\n\\n\nCollaborate with cross-functional teams employing Agile project management methodologies to deliver timely analytics solutions aligned with business needs.\n\\n\nConduct business analysis by translating requirements into technical specifications and actionable reports that support strategic initiatives.\n\\n\nUtilize data analysis skills to identify trends, patterns, and anomalies that inform decision-making processes across departments.\n\\n\nSupport the entire Software Development Life Cycle (SDLC) by participating in planning, development, testing, deployment, and maintenance of analytics solutions.\n\\n\nLeverage tools like VBA, Bash (Unix shell scripting), Talend, and Visio for automation, workflow management, process modeling, and documentation purposes.\n\\n\nEngage in Linked Data initiatives to connect disparate datasets for comprehensive insights and advanced analytics projects.\n\\n\n\\n\nRequirements\n\\n\n\\n\nProven experience with SQL programming in environments such as Microsoft SQL Server or Oracle databases.\n\\n\nStrong proficiency in data visualization tools including Tableau, Power BI, or Looker.\n\\n\nSolid understanding of ETL processes and experience with ETL tools like Talend or similar platforms.\n\\n\nKnowledge of programming languages such as R and Python for statistical analysis and automation tasks.\n\\n\nFamiliarity with database design principles and experience working with relational databases.\n\\n\nExperience applying Agile methodologies within project management frameworks.\n\\n\nAbility to interpret complex business requirements into technical solutions through effective business analysis skills.\n\\n\nUnderstanding of SDLC processes for developing scalable analytics applications.\n\\n\nSkills in VBA scripting for automation within Microsoft Office applications; Bash scripting for Unix/Linux environments is a plus.\n\\n\nKnowledge of Linked Data concepts for integrating diverse datasets across platforms.\n\\n\nExcellent analysis skills with a keen eye for detail and accuracy in data handling. Join us as a Data Analyst if you’re passionate about transforming data into strategic assets! Bring your expertise in analytics tools like Tableau, Power BI, R, Python, SQL Server, Oracle, Looker, Talend, VBA, Bash scripting—and more—to help shape our organization’s future through insightful data-driven decisions!\n\\n\n\\n\nJob Types: Full-time, Part-time\n\\n\nPay: $30.36 - $45.27 per hour\n\\n\nBenefits:\n\\n\n\\n\nAD&D insurance\n\\n\nCash balance pension plan\n\\n\nHealth insurance\n\\n\nHousing allowance\n\\n\nLife insurance\n\\n\n\\n\nWork Location: On the road",
  "apply_method": "indeed_apply",
  "apply_url": null
}