{
  "filename": "data_analyst_New_York__NY_page9_job3_Business_Intelligence_Analyst.html",
  "job_title": "Business Intelligence Analyst",
  "company": "Pandora Jewelry",
  "location": "New York, NY",
  "salary": "$90,000 - $115,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:18:15.863Z",
  "full_description": "\\n\n\\n\nBusiness Intelligence Analyst, Pandora NAM\n\\n\n\\n\n\\n\n\\n  As the largest jewellery brand in the world, we a give a voice to millions of people’s loves every day. Our beautiful products empower people all around the world to express themselves. We are proud to be part of their stories and the most important moments in their lives.\\n\n\\n\n\\n\n\\n  Where original thinking is welcomed, and can turn into positive impact in a heartbeat, we can dream big, dare to act, and deliver with care and passion. At Pandora where you can each craft far more than just an incredible career.\\n\n\\n\n\\n\n\\n\nAbout the Team:\n\\n\n\\n\n\\n  You will be joining the Business Intelligence team in North America, responsible for the operation and application of vast amounts of data generated through Pandora's omni network and/or collected from external open data sources i.e. jewellery industry, macroeconomic metrics etc. Together with 3 highly skilled and motivated colleagues, you will provide the organization with insights and action plans to achieve targeted results. Furthermore, the BI team is responsible for tracking Pandora's progress toward our growth Strategy goals including the identification and root-causing of deviations, as well as presenting findings to leadership-level business partners\\n\n\\n\n\\n\n\\n\nYour Role as\nBusiness Intelligence Analyst\n\\n\n\\n\n\\n\n\\n\nReport & dashboard creation, testing, and maintenance.\n\\n\n\\n\n\\n\n\\n\n\\n\nSupporting the deployment of forecasting models (through reports and other processes)\n\\n\n\\n\n\\n\n\\n\n\\n\nManagement of the data dictionary and report repository\n\\n\n\\n\n\\n\n\\n\nCo-own and maintain the reporting structure of Pandora NAM – using data visualization software - ensuring consistent alignment between business goals, reported KPI, success criteria across organizational levels\n\\n\nBuild well-managed data visualization solutions, tools, and capabilities to enable self-service frameworks for functional leaders and sales teams\n\\n\n\\n\n\\n\n\\n\n\\n\nConceive and manage requests for changes in the data pipeline, ETL and platforms required to meet analytical needs in North America. Your role will be to collaborate with global partners, i.e. product managers and data engineers to prioritize and deliver the required adjustments\n\\n\n\\n\n\\n\n\\n\n\\n\nAnalyze large volumes of data and provide senior leadership with critical insights for informed decision-making\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nCraft your career with us if you have\n:\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Bachelor’s degree in Business, Economics, Statistics, Data Science, or a related field\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Exceptional strategic thinking and decision-making skills\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Ability to align analytics with business goals\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Excellent written and verbal communication skills\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Proven ability to manage stakeholder relationships\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Effective communication with senior leadership\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nTechnical Skills:\n\\n\n\\n\n\\n\nData Visualization Tools:\nExpert-level proficiency with at least one major data visualization tool (e.g., Tableau, Power BI, Looker, Qlik Sense) for building interactive dashboards and reports\n\\n\nSQL:\nAdvanced proficiency in SQL for data extraction, manipulation, and analysis from large databases\n\\n\nTechnical Data analysis:\nStrong proficiency data manipulation, statistical analysis, and modelling\n\\n\nSpreadsheets:\nAdvanced Excel skills (e.g., pivot tables, VLOOKUPs, complex formulas)\n\\n\nUnderstanding of Data Warehousing/ELT Concepts:\nSolid grasp of data warehousing principles, ETL/ELT processes, and dimensional modeling.\n\\n\n\\n\n\\n\n\\n\nOur Benefits:\n\\n\n\\n\n\\n\n\\n\nWe Dare! We offer robust compensation package including base and bonus, a 401K plan to help you secure your financial future\n\\n\nWe Care! Pandora offers extensive benefits including: Medical, Dental, Vision, Short/Long Term Disability, Basic Life and AD&D, anniversary gift cards, recognition program and product discounts!\n\\n\nWe Dream! Pandora is fostering growth and crafting opportunities to support the business needs which learning and development programs, continuous feedback, LinkedIn learning, tuition reimbursement and more\n\\n\nWe Deliver! PTO Package including: Vacation, Personal, Sick, Celebration days and Paid Holidays\n\\n\n\\n\n\\n\nNew York Salary\n: $90,000.00 – $115,000.00 commensurate on experience\\n\n\\n\n\\n\n\\n\nAbout Pandora:\n\\n\n\\n\n\\n\n\\n  Pandora is the world's largest jewellery brand, specialising in the design, crafting and marketing of accessible luxury jewellery made from high-quality materials. Each piece is created to inspire self-expression, allowing people to share their stories and passions through meaningful jewellery. Pandora jewellery is sold in more than 100 countries through 6,800 points of sale, including more than 2,700 concept stores.\\n\n\\n\n\\n  Headquartered in Copenhagen, Denmark, Pandora employs 37,000 people worldwide and crafts its jewellery using only recycled silver and gold. Pandora is committed to leadership in sustainability and has set out to halve greenhouse gas emissions across its value chain by 2030. Pandora is listed on the Nasdaq Copenhagen stock exchange and generated revenue of DKK 31.7 billion (EUR 4.2 billion) in 2024.\\n\n\\n\n\\n  Pandora’s recruitment procedures are designed to be transparent and clear for all candidates. This helps us ensure that applicants are provided with a fair and equal opportunity to demonstrate their competencies and skills by removing blocking factors, possible biases, and risks of discrimination. We encourage everyone applying to our vacancies to refrain from adding identity-related elements such as a photo, marital status, and age.\\n\n\\n\n\\n\n\\n\nAbout Pandora NAM:\n\\n\n\\n\n\\n\n\\n  The Pandora North America team in the USA & Canada consists of more than 115 employees working at our offices in New York & Baltimore, more than 80 in our Logistics Center in Columbia, Maryland, an additional 100 in field positions, and more than 3,900 in our owned and operated stores.\\n\n\\n\n\\n  Today, the USA is Pandora’s single largest market. The Pandora North American region as a whole encompasses over 1,400 points of sale, including over 420 concept stores, with more than 300 being owned and operated by Pandora.\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=aa5e5e9778f95d5a&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoeno9jn0n81p&spon=0&xkcb=SoCj67M3pv402wQpQ50IbzkdCdPP&xfps=635d7ba3-7122-4e57-89a8-ffa4424c1537&vjfrom=vjs&asub=mob&astse=b932b2377ed519f3&assa=6279"
}