{
  "filename": "data_analyst_New_York__NY_page14_job1_Business_Intelligence_Solution.html",
  "job_title": "Business Intelligence Solution Analyst",
  "company": "NorthEast Provider Solutions Inc.",
  "location": "Valhalla, NY",
  "salary": "$82,501 - $103,724 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:29:18.611Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Title:\nBusiness Intelligence Solution Analyst\n\\n\nCompany:\nNorthEast Provider Solutions Inc.\n\\n\n\\n\nCity/State:\nValhalla, NY\n\\n\n\\n\nCategory:\nClerical/Administrative Support\n\\n\nDepartment:\nDMA-Data Management &Analytics\n\\n\nUnion:\nNo\n\\n\n\\n\n\\n\nPosition:\nFull Time\n\\n\nHours:\n8\n\\n\nShift:\nDay\n\\n\nReq #:\n45712\n\\n\nPosted Date:\nDec 04, 2025\n\\n\nHiring Range:\n$82,501 - $103,724\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Details:\n\\n\n\\n\nJob Summary:\n\\n\nAs a Business Intelligence Solution Analyst within the Operational Excellence & Enterprise Analytics Department, you will be responsible for optimizing and managing our enterprise business intelligence platform (Power BI.) The ideal candidate is passionate about creating exceptional user experiences, implementing robust security frameworks, and enabling stakeholders to leverage analytics effectively. You must be self-directed and comfortable supporting the business intelligence needs of multiple teams across clinical and non-clinical domains. The right candidate will be excited by the prospect of standardizing our organization's BI environment and empowering users through training and optimized analytics solutions.\n\\n\nResponsibilities:\n\\n\n\\n\n\\n\nDevelop and enforce design standards including color schemes, graphics templates, typography, and layout guidelines to ensure consistency across all enterprise analytics assets.\n\\n\nPerform comprehensive validation of business intelligence solutions to ensure data accuracy, calculation correctness, and alignment with business requirements and definitions.\n\\n\nDesign and implement intuitive navigation patterns, bookmarks, and interactive elements that enhance end-user engagement and self-service analytics capabilities.\n\\n\nConfigure and manage user access for objects including workspaces, datasets, reports, and dashboards. Implement row-level security (RLS) and object-level permissions aligned with organizational data governance policies.\n\\n\nMonitor and fine-tune report and dashboard performance through DAX optimization, data model refinement, query folding techniques, and efficient visual design.\n\\n\nDevelop and deliver training programs for end-users and report developers on functionality, best practices, and self-service analytics capabilities. Create documentation and training materials.\n\\n\nApply data visualization best practices and visual analytics principles to create clear, compelling, and action-oriented analytics solutions.\n\\n\nBuild and maintain front-end analytics tools, dashboards, and reports that provide actionable insights into operational performance and key business metrics.\n\\n\nCollaborate with data engineering teams to ensure optimal data model design and semantic layer implementation that supports scalable BI solutions.\n\\n\nEstablish testing protocols and quality assurance processes for BI deliverables prior to production deployment.\n\\n\nPartner with stakeholders including Executive leadership, Operations Management, and departmental teams to understand analytics requirements and provide technical guidance on BI solutions.\n\\n\nManage service administration tasks including workspace management, gateway configuration, capacity monitoring, and license optimization.\n\\n\nProvide recommendations to enhance BI capabilities, user adoption, and analytics maturity across the organization.\n\\n\nMaintain comprehensive documentation of BI solutions, security configurations, data definitions, and standard operating procedures.\n\\n\nQualifications: \\n\n\\n\nExperience:\n\\n\n\\n\n\\n\nMinimum of 1 year of experience in a Business Intelligence Analyst, BI Developer, or similar role, required.\n\\n\nStrong proficiency in, SQL, Business Intelligence configurations and development, required,\n\\n\n\\n\n\\n\nExperience within healthcare analytics, preferred\n\\n\nExpeirence with Power BI, preferred\n\\n\n\\n\n\\n\nEducation:\n\\n\n\\n\n\\n\nBachelor’s degree in Computer Science, Statistics, Informatics, Information Systems, or another quantitative field, required.\n\\n\n\\n\n\\n\nMaster’s degree, preferred\n\\n\n\\n\n\\n\nLicenses / Certifications:\n\\n\nN/A\n\\n\nOther:\n\\n\nExperience in BI dashboard/visualization development, star schema design implementation, performance tuning and optimization techniques related to BI development, configuring access and row level security, data profiling, expertise in analyzing data to identify gaps and inconsistencies, troubleshooting,. Excellent written and verbal communication with a strong drive for perfection/professionalism in delivery and presentation. Proven ability to work both independently on projects and as part of a larger team.\n\\n\nAbout Us:\n\\n\nNorthEast Provider Solutions Inc.\n\\n\nBenefits:\n\\n\nWe offer a comprehensive compensation and benefits package that includes:\n\\n\n\\n\nHealth Insurance\n\\n\nDental\n\\n\nVision\n\\n\nRetirement Savings Plan\n\\n\nFlexible Savings Account\n\\n\nPaid Time Off\n\\n\nHolidays\n\\n\nTuition Reimbursement\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=0462c80d104a4d73&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfp3d75l0258c6&spon=0&xkcb=SoDX67M3pv6CdcW0BR0KbzkdCdPP&xfps=2d3a95d6-c81a-4f71-a34b-7bee426d3161&vjfrom=vjs&asub=mob&astse=8dc411111c10b859&assa=9065"
}