{
  "filename": "data_analyst_New_York__NY_page11_job11_Research_Analyst.html",
  "job_title": "Research Analyst",
  "company": "Booz Allen",
  "location": "Wharton, NJ",
  "salary": "$43,700 - $90,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:24:33.328Z",
  "full_description": "\\n Research Analyst\\n\nThe Opportunity:\n\\n\nAs a product support analyst, you know the importance of delivering strategic, data-driven logistics solutions that enable product success and long-term sustainability. On our team, you’ll support critical efforts in lifecycle logistics to support critical national defense missions.\nIn this role, you’ll assist with ensuring mission critical defense programs accomplish their programmatic goals. You’ll use your foundational knowledge of integrated product support to execute logistics planning, analyze technical data, and make recommendations for implementation in support of mission or program objectives.\n\\n\n\\n\nYour contributions will help improve support to the warfighter, as you learn to support and deliver innovative logistics solutions. This is your opportunity to grow as part of a high-impact team, driving innovation where technology meets mission outcomes.\n\\n\n\\n\nWork with us as we accelerate outcomes for the nation through technology.\n\\n\n\\n\nJoin us. The world can't wait.\n\\n\n\\n\nYou Have:\n\\n\n\\n\nExperience with defense life cycle logistics support, including logistics management, principles, and practices\n\\n\nExperience with inventory management through maintaining databases and supply chain matrices\n\\n\nKnowledge of Microsoft Office programs\n\\n\nAbility to obtain a Secret clearance\n\\n\nHS diploma or GED\n\\n\n\\n\n\\n\nNice If You Have:\n\\n\n\\n\nExperience with Total Ammunition Management Information System (TAMIS) and Production Status (PRODSTAT) systems\n\\n\nPossession of excellent verbal and written communication skills\n\\n\nPossession of excellent analytical, technical, and problem-solving skills\n\\n\nSecret clearance\n\\n\n\\n\n\\n\nClearance:\n\\n\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n\\n\n\\n\nCompensation\n\\n\nAt Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being. Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care. Our recognition awards program acknowledges employees for exceptional performance and superior demonstration of our values. Full-time and part-time employees working at least 20 hours a week on a regular basis are eligible to participate in Booz Allen’s benefit programs. Individuals that do not meet the threshold are only eligible for select offerings, not inclusive of health benefits. We encourage you to learn more about our total benefits by visiting the Resource page on our Careers site and reviewing Our Employee Benefits page.\n\\n\nSalary at Booz Allen is determined by various factors, including but not limited to location, the individual’s particular combination of education, knowledge, skills, competencies, and experience, as well as contract-specific affordability and organizational requirements. The projected compensation range for this position is $43,700.00 to $90,000.00 (annualized USD). The estimate displayed represents the typical salary range for this position and is just one component of Booz Allen’s total compensation package for employees. This posting will close within 90 days from the Posting Date.\\n\n\\n\nIdentity Statement\n\\n\nAs part of the application process, you are expected to be on camera during interviews and assessments. We reserve the right to take your picture to verify your identity and prevent fraud.\n\\n\n\\n\nWork Model\nOur people-first culture prioritizes the benefits of flexibility and collaboration, whether that happens in person or remotely.\n\\n\n\\n\nIf this position is listed as remote or hybrid, you’ll periodically work from a Booz Allen or client site facility.\n\\n\nIf this position is listed as onsite, you’ll work with colleagues and clients in person, as needed for the specific role.\n\\n\n\\n\n\\n\nCommitment to Non-Discrimination\n\\n\nAll qualified applicants will receive consideration for employment without regard to disability, status as a protected veteran or any other status protected by applicable federal, state, local, or international law.\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=56840399122bd1ae&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfonhnakuq7821&spon=0&xkcb=SoBX67M3pv5R5RSC4J0AbzkdCdPP&xfps=a1484cc8-934e-4634-8709-c96ae7ca65e6&vjfrom=vjs&asub=mob&astse=a97a83f8220f00e5&assa=3695"
}