{
  "filename": "data_analyst_New_York__NY_page9_job13_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "Formosa Plastics Corporation, USA",
  "location": "9 Peach Tree Hill Road, Livingston, NJ 07039",
  "salary": "$60,475 - $82,875 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:19:58.322Z",
  "full_description": "Company Overview for Formosa Plastics Corporation, U.S.A.\nFounded in 1978, Formosa Plastics Corporation, U.S.A. (Formosa Plastics) is a growing, vertically-integrated supplier of plastic resins and petrochemicals. With annual revenues of more than $5 billion, we employ over 2,800 people who operate 20 production units in six business divisions - Olefins, Polyolefins, Vinyl, Specialty Polyvinyl Chloride, Chlor-Alkali, and Oil & Gas.\nFormosa Plastics offers a full line of polyvinyl chloride, polyethylene and polypropylene resins, caustic soda and other petrochemicals that deliver the consistency, performance and quality that customers demand. We market our polypropylene and polyethylene resins under the Formolene® tradename; we market our suspension PVC and specialty (dispersion) PVC resins under the Formolon® tradename. We also produce and sell caustic soda, ethylene dichloride, commercial bleach and hydrochloric acid.\nWe are committed to supplying the highest quality products and services to our customers, providing a safe and healthy workplace for our employees and contributing to the quality of life in the communities where we operate. This commitment is made possible through our dedicated people, consistent products, continued protection of the environment and ongoing investments in new product development, quality control systems and safe, modern and energy-efficient production facilities.\nFormosa Plastics is a privately held company headquartered in Livingston, New Jersey. Our core business, producing plastic resins and petrochemicals, takes place at three wholly-owned chemical manufacturing subsidiaries located in Delaware City, Delaware, Baton Rouge, Louisiana and Point Comfort, Texas.\nBUSINESS ANALYST\nI. Position Objective\n1. Help improve Company purchasing, inventory control, project management, and operational competitiveness through achieving individual/departmental annual goals.\n2. Improve corporate operational and cost efficiency through procedure development, improvement projects, performance/financial benchmarking and best industry practice recommendation.\n3. Enhance data integrity through continuous software modification or upgrades to ensure streamline data processing and effective procedural implementation.\nII. Major Areas of Accountability\n1. Consult with system users and discuss with developers to determine software and/or system functional specifications to ensure system meets business needs.\n2. Analyze, test, and QA/QC prototype systems based on system design specifications.\n3. Document the system design specifications and business analysis flows and train system users.\n4. Analyze received work requisitions and communicate with users and system analysts to propose improvement/development specifications based on knowledge and best judgement if it is feasible to apply/modify the existing systems within a reasonable timeframe.\n5. Analyze system-generated abnormal reports to propose control enhancement mechanism to streamline business processes.\n6. Develop/revise corporate procedures and related system SOPs to standardize business operations and/or meet regulatory requirements.\n7. Review/propose individual goals and milestones for the assigned departmental annual goals.\n8. Carry out annual goal items based on the milestones and propose goal review/progress status on a monthly basis.\n9. Perform research/benchmark study and make necessary procedural/system recommendations to improve business process and company competitiveness.\n10. Perform business analysis assignments and propose recommendations for top management in the decision-making process.\n11. Assist Internal Audit to propose/revise audit checklist and provide necessary opinions on related audit findings to ensure business/operations are in line with corporate policies and procedures.\n12. Follow Company’s train the trainer program if a new system is implemented.\n13. Carry out other duties and responsibilities as assigned by management from time to time.\n14. Ensure compliance with federal, state and local laws and regulations.\nIII. QUALIFICATIONS\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nA. TECHNICAL JOB CRITERIA\n1. Previous Related Experience Required\n\\n\n\\n\n1-3 years of business/analysis or operation/engineering management related work experience required. Chemical/plastics industry experience preferred\n\\n\n2. Technical Skills Required\n\\n\n\\n\nMicrosoft Office (Word, Excel, PowerPoint skills\n\\n\nExcellent oral/written communication skills\n\\n\nStrong organization and time management skills\n\\n\nComputer literacy and proficiency in documentation skills\n\\n\nExperience in or knowledge of IBM AS400 is a plus but not required.\n\\n\n3. Education (Minimal Education Needed)\n\\n\n\\n\n4-year college degree required.\n\\n\nEngineering/Operation/Business/MIS/Computer Science related majors and/or advanced degree preferred.\n\\n\n4. Other Certification/Training Required\n\\n\n\\n\nWill require training in Company Policies and Procedures after hire.\n\\n\nCurrent employees must meet all technical and safety training requirements for current position, as specified in the Master Training Plan.\n\\n\nMust participate in the following subject training and pass required certifications.\n\\n\n5. Other Requirements (Physical/Mental Demand, Schedule/Hours, Travel)\n\\n\n\\n\nTravel to plant when necessary to help resolve problems that affect business performance\n\\n\nMaintain a safe and healthy workplace for all employees in compliance with all applicable laws and regulations.\n\\n\nAssure compliance with all company safety, health, and security programs and practices.\n\\n\nProvide management and leadership timely and thorough reporting of all incidents to ensure all incidents are investigated properly.\n\\n\nTake personal responsibility and ownership for safety, including bringing the attitude that “I am individually responsible for safety” to the job each and every day.\n\\n\nMust have regular, reliable attendance as well as the ability to work outside the regular schedule as required.\n\\n\nMust demonstrate exceptional teamwork and customer service; behave professionally; treat others with respect and dignity.\n\\n\nMust have good oral and written communication skills.\n\\n\nCheck Out Our Benefits\nHealth Coverage and Perks\nExcellent medical, dental, and vision insurance plans\nFlexible spending accounts for health, dependent care\nShort-term Disability\nLong-term Disability\nGroup Term Life, Dependent and\nSupplemental Life Insurance\nTuition Reimbursement\n​​​​​​​\nWork/Life Balance\n10 Paid Holidays\nPaid Time Off for a balanced life\n(Vacation, Sick and Personal Time)\nFlexTime Available\nCompetitive Compensation\nCompetitive salary, incentive/bonus, 401(k) plan with company match,\nCash Balance, Pension Plan",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=aa8b8de944dd2775&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoeno9jn0n81p&spon=0&xkcb=SoD-67M3pv402wQpQ50GbzkdCdPP&xfps=e19d8c9a-b351-45bc-a229-7ed664e33ea7&vjfrom=vjs&asub=mob&astse=c759e71f730ec243&assa=8712"
}