{
  "filename": "data_analyst_New_York__NY_page3_job13_Investor_Relations_Business_De.html",
  "job_title": "Investor Relations/Business Development - Analyst/Associate",
  "company": "Marathon Asset Management, LP",
  "location": "1 Bryant Park, New York, NY 10036",
  "salary": "$100,000 - $120,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:56:44.946Z",
  "full_description": "\\n Overview: \\n\n\\n  Marathon Asset Management is a leading global asset manager specializing in public and private credit with approximately $23 billion in assets under management. Marathon is recognized as a distinguished leader with 26.2+ years of exceptional performance and partnership. Marathon’s integrated global credit platform is driven by our specialized, highly experienced, and disciplined teams across Private Credit (Direct Lending, Asset Based Lending and Opportunistic Credit) and Public Credit (High Yield, Leveraged Loans & CLOs, Emerging Markets, and Structured Credit). Marathon’s mission is to build lasting partnerships with an unwavering commitment to delivering best-in-class performance, service, and reliability on behalf of our clients.\\n\n\\n\n\\n\n\\n\nWe are seeking a highly motivated, sales-oriented professional to support the firm’s capital formation and new business development efforts. This role offers a unique opportunity to work closely with senior leadership and contribute to the growth and scaling of our business. The individual will assist in streamlining, managing processes for capital formation.\\n\n\\n\n\\n\n\\n\nThis is an ideal position for a driven, highly organized, and detail-oriented professional looking to build a foundation in capital formation within the investment management industry.\\n\nResponsibilities: \\n\n\\n  Capital Formation Development & Execution:\\n\n\\n\n\\n\nManage and cultivate opportunities by proactively engaging potential new clients, re-engage existing relationships, and expand the firm’s client base.\n\\n\nConduct prospecting activities, including outreach, while leverage relationships to build pipelines.\n\\n\nFacilitate high-quality client experiences through personalized communication, regular updates, and efficient responsiveness to inquiries.\n\\n\nWork closely with internal teams, including Client, Marketing, Product, Investment and Operations.\n\\n\nOrganize roadshows, conferences, meetings and calls to create new business opportunities.\n\\n\n\\n\n\\n  Knowledge of Product Offerings:\\n\n\\n\n\\n\nStay informed on firm’s product offerings, market trends, and prospective/existing client needs.\n\\n\nUnderstand current and prospective client needs to align with our firm’s investment solutions.\n\\n\nGarner industry knowledge and leverage insights to improve capital formation processes.\n\\n\n\\n\n\\n  Operational Support:\\n\n\\n\n\\n\nAssist in managing the pipeline for prospective investment opportunities by capturing and maintaining accurate records in the firm’s CRM system.\n\\n\nSupport efforts to respond to prospective / existing client requests\n\\n\nProvide support for project planning, scheduling, and meeting follow-ups.\n\\n\nQualifications: \\n\n\\n\nHighly organized, reliable process management skills and problem-solving abilities.\n\\n\nSelf-motivated and results-oriented: ability to manage multiple priorities.\n\\n\nCollaborative team player with a proactive and resourceful approach to problem-solving.\n\\n\nPassionate about building a career in capital formation and investor relations.\n\\n\n1+ years of relevant experience in finance, asset management, or a related field.\n\\n\nUndergraduate degree ideally in Finance, Economics, Business, or a related discipline.\n\\n\nProficiency in MS Office (Excel, PowerPoint, and Word); experience with Salesforce is a plus.\n\\n\n\\n\n\\n\n\\n\nThe salary range for this role is $100,000- $120,000 in base pay and exclusive of any bonuses or benefits. Base pay will be determined based on your experience, location, skills, training, certifications, and education, and in addition we will also consider internal equity and market data. Marathon benefit highlights include (but are not limited to) Medical/Pharmacy, Dental, Vision, HSA, FSA, STD/LTD, Life Insurance, PTO, Commuter Benefits, and company provided lunches.\\n\n\\n\n\\n\n\\n\nNo agencies, please\nEqual Opportunity Employer M/F/D/V\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}