{
  "filename": "data_analyst_Houston__TX_page2_job8_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "OptiSigns Inc.",
  "location": "7676 Hillmont Street, Houston, TX 77040",
  "salary": "$50,000 - $80,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:46:24.452Z",
  "full_description": "\\n\nAbout this Job:\n\\n\nIf you’re a naturally curious, data-savvy individual who’s excited to shape our future through analytics and insights, this job is for you.\n\\n\n\\n\nCompany Overview\n\\n\nOptiSigns is a Tech company based in Houston, we’re on a bold mission to become the #1 digital signage platform globally. We’re a fast-growing, customer-obsessed team that values innovation, collaboration, and a commitment to delivering exceptional service. As part of our expansion, we’re looking for a\nBusiness Analyst\nwho is eager to grow their career in a dynamic, high-growth environment.\n\\n\n\\n\nThe Role: Business Analyst\n\\n\nAs an\nBusiness Analyst\n, you’ll dive into data and insights that drive key decisions across the organization. You’ll work closely with cross-functional teams to uncover trends, optimize processes, and support strategic planning. This position offers an excellent opportunity to develop both your technical and business skills, with clear pathways for career growth.\n\\n\n\\n\nKey Responsibilities\n\\n\n\\n\nData Collection & Analysis\n: Gather, organize, and analyze large datasets (e.g., from SQL databases) to identify patterns, trends, and actionable insights.\n\\n\nReporting & Presentation\n: Develop clear, concise reports and presentations for stakeholders, ensuring data-driven recommendations are accessible to technical and non-technical audiences.\n\\n\nProcess Improvement\n: Collaborate with various teams to streamline operations, enhance workflows, and implement process improvements based on data analysis.\n\\n\nMarket Research\n: Conduct research on industry trends, competitor strategies, and market conditions to inform strategic planning and product development.\n\\n\nCross-Functional Collaboration\n: Partner with product, marketing, finance, and other departments to align data insights with business objectives.\n\\n\nDocumentation & Data Integrity\n: Maintain accurate documentation of analytical processes, methodologies, and results, ensuring data integrity and compliance.\n\\n\n\\n\nRequirements\n\\n\n\\n\nEducation & Experience\n: Bachelor’s degree in Business, Finance, Data Science, or a related field. Up to 2-3 years of relevant experience.\n\\n\n\\n\n\\n\nTechnical Skills\n: Familiarity with SQL, spreadsheet software, and data visualization tools (e.g., Excel, Tableau, Power BI).\n\\n\nAnalytical Mindset\n: Exceptional problem-solving skills, with an ability to interpret data and translate it into actionable insights.\n\\n\nCritical Thinking & Curiosity\n: A relentless drive to ask questions, challenge assumptions, and uncover deeper trends.\n\\n\nCommunication Skills\n: Strong written and verbal communication skills; comfort presenting complex information clearly and succinctly.\n\\n\nAdaptability & Growth Mindset\n: Eagerness to learn new tools, techniques, and approaches; enthusiasm for continuous improvement.\n\\n\nTeam Player\n: Collaborative spirit and willingness to support various teams and initiatives across the organization.\n\\n\nWork onsite\nat our Houston HQ office: 7676 Hillmont Street, Houston, TX 77040\n\\n\n\\n\nBenefits\n\\n\n\\n\nCareer Growth\n: Accelerated learning environment with opportunities to grow into more senior business analysis or data-focused roles.\n\\n\nDynamic Culture\n: Fast-paced, innovative workplace where new ideas are welcomed, and every team member’s contribution matters.\n\\n\nCompetitive Benefits\n:\n\\n\n\\n\n\\n\nDental, Health, and Vision Insurance\n\\n\nFlexible Schedule\n\\n\nPaid Time Off\n\\n\nProfessional development and networking opportunities\n\\n\n\\n\nSupportive Team\n: Work alongside passionate, driven colleagues who value creativity, collaboration, and a customer-centric mindset.\n\\n\n\\n\n\\n\nApply now to become part of the OptiSigns team and help us transform the digital signage landscape.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}