{
  "filename": "data_analyst_New_York__NY_page3_job10_Business_and_Social_Media_Data.html",
  "job_title": "Business and Social Media Data Analyst",
  "company": "NIGHTSEA INC",
  "location": "589 8th Avenue, New York, NY 10018",
  "salary": "$60,000 - $80,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T10:56:25.013Z",
  "full_description": "\\n\nPosition Summary:\n\\n\nWe are looking for an experienced TikTok Live Stream Operations Supervisor to lead our specialist team in New York. This role involves managing the setup and daily operations of live streams, optimizing viewer engagement, and driving brand growth on the TikTok platform. The ideal candidate will have strong operational and management skills, a deep understanding of TikTok’s guidelines, and the ability to develop and execute effective livestream strategies. They will work closely with cross-functional teams to enhance product visibility and brand reputation.\n\\n\nResponsibilities:\n\\n\n\\n\nTeam and Operations Management:\nOversee the setup and management of live streams in the U.S., including team supervision. Lead and manage the TikTok operations team, providing training, guidance, and performance evaluations.\n\\n\nPlatform Expertise:\nMaster TikTok live streaming procedures and equipment, managing daily brand live stream operations. Develop and execute comprehensive TikTok strategies to achieve business objectives and growth targets.\n\\n\nCompliance:\nEnsure adherence to TikTok's rules, avoiding prohibited content and sensitive topics. Monitor industry trends and TikTok policy updates to stay ahead and drive innovation.\n\\n\nContent and Strategy:\nDevelop effective live stream strategies, including product highlights, marketing scripts, supplier and host management, live script writing, user insights, data analysis, and strategy optimization. Oversee the planning, execution, and optimization of all TikTok activities and projects.\n\\n\nAudience Engagement:\nLeverage experience to increase live stream exposure and viewer numbers, maintaining a lively and orderly live stream environment, and handling emergencies effectively. Establish and maintain relationships with influencers, livestream agencies, and other partners.\n\\n\nPerformance Optimization:\nManage the entire live stream process, adjusting strategies in real-time based on TikTok backend data to optimize performance. Prepare and regularly report business summaries, providing actionable insights and recommendations to senior management.\n\\n\nCross-Department Coordination:\nCommunicate and collaborate across departments to ensure consistency and effectiveness in strategies, enhancing product sales, brand visibility, and reputation, and coordinating activities between domestic and North American teams.\n\\n\n\\n\nRequirements:\n\\n\n\\n\nLanguage Skills:\nProficiency in English and\nMandarin required\n.\n\\n\nExperience:\nOver 1 year of live stream operations experience; international experience and apparel project experience are advantages. Extensive experience with the TikTok platform.\n\\n\nSocial Media Knowledge:\nDeep understanding of Western social media, particularly TikTok, Instagram, and Meta; experience with social media strategies.\n\\n\nIndustry Experience:\nExperience in the fashion consumer goods industry; capable of brand collaboration, business communication, and business development.\n\\n\nCommunication Skills:\nExcellent cross-functional communication and coordination skills, proactive and resilient, capable of driving new business initiatives and rapid iterations. Outstanding communication and presentation skills.\n\\n\nLeadership:\nExcellent leadership and team management skills. Strategic thinking with the ability to develop and execute innovative marketing strategies.\n\\n\nAnalytical Skills:\nStrong analytical skills to interpret data and metrics to drive decision-making.\n\\n\nEnvironment:\nAbility to thrive in a fast-paced and dynamic environment.\n\\n\nLocation:\nBased in New York.\n\\n\n\\n\nBenefits/Perks\n\\n\n\\n\nHealthcare Insurance (Medical, Dental, Vision)\n\\n\nPaid Holidays\n\\n\nPTO\n\\n\nFlexible Schedule\n\\n\nCompetitive Pay\n\\n\nCareer Advancement\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}