{
  "filename": "data_analyst_New_York__NY_page7_job13_Data_Analyst_I.html",
  "job_title": "Data Analyst I",
  "company": "Sperry Rail",
  "location": "5 Research Drive, Shelton, CT 06484",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:15:04.160Z",
  "full_description": "\\n\n\\n\nSUMMARY OF POSITION\n:\n\\n\n\\n\n\\n  To process and analyze computer generated test data from detector cars; generate test data audits in accordance to company / client specification; assist in maintaining departmental procedures; processing customer special requests; and to assist in other departmental requirements as needed.\\n\n\\n\n\\n\nESSENTIAL FUNCTIONS\n:\n\\n\n\\n\n\\n\n\\n\nResponsibilities\\n\n\\n\n\\n\nProvide customer audit reports for violations in accordance with internal, client guidelines and procedures.\n\\n\nAssist in data review of service failure investigations, providing this information to the Quality Manager for processing.\n\\n\nMaintain customer and inter-company auditing requirements.\n\\n\nMaintain department measurable as assigned by the Quality Manager.\n\\n\nProvide test data analysis or comparison results as assigned by Quality Manager.\n\\n\nProvide analysis for new technology.\n\\n\nProvide tape comparisons for Chief Operator training class.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n  Objectives\\n\n\\n\n\\n\nTo maintain departmental response time to customer requirements or requests.\n\\n\nTo maintain the service capabilities of the department.\n\\n\nMaintain customer audit requirements.\n\\n\n\\n\n\\n\nMINIMUM REQUIREMENTS\n:\n\\n\n\\n\n\\n\nEducation: High School Diploma/GED.\n\\n\nSkills/Competencies: Communicate effectively, both orally and in writing.\n\\n\n\\n\nMaintain a relationship with the customer and follow up on all customer complaints. Always maintain a professional and positive attitude toward employees and customers.\n\\n\n\\n\n\\n\nORGANIZATIONAL RELATIONSHIPS/SCOPE\n:\n\\n\n\\n\n\\n\nInteracts at all levels within organization.\n\\n\nInteracts with customers personnel.\n\\n\nInteracts across departmental boundaries.\n\\n\nScope: Actions may have impact on customer relationships and financial condition of the Company.\n\\n\n\\n\n\\n  #indsr\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}