{
  "filename": "data_analyst_New_York__NY_page7_job9_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "Titan",
  "location": "25-56 31st Street, New York, NY",
  "salary": "$80,000 - $160,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:14:27.676Z",
  "full_description": "\\n\nAbout Titan\n\\n\nTitan is an award-winning wealth manager with a mission to increase our generation’s compound growth rate. We plan to do this by putting a human wealth advisor in every pocket. Historically, wealth managers have been accessible to only the ultra-wealthy. With Titan, they’re available to everyone. We harness frontier technologies like artificial intelligence to build a platform that gives advisors superpowers, enabling them to serve clients they historically never could. Backed by a16z, General Catalyst, Sam Altman, and many others, we manage over $1 billion in assets for clients across the country.\nWhy Join Titan\n\\n\nFor the right person, we believe Titan will be one of the most rewarding jobs they ever have.\n\\n\n\\n\nAmbitious Vision:\nWhen we put private wealth management in every pocket, we’ll make a legacy-defining impact in growing our generation’s wealth to new heights.\n\\n\nCritical Why Now:\nThe advent of LLMs unlocks our vision to democratize personalized wealth management for everyone. This drives our urgency every day.\n\\n\nDisproportionate Impact:\nWe’re still at the beginning of our journey with a small team, which means your impact at Titan will disproportionately matter.\n\\n\nVibrant In-Person Culture:\nWe thrive on being a high-touch team, working together in the trenches in person (you’ll see our founders in office every day).\n\\n\nCompensation:\nTitan offers competitive cash compensation and well-above-market equity packages because we want every team member to be an owner.\n\\n\nWorld-Class Investors:\nWe’re backed by top investors who share our bold vision, including a16z, General Catalyst, Y Combinator, and Sam Altman.\n\\n\n\\n\nRole Overview\n\\n\nThe\nData Analyst\nrole sits at the heart of how we make decisions, measure progress, and uncover opportunity. Your mission is to transform raw data into clarity, building the systems, tools, and insights that guide strategy across the business.\n\\n\nThis isn’t just about dashboards or reports, it’s about architecting the flow of information that fuels every team, from Product to Finance. You’ll design and maintain the pipelines and models that power our analytics stack, ensuring our data is not only accurate and accessible, but deeply actionable.\n\\n\nYou’ll operate at the intersection of engineering precision and business intuition: comfortable writing complex SQL one moment, then distilling findings into a clear narrative for leadership the next. You’ll push the organization toward a truly data-driven culture, one where insights are timely, trusted, and tied to real impact.\n\\n\nWhat You’ll Do\n\\n\n\\n\nDesign and maintain\nETL workflows\nthat move and transform data between multiple systems to power business intelligence dashboards.\n\\n\nWork extensively with\nRedshift\nto model and optimize data structures for reporting and analytics.\n\\n\nTranslate and work with\nNoSQL\ndata sources, ensuring smooth integration with other data platforms.\n\\n\nBuild, automate, and monitor data pipelines using tools like\nFivetran, Hightouch, Segment, and Stitch\n.\n\\n\nCollaborate with business teams — including Finance, Product, and Operations — to identify data needs and transform business questions into analytical solutions.\n\\n\nSupport financial reporting and analytics by applying your understanding of\naccounting and finance-related concepts\n.\n\\n\nCreate and maintain dashboards in tools such as\nOmni, Mode, and Mixpanel\n, ensuring teams have accurate and timely visibility into KPIs.\n\\n\nPartner with engineering to ensure data consistency, documentation, and governance across systems.\n\\n\nAdvocate for and contribute to the development of a\ndata-driven organizational culture\n.\n\\n\n\\n\nQualifications\n\\n\n\\n\nMust come from a startup, fintech, or similarly fast-paced, high-growth environment.\n\\n\nStrong proficiency in\nSQL\n, with a deep understanding of data modeling, query optimization, and performance tuning in\nRedshift\n.\n\\n\nExperience\ndesigning and maintaining ETL workflows\nthat connect multiple data sources and ensure data integrity.\n\\n\nComfortable working with\nNoSQL data\nand integrating it into analytics pipelines.\n\\n\nFamiliarity with\nAWS ecosystem\nservices and best practices for data storage, transformation, and access.\n\\n\nScripting experience (e.g., Python, SQL scripts) and familiarity with\nversion control\n(e.g., Git).\n\\n\nSkilled at working with cross-functional teams to identify business opportunities and deliver measurable impact.\n\\n\nExperience analyzing and visualizing\nfinance and accounting data\npreferred.\n\\n\nStrong communication and data storytelling skills — able to make complex analyses clear and actionable.\n\\n\n\\n\nTechnologies We Use\n\\n\nRedshift • Omni • Mode • Fivetran • Hightouch • Zapier • Segment • Stitch • Fullstory • Mixpanel\n\\n\nCompensation Range: $80K - $160K\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=0194a2bd5c3d7f9d&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfo1hnsi8qp803&spon=0&xkcb=SoCA67M3pv4J5G2EiJ0CbzkdCdPP&xfps=8f93fa96-ac3a-43e2-b704-2e7058dd8666&vjfrom=vjs&asub=mob&astse=7a7bf0cc486ba833&assa=8024"
}