{
  "filename": "data_analyst_New_York__NY_page14_job5_Encompass_Analyst_5.html",
  "job_title": "Encompass Analyst-5",
  "company": "Realign LLC",
  "location": "Stamford, CT",
  "salary": null,
  "job_type": "Contract",
  "scraped_at": "2025-12-27T11:29:47.814Z",
  "full_description": "\\n\nJob Type: Contract\n\\n\nJob Category: IT\n\\n\n\\n\n\\n\nJob Title:\nEncompass Analyst\nLocation: Stamford, CT (Onsite)\nContract\nPosition Summary:\n\\n\n\\n\nThe\nEncompass Analyst\nis responsible for supporting, maintaining, and enhancing the Ellie Mae Encompass Loan Origination System (LOS). This role ensures system efficiency, compliance, and alignment with business needs across the lending lifecycle. The analyst will collaborate with end users, IT, and business leaders to configure workflows, troubleshoot system issues, and support process improvements that optimize loan operations.\n\\n\nKey Responsibilities:\n\\n\n\\n\nServe as the primary point of contact for Encompass system inquiries, troubleshooting, and user support.\n\\n\nConfigure and maintain Encompass settings, including loan templates, fields, input forms, business rules, personas, and workflows.\n\\n\nCollaborate with loan operations, underwriting, compliance, and secondary teams to enhance processes and ensure system compliance.\n\\n\nManage system updates, test new Encompass releases, and coordinate implementation with stakeholders.\n\\n\nDevelop and maintain custom reports, dashboards, and analytics to support business operations and performance tracking.\n\\n\nSupport integrations with third-party vendors (DU, DO, LQI, MERS, Fannie Mae, Freddie Mac, etc.).\n\\n\nMaintain system documentation, procedures, and user training materials.\n\\n\nWork with IT and compliance teams to ensure data integrity, security, and adherence to lending regulations.\n\\n\nParticipate in project planning, requirement gathering, and testing for new Encompass features or system enhancements.\n\\n\n\\n\n\\n\nRequired Skills\n\\n\nDATA ANALYST\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=c2ea03b53741ebaf&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfp3d75l0258c6&spon=0&xkcb=SoDE67M3pv6CdcW0BR0ObzkdCdPP&xfps=ad6c14ce-b0e7-4186-977b-96b65d68808a&vjfrom=vjs&asub=mob&astse=6027e98d40acc710&assa=8249"
}