{
  "filename": "data_analyst_New_York__NY_page5_job14_Operations___Regulatory_IT_Bus.html",
  "job_title": "Operations & Regulatory IT Business Analyst (Calypso, Trace)",
  "company": "Natixis CIB North America",
  "location": "New York, NY",
  "salary": "$115,000 - $180,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:00:37.773Z",
  "full_description": "\\n\nPoste et missions\n\\n\nPosition Summary\n\\n\nJoin our dynamic Global Markets & Risks IT team, where you'll play a pivotal role in driving innovation for post-trade and regulatory applications. We support crucial areas such as Equity Derivatives, Securities Lending, Global Macro (Rates, FX, Commodities), and Credit Front Office across various support functions. Our team thrives in an agile environment, engaging in all facets of application development—from user needs analysis to design, implementation, delivery, support, and maintenance.\n\\n\nWe are on the lookout for several enthusiastic IT Business Analysts to enhance our Operations in the following areas:\n\\n\n\\n\nCollateral Management and Cash Management\nin both external and internal applications (e.g., Calypso)\n\\n\nTransactional Regulatory Reporting\n(including TRACE, 15a6)\n\\n\n\\n\nIn this role, you will engage in business analysis to implement innovative features within our applications and provide functional support to our end-users in Operations. You will collaborate closely with Operations, Compliance, and global IT teams, leveraging your solid knowledge of financial products to make a significant impact.\n\\n\nKey Responsibilities\n\\n\nBusiness Analysis / Project Management:\n\\n\n\\n\nPartner with user representatives (traders, operations, compliance) to gather and document business requirements.\n\\n\nConduct comprehensive impact and gap analyses.\n\\n\nAssess and recommend IT solutions that align with business needs.\n\\n\nCreate detailed functional specifications for our IT development teams.\n\\n\nDefine and execute thorough test scripts.\n\\n\nCoordinate User Acceptance Testing (UAT) to ensure optimal functionality.\n\\n\nAssist in project scoping and planning, progress reporting, and managing issues and risks, promoting effective communication throughout.\n\\n\n\\n\nFunctional Support / Maintenance:\n\\n\n\\n\nProvide day-to-day support for Booking and Back Office applications, including collateral management, cash management, straight-through processing, settlement, clearing, reporting, and accounting.\n\\n\nOffer ongoing support for Transactional Regulatory Reporting applications, including TRACE reporting.\n\\n\n\\n\n\\n\nThe salary range for the Associate position will be between $115,000 - $145,000. Natixis is required by law to include a reasonable estimate of the compensation range for this role. Actual base salary will vary and will be based on several factors including, but not limited to, relevant experience, education, skills set, applicable licensure and certifications, and other business and organizational needs. Base salary is only one component of our total rewards package. Natixis also offers a generous benefits package, and you may be eligible for a discretionary incentive award depending on company and individual performance.\n\\n\n\\n\nThe salary range for the VP position will be between $145,000 - $180,000. Natixis is required by law to include a reasonable estimate of the compensation range for this role. Actual base salary will vary and will be based on several factors including, but not limited to, relevant experience, education, skills set, applicable licensure and certifications, and other business and organizational needs. Base salary is only one component of our total rewards package. Natixis also offers a generous benefits package, and you may be eligible for a discretionary incentive award depending on company and individual performance.\n\\n\nProfil et compétences requises\n\\n\nBachelor’s Degree in Computer Science, Finance, or a related field.\nProven experience in IT business analysis within the finance industry, focusing on Operations and Regulatory topics.\nSolid understanding of equity and fixed income activities related to collateral and cash management, as well as transactional regulatory reporting.\nFamiliarity with a variety of financial products (e.g., Structured Products, Equity Options, Securities Lending, TRS, Repo, Interest Rate Derivatives, Credit Bonds, CLO) and their trading workflows.\nExperience with Collateral and Cash Management systems (e.g., Calypso or equivalent), Broker Dealer systems (e.g., Phase 3/Shadow Suite), and trading systems such as Sophis or Smart Loan.\nUnderstanding of TRACE Reporting requirements.\nKnowledge of SQL is a plus.\nStrong analytical and problem-solving proficiency.\nDetail-oriented and highly organized.\nFamiliarity with Agile practices and methodologies is a bonus.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=eea8a95166204cff&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnbj48jn1a803&spon=0&xkcb=SoCA67M3pvmhsM20BR0FbzkdCdPP&xfps=9a516e7c-8908-469e-8893-991bb4fb9ecf&vjfrom=vjs&asub=mob&astse=47a32780300dbcfe&assa=2834"
}