{
  "filename": "data_analyst_New_York__NY_page10_job6_SYSTEM_ANALYST.html",
  "job_title": "SYSTEM ANALYST",
  "company": "Formosa Plastics Corporation, USA",
  "location": "9 Peach Tree Hill Road, Livingston, NJ 07039",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:21:12.187Z",
  "full_description": "Company Overview for Formosa Plastics Corporation, U.S.A.\nFounded in 1978, Formosa Plastics Corporation, U.S.A. (Formosa Plastics) is a growing, vertically-integrated supplier of plastic resins and petrochemicals. With annual revenues of more than $5 billion, we employ over 2,800 people who operate 20 production units in six business divisions - Olefins, Polyolefins, Vinyl, Specialty Polyvinyl Chloride, Chlor-Alkali, and Oil & Gas.\nFormosa Plastics offers a full line of polyvinyl chloride, polyethylene and polypropylene resins, caustic soda and other petrochemicals that deliver the consistency, performance and quality that customers demand. We market our polypropylene and polyethylene resins under the Formolene® tradename; we market our suspension PVC and specialty (dispersion) PVC resins under the Formolon® tradename. We also produce and sell caustic soda, ethylene dichloride, commercial bleach and hydrochloric acid.\nWe are committed to supplying the highest quality products and services to our customers, providing a safe and healthy workplace for our employees and contributing to the quality of life in the communities where we operate. This commitment is made possible through our dedicated people, consistent products, continued protection of the environment and ongoing investments in new product development, quality control systems and safe, modern and energy-efficient production facilities.\nFormosa Plastics is a privately held company headquartered in Livingston, New Jersey. Our core business, producing plastic resins and petrochemicals, takes place at three wholly-owned chemical manufacturing subsidiaries located in Delaware City, Delaware, Baton Rouge, Louisiana and Point Comfort, Texas.\nSYSTEM ANALYST\nPOSITION OBJECTIVE\n1. Use CLP, RPG, SQL,WebSmart and SYNON/2E at AS400 to maintain/develop Time Clock, Payroll, and HR related systems.\n2. To analyze user requirements and work with Business Analyst to design and/or improve application and/or supporting system.\n3. To ensure data integrity of application and supporting systems related.\n4. To develop and test the code.\n5. Work efficiently to meet the project deadlines.\nMAJOR AREAS OF ACCOUNTABILITY\n1. Work with Business Analyst to analyze user requirements.\n2. According to user requirements and company standards to develop program specifications for programmers to program application system.\n3. Monitor abnormal reports generated by application and supporting systems and respond abnormalities for Manager’s attention.\n4. Ensure data and system integrity for all application and supporting systems related.\n5. Improve application and supporting systems to meet team and department goals.\n6. Monitor application and supporting systems and trouble shoot system abnormalities.\n7. Assigned the responsibilities of off-hours duty:\nOn-duty employee is required to be available and handle problems according to SOPs.\n8. Review, process and complete work requisition according to SOPs.\n9. Trouble shoot system problems ASAP for monthly and/or daily closing.\n10. Test the programs to ensure that the results of system perform as they are defined.\n11. Ensure sufficient application system documents necessary for system maintain and user training as defined by the company policy or procedure.\n12. Train users and reply users’ questions.\n13. Perform additional project or jobs assigned by the manager.\nQUALIFICATIONS\n1. 1 year experience of on line programming.\n2. Programming skills including following languages:\nAllFusion 2E, CLP, RPG, SQL\n3. 4-Year college degree required.\nMIS/Computer Science/ Business/Accounting related majors and/or advance degree preferred.\nCheck Out Our Benefits\nHealth Coverage and Perks\nExcellent medical, dental, and vision insurance plans\nFlexible spending accounts for health, dependent care\nShort-term Disability\nLong-term Disability\nGroup Term Life, Dependent and\nSupplemental Life Insurance\nTuition Reimbursement\n​​​​​​​\nWork/Life Balance\n10 Paid Holidays\nPaid Time Off for a balanced life\n(Vacation, Sick and Personal Time)\nFlexTime Available\nCompetitive Compensation\nCompetitive salary, incentive/bonus, 401(k) plan with company match,\nCash Balance, Pension Plan",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=17d70065392d1247&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoj3k62dir088&spon=0&xkcb=SoC167M3pv5DoOyJaB0NbzkdCdPP&xfps=e5118fcc-66c8-4d01-a24c-7cfbb8e1e02d&vjfrom=vjs&asub=mob&astse=f6c1c57fa06ca730&assa=2545"
}