{
  "filename": "data_analyst_New_York__NY_page8_job1_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "BTI Solutions, Inc.",
  "location": "85 Challenger Road, Ridgefield Park, NJ 07660",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:15:31.121Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nWhy work with us?\n\\n\n\\n\nProven people.\n\\n\n\\n\n\\n\nEveryone on our team has earned a CPC (Certified Personnel Consultant) or CTS (Certified Temporary Staffing Specialist) accreditation from the National Association of Personnel Services. We are experts at staffing and recruiting with more than 16 years of experience serving employers.\n\\n\n\\n\nProven process.\n\\n\n\\n\n\\n\nOur approach to staffing isn’t just a little bit different; it’s a whole different ball game. While most staffing firms emphasize transactional services (taking and filling job orders), BTI Solutions focuses on providing more strategic solutions.\n\\n\nBy acting as workforce consultants, we are able to find innovative and intelligent strategies for improving productivity, meeting project deadlines, improving hiring quality, decreasing turnover, and reducing total labor costs.\n\\n\nOur recruiting and candidate assessment process assures the highest quality matches between job seeker and employer, so you will get people who not only have the right qualifications but who also have the appropriate personality fit for your organization.\n\\n\n\\n\nProven results.\n\\n\n\\n\nMore than anything, the biggest difference with BTI Solutions is the one that matters most: bottom-line results.\n\\n\n\\n\n95% client satisfaction rate\n– measures client satisfaction vs. expectations.\n\\n\nOur\nclients have worked with us for over 10 years\n, on average.\n\\n\nBTI Solutions counts\n4 Global Telecommunication companies as clients.\n\\n\nClient referrals\nare BTI Solutions’\nlargest source of new clients.\n\\n\nGoogle Review 4.4, Facebook Review 4.8\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nBusiness Analyst\\n\nResponsibilities:\n\\n\n\\n\nGather and analyze customer requirements for technology implementation projects\n\\n\nConduct interviews and workshops in both Korean and English\n\\n\nDocument functional and technical requirements with bilingual clarity\n\\n\nDevelop future-state process documentation and detailed functional specifications\n\\n\nFacilitate meetings and presentations with stakeholders in Korean and English\n\\n\nPrepare UAT test cases and support customers during user acceptance testing\n\\n\nMonitor project deliverables and ensure timely completion\n\\n\nProvide guidance, training, and support to end users after system deployment\n\\n\nSupport proposal and pre-sales activities when required\n\\n\n\\n\n\\n\nRequirements:\n\\n\n\\n\nBachelor’s degree or higher\n\\n\n10+ years of experience in system development projects or related fields\n\\n\nBilingual fluency in Korean and English (speaking, reading, and writing required)\n\\n\nStrong documentation skills using Excel, Word, and PowerPoint\n\\n\nExcellent presentation and communication skills\n\\n\nProven ability to follow through on commitments and meet deadlines\n\\n\nExperience supporting or leading short-term system development projects (3–12 months), preferred\n\\n\nDeep understanding of the Software Development Lifecycle (SDLC)\n\\n\nAbility to travel within the U.S. (30% or more as needed)\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}