{
  "filename": "data_analyst_Houston__TX_page1_job11_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "Grenza",
  "location": "10333 Harwin Drive, Houston, TX 77036",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:44:33.933Z",
  "full_description": "\\n\nDescription:\nBusiness Analyst to Interact with clients in Requirement gathering, Analysis, Design, Development and Testing. Responsible for promotional requirement and technical details gathering. Work with business stakeholders to prioritize change requests and gather requirements. Design Process flow charts and document Business requirements and functional requirements. Translating customer/business requirements into technical specification. Troubleshooting and finding multiple solutions to complex problems. Generate customized reports and build dashboards according to the requirements using Salesforce, Tableau, MS Excel, MS Visio, etc. Provide Continuous real-time production support for existing critical applications and for all further enhancements. Involve in customizing and developing SharePoint solutions in a manner that fulfils business opportunities. Build reports using excel web services in SharePoint. Create and repaired simple to complex workflows using SharePoint Designer 2007, 2010 and 2013 and Nintex workflows. Manage SharePoint application questions, requests, and other problems requiring issue resolution escalated by SharePoint end-users. Assist business to determine security settings and set up SharePoint authentication. Responsible for managing security and assign permissions to users and groups. Create significant documentation for workflows, custom content types and custom list forms. Propose and deploy multiple 3rd party tools like KwizCom, Nintex and SP Easy forms. Migrate of documents form to SharePoint. Create SharePoint groups and given different permission level for lists and libraries. Approve routing of documents using SharePoint Designer. Key contribution in transferring of customer requirements into formal requirements and design documents, establishes specific solutions, and leading the efforts including programming and testing that culminate in client acceptance of the results. Create reports sites, list and document library. Involve in building reports in SQL and integrated to SharePoint\n\\n\n\\n\nRequired\n: Bachelor’s or higher degree in Computer Science, Computer Information Systems, Software Engineering, Information Technology, Computer Applications or a related field, or its equivalent, related to this field of work and the necessary competencies.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSend Resumes to HR, Grenza Inc., 10333 Harwin Dr, Ste 385, Houston, TX 77036.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=632352b1d5d5376c&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfme75aj73689f&spon=0&xkcb=SoDB67M3pvk3MbRbpp0AbzkdCdPP&xfps=65b98408-2037-422a-b228-09759a4880a4&sjdu=Rs-RFJYUFBMrL_kzfEoo3rJEhFRjByqtts0dspNeoViHywvLZar3j78yWiwpzZna&vjfrom=vjs&asub=mob&astse=772cfce1a147f827&assa=4265"
}