{
  "filename": "data_analyst_Houston__TX_page1_job12_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "Tech-Apex Solutions",
  "location": "Houston, TX",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:44:44.257Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\nAt Tech-Apex, job opportunities abound within our growing system for IT professionals alike. We promote from within whenever possible, and are committed to providing benefits and programs that support our team member's careers and personal development. Our in-depth expertise in numerous verticals gives you the opportunity to pick up skills in diverse areas. We help you add value to yourself in a healthy environment that catalyzes professional growth.\n\\n\nYou would be the part of a dynamic team that synergies efforts to help you deliver your best. At Tech-Apex, we give our people the opportunity to be their most creative and proactive. Our expertise goes beyond ‘delivering value’ to clients – into harnessing the talent of our people and giving them room to grow. We have created an environment conducive to learning. Our supportive team will help you realize your full potential.\n\\n\nIf you have the vision to grow, and the desire to go beyond the mediocre, meet us.We look forward to welcoming you as part of our team!\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDefining, analyzing, and documenting user requirements, procedures, problems and leading joint design efforts to offer a new solution or value proposition to customers, automate processing or to improve existing business processes and associated information systems. The Business Analyst will also be responsible for defining the appropriate methodologies and best practices for performing business analysis and design in the support of core organizational functions and business processes. This role requires a deep understanding of file sharing and collaboration platforms.\n\\n\n\\n\nMinimum Education: Bachelor's Degree required.\n\\n\n\\n\n\\n\nLocation:\nHouston\\n\n\\n\n\\n\nPlease send your updated resumes to hr@tech-apex.com",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=a02f772ca4e2ed7a&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfme75aj73689f&spon=0&xkcb=SoBP67M3pvk3MbRbpp0HbzkdCdPP&xfps=f46ddf16-27fc-4c98-a0cf-323dcaf23e61&sjdu=KyglkpbUIfjA9jZhklKf7Ex9SwNAVT_Biv7I4EUs9Hm4iPjKnpugfV4VF_1iYX2q&vjfrom=vjs&asub=mob&astse=d9ab54cf5cad01f9&assa=4533"
}