{
  "filename": "data_analyst_New_York__NY_page1_job7_Analyst.html",
  "job_title": "Analyst",
  "company": "Orgvue",
  "location": "Philadelphia, PA•Hybrid work",
  "salary": "$38,000 - $40,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:52:24.558Z",
  "full_description": "Orgvue is a leading organizational design and planning software platform that captures the power of data visualization and modelling to build more adaptable, and better performing organizations. HR, finance and business leaders use Orgvue for actionable insight and analysis that helps them make faster workforce decisions in a constantly changing world.\nOrgvue is used by the world’s largest and best-known enterprises and management consulting firms to visualize and confidently build the businesses they want tomorrow, today. The company is headquartered in London, with offices in Philadelphia, The Hague, Toronto, and Sydney.\nWe are seeking an Analyst who must be able to work with diverse teams and build strong and trusted client relationships at the appropriate level.\nRole\nIn this role you will be advising and working with clients' senior leaders and their teams in using Orgvue and will require an appetite for new thinking, application of methodologies and analytical tools. You will be the driving force behind client projects. By understanding business needs and challenges, you will transform business operating models with the latest analytical tools and techniques.\nResponsibilities\n\\n\n\\n\nBe part of the client engagement team and create trusted relationships at the appropriate level to solve key business problems by combining your experience, data and Orgvue’s capabilities.\n\\n\nDeliver all aspects of our advisory projects that includes implementing technical data architecture solutions, designing and building insightful analytics dashboards and visualizations and working with our clients to help build their Organizational Planning & Analysis (OP&A) capabilities.\n\\n\nConduct Data-Driven Organizational Design (DDOD) by delivering analytical insights on the current business through data capture, analysis and storytelling and supporting our clients in tracking and monitoring changes to their workforce over time.\n\\n\nAdvise and train clients on how they can best utilize Orgvue to deliver operational and strategic business objectives.\n\\n\nRequirements:\n\\n\n\\n\nYou’re excited by the prospect of joining a rapidly growing international company with a highly successful North America division.\n\\n\nYou’re interested in building consulting skills within the HR/OD analytics space.\n\\n\nYou want to make a fundamental difference to some of the largest organizations and household names across North America.\n\\n\nYou really enjoy solving problems. You love taking on difficult challenges and finding creative solutions\n\\n\nBachelors Degree Required, ideally in Information Sciences or Business Studies\n\\n\nExcellent knowledge of Microsoft Office, including Excel and PowerPoint.\n\\n\nData analysis skills essential; knowledge of statistics modelling is preferred.\n\\n\nExperience with analytics tool such as Tableau, SQL, R, Python or MATLAB is a plus.\n\\n\nClient-facing experience is a plus.\n\\n\nBenefits:\n\\n\n\\n\nHybrid role - 1 day a week in the Philadelphia office\n\\n\n5% matched 401k\n\\n\nWellbeing: Sanctus Coaching, Headspace mindfulness app, Virtual fitness sessions, Wellbeing webinars, Annual Wellbeing day\n\\n\nSummer Fridays (half day Fridays for the months of July and August)\n\\n\n25 days paid vacation (plus 1 extra day for every year of employment up to a maximum of 30 days)\n\\n\nHealthcare premiums 100% paid by employer for majority of plans including family, dental and vision\n\\n\nCompetitive commission structure\n\\n\nEligible for Transaction Bonus\n\\n\nHere at Orgvue we promote individualism and a diverse workforce to build on our future success",
  "apply_method": "indeed_apply",
  "apply_url": null
}