{
  "filename": "data_analyst_Houston__TX_page1_job3_Program_Data_Specialist.html",
  "job_title": "Program Data Specialist",
  "company": "Bakerripley",
  "location": "4450 Harrisburg Boulevard, Houston, TX 77011",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:43:16.515Z",
  "full_description": "\\n\nPOSITION OVERVIEW\n\\n\nThe Program Data Specialist is responsible for collection, management and reporting of programmatic data across multiple programs. This role involves data entry, validation, and reporting across internal and external databases where program data are housed and reported for internal stakeholder and funders. This position acts as the program data subject matter expert and works alongside the Data Analyst/Manager to develop dashboards, reports, and other analytics that highlight the impact of our programs.\n\\n\nEssential Functions\n\\n\nProgram Data\n\\n\n\\n\nMaintains internal and external client databases and reconciles any variances.\n\\n\nPulls data reports from internal and external data sources for data reporting and KPI measures.\n\\n\nAudits client data for accuracy and makes necessary corrections.\n\\n\nMaintains programmatic output and outcomes reports.\n\\n\nCreates and maintains program dashboards.\n\\n\n\\n\nCompliance & Program Integrity\n\\n\n\\n\nEnsures compliance with all program contracts, grant requirements, and funding guidelines as it pertains\n\\n\n\\n\nto client data management.\n\\n\n\\n\nWorks with support services to ensure funder reports and billing reports are completed on time and\n\\n\n\\n\naccurately.\n\\n\nProgram Area Support & Collaboration\n\\n\n\\n\nAssists the Data Analyst/Manager in the creation of dashboards, and other data analysis tools that help\n\\n\n\\n\ninform program leaders and tell the story of the program impact.\n\\n\n\\n\nAttends and serves as a contributing member to the Data Community of Practice group.\n\\n\nWorks with management to prioritize business and information needs.\n\\n\nCollaborates with end users and team members to identify opportunities for improvement.\n\\n\nProfessionally represents the Agency to outside stakeholders and funders.\n\\n\n\\n\n\\n\nRequired for All Jobs\n\\n\n\\n\nPerforms other duties as assigned\n\\n\nComplies with all policies and standards\n\\n\n\\n\nPREFERRED/ REQUIRED QUALIFICATIONS\n\\n\nEducation\n\\n\nEducation Level Education Details Required/ Preferred\n\\n\nBachelor's\n\\n\nDegree from four-year college or university or equivalent combination of education and experience Required\n\\n\n\\n\nWork Experience\n\\n\nExperience Experience Details Required/ Preferred\n\\n\n1-3 Years Working with client data systems or in a data related field Preferred\n\\n\n\\n\nKnowledge, Skills and Abilities\n\\n\nKSAs Proficiency\n\\n\nExcellent written, oral, and interpersonal skills. Advanced\n\\n\nAbility to define problems, collect data, establish facts, and draw valid conclusions. Intermediate\n\\n\nAbility to define realistic, specific goals and objectives and to prioritize objectives. Intermediate\n\\n\nStrategic thinker with a collaborative mindset and attention to detail. Intermediate\n\\n\nSkilled in balancing multiple projects and priorities while meeting deadlines. Intermediate\n\\n\nRelationship builder with a passion for community impact. Intermediate\n\\n\nCOMPUTER PROFICIENCY:\n\\n\n\\n\nMicrosoft Office Suite\n\\n\nPower BI\n\\n\nSQL\n\\n\nClient Management Systems (eg. CRMs) Intermediate\n\\n\n\\n\nLANGUAGE REQUIREMENTS:\n\\n\n\\n\nEnglish written and verbal Advanced\n\\n\n\\n\n\\n\nLicenses and Certifications\n\\n\nLicenses/Certifications Licenses/Certification Details Time Frame Required/ Preferred\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=7f0f874d45f83991&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfme75aj73689f&spon=0&xkcb=SoCm67M3pvk3MbRbpp0IbzkdCdPP&xfps=ff69a1df-463f-4d43-b3f3-d91f1a513a46&vjfrom=vjs&asub=mob&astse=3fbfd6658cab8017&assa=6810"
}