{
  "filename": "data_analyst_New_York__NY_page6_job8_Investment_Banking_Division___.html",
  "job_title": "Investment Banking Division - Technology Business Analyst / Associate - New York or Menlo Park",
  "company": "Morgan Stanley",
  "location": "1585 Broadway Avenue, New York, NY 10036",
  "salary": "$110,000 - $225,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:01:50.598Z",
  "full_description": "\\n\n\\n\nWe are seeking a Business Analyst or Associate in the Investment Banking Division to help create, manage, and drive adoption of technology tools within the Investment Banking Division. The ideal candidate will have an understanding of financial services, strong technology and project management skills, and a passion for AI, innovation, and problem solving.\n\\n\n\\n\nCore Responsibilities:\n\\n\n\\n\nProduct management:\nSupport Product Leads with product life cycle management, including collection of requirements, feasibility studies, design, development, validation, onboarding, pilot, and production. Ability to handle multiple project priorities simultaneously.\n\\n\nProduct development:\nGain a deep understanding of business stakeholder requirements and collaborate with Product Leads and IT teams to address roadblocks and manage projects to meet aggressive deliverable deadlines. Play a key role in articulating detailed requirements and acceptance criteria.\n\\n\nProject management:\nFacilitate meetings by developing and distributing agendas, following up with meeting notes, and tracking progress/action items. Create presentations to update team on project status and strategy.\n\\n\nPrompt/Agents development:\nCreate, validate, deploy, and market advanced AI prompts/agents to bankers. Gather requirements for agentic workflows that can make the bankers more productive and informed.\n\\n\nCollaboration:\nWork closely with Product Leads, IT, Strats, Bankers, Risk, Compliance, Legal, Senior Management to gather feedback, incorporate edits, and ensure timely communication of updates to drive end-to-end delivery of initiatives. Be the center of gravity for products and closely communicate product objectives and status to partners within and outside of the Investment Banking/Global Capital Markets division.\n\\n\nInnovation:\nStay up to date with latest technological advancements to continuously improve existing systems and incorporate new innovations such as AI. Test and evaluate new AI tools and prompts, recommending optimal solutions based on performance and output quality.\n\\n\nContinuous improvement:\nMonitor quality and proactively request feedback to drive continuous improvement of products. Be customer-obsessed with designing the most end-user friendly tools that enable bankers to be more effective and efficient in their work.\n\\n\n\\n\n\\n\nQualifications:\n\\n\n\\n\nBachelor’s degree in Finance/Economics, Computer Science/Engineering, or similar field.\n\\n\n1+ years of work experience in financial services, consulting, technology, or investment banking experience preferred.\nKnowledge of investment banking workflows - such as capital markets and M&A \\n\n- and corporate finance highly desirable.\n\\n\nExperience with prompt engineering, software development, software product/project management a plus.\n\\n\nStrong written, verbal and interpersonal skills, including the ability to interact effectively with business stakeholders to understand the business and gather requirements\n\\n\nHighly detail-oriented and strong organizational skills to manage and execute simultaneous projects and tasks\n\\n\nAutonomous, self-motivated, with a high level of initiative, ability to think strategically and independently. Strong work ethic and a positive attitude. Highly responsive and communicative. Investment Banking is a client services industry and our clients need our advice and expertise around the clock.\n\\n\nComfort working with ambiguity, managing and resolving complex issues\n\\n\n\\n\n\\n\n\\n\nWHAT YOU CAN EXPECT FROM MORGAN STANLEY:\n\\n\n\\n\nAt Morgan Stanley, we raise, manage and allocate capital for our clients – helping them reach their goals. We do it in a way that’s differentiated – and we’ve done that for 90 years. Our values - putting clients first, doing the right thing, leading with exceptional ideas, committing to diversity and inclusion, and giving back - aren’t just beliefs, they guide the decisions we make every day to do what's best for our clients, communities and more than 80,000 employees in 1,200 offices across 42 countries. At Morgan Stanley, you’ll find an opportunity to work alongside the best and the brightest, in an environment where you are supported and empowered. Our teams are relentless collaborators and creative thinkers, fueled by their diverse backgrounds and experiences. We are proud to support our employees and their families at every point along their work-life journey, offering some of the most attractive and comprehensive employee benefits and perks in the industry. There’s also ample opportunity to move about the business for those who show passion and grit in their work.\n\\n\n\\n\nTo learn more about our offices across the globe, please copy and paste https://www.morganstanley.com/about-us/global-offices into your browser.\n\\n\n\\n\nExpected base pay rates for the role will be between $110,000 and $125,000 for an Analyst, and between $150,000 and $225,000 for an Associate, per year at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.\n\\n\n\\n\nMorgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees.\n\\n\n\\n\nIt is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law.\n\\n\n\\n\nMorgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=fc4298f41cfc61eb&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnfc72293c07e&spon=0&xkcb=SoDO67M3pvmyVWACJ70DbzkdCdPP&xfps=821de461-b50c-4093-be78-101749f9083e&vjfrom=vjs&asub=mob&astse=16361636cdaa8f76&assa=5314"
}