{
  "filename": "data_analyst_Houston__TX_page2_job5_Epic_Business_Analyst_I.html",
  "job_title": "Epic Business Analyst I",
  "company": "Harris Health System",
  "location": "Bellaire, TX",
  "salary": "$61,713.60 - $78,686.40 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:45:52.358Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\nHarris Health System is the public healthcare safety-net provider established in 1966 to serve the residents of Harris County, Texas. As an essential healthcare system, Harris Health champions better health for the entire community, with a focus on low-income uninsured and underinsured patients, through acute and primary care, wellness, disease management and population health services. Ben Taub Hospital (Level 1 Trauma Center) and Lyndon B. Johnson Hospital (Level 3 Trauma Center) anchor Harris Health’s robust network of 39 clinics, health centers, specialty locations and virtual (telemedicine) technology. Harris Health is among an elite list of health systems in the U.S. achieving Magnet® nursing excellence designation for its hospitals, the prestigious National Committee for Quality Assurance designation for its patient-centered clinics and health centers and its strong partnership with nationally recognized physician faculty, residents and researchers from Baylor College of Medicine; McGovern Medical School at The University of Texas Health Science Center at Houston (UTHealth); The University of Texas MD Anderson Cancer Center; and the Tilman J. Fertitta Family College of Medicine at the University of Houston.\n\\n\n\\n\n\\n\nJob Summary\nEpic Business Systems Analyst I\nensures that the operational interests of their respective functional areas are being fully represented in the day-to-day operations of the Information Technology Department. This role supports the Epic applications deployed within Harris Health System.\nMinimum Qualifications\nEducation/Specialized Training/Licensure:\nBachelors degree OR High School Diploma or GED (AND) Four (4) years of related experience in a Healthcare environment.\nWork Experience:\nOne (1) Year Work Experience in Hospital/Health Care Organizations. (Preferred)\nCommunication Skills:\nAbove Average Verbal (Heavy Public Contact)\nExceptional Verbal (e.g., Public Speaking)\nWriting / Correspondence\nWriting / Reports\nJob Attributes\nKnowledge/Skills/Abilities: Analytical, Design, Research, Statistical\nWork Schedule: On Call, Eligible for Telecommute\nOther Requirements: Be available to work on site or remotely (after hours) as needed.\nExperience in a hospital or clinic setting preferred. Experience supporting an Electronic Medical Record System preferred.\nHealthcare Information Technology experience preferred.\nUnderstanding of functional processes and business rules related to the applications being implemented/supported.\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=48340242c2ec77e8&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfmissbl03785n&spon=0&xkcb=SoAX67M3pvlEerygL50ObzkdCdPP&xfps=1e43c8f2-608c-4660-85b3-bf439cb522f5&vjfrom=vjs&asub=mob&astse=8e2395097608b9dc&assa=2627"
}