{
  "filename": "data_analyst_New_York__NY_page12_job7_Administrative_Systems_Analyst.html",
  "job_title": "Administrative Systems Analyst",
  "company": "DEPT OF HEALTH/MENTAL HYGIENE",
  "location": "125 Worth St, New York, NY 10013",
  "salary": "$95,233 - $110,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:26:06.903Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nAdministrative Systems Analyst\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDEPT OF HEALTH/MENTAL HYGIENE\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted On: 11/20/2025\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nFull-Time\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Location\\n\n\\n\n\\n          NYC-ALL BOROS\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nExam May Be Required\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n           Department\\n\n\\n\n\\n           CPHDS Administration\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Salary Range:\\n\n\\n\n\\n          $95,233.00 – $110,000.00\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Description\n\\n\n\\n\n\\n\n\\n\n\\n      ONLY PERMANENT EMPLOYEES IN THE TITLE AND THOSE THAT ARE REACHABLE ON THE COMPUTER SPECIALIST (SOFTWARE) CIVIL SERVICE LIST ARE ELIGIBLE TO APPLY.\nDivision/Program Summary:\nThe Center for Population Health Data Science (CPHDS)- launched in October of 2023- aims to catalyze critical data modernization work and enable the agency to make progress toward linking public health, healthcare, and social service for timely and effective public action. We are working towards making these data more accessible, timely, equitable, meaningfully usable, and protected and actively used to protect and promote the health and wellbeing of New Yorkers. We aim to strengthen agency wide data capabilities by empowering our workforce, enhancing intra- and inter-agency data sharing, and using modern technology to yield trusted and integrated data and insights. A real-time and comprehensive view of city needs is needed to enhance public health actions and improve health outcomes for the most vulnerable New Yorkers.\nThe CPHDS Bureau of Administration is responsible for managing key administrative functions that support the effective operation of the center. These areas include Human Resources (HR), Procurement, Grants Management, Fiscal Management, Facilities, Data Management, Reporting, Customer Service, and Compliance.\nPosition Summary:\nWe are seeking an experienced Administrative Systems Analyst to lead the development of internal tools and workflows that support the operations of the Center for Population Health Data Science (CPHDS). While DOHMH provides centralized platforms and services, CPHDS requires tailored internal systems that align with agency infrastructure but reflect center-specific needs such as budget planning and strategy, document review and approval processes, and coordination of IT/ADM/FIN related requests. The successful candidate will serve as a bridge between administrative staff and technical platforms developing user-friendly tools, automating manual workflows where possible, and providing technical and strategic support across operational areas.\nJob Duties and Responsibilities:\n\\n\n\\n\nDevelop and maintain custom tools and dashboards using applications within the Microsoft ecosystem.\n\\n\nCollaborate with administrative and operations staff to design systems for internal tracking of operational activities such as onboarding/offboarding, training, procurement, equipment, and performance metrics.\n\\n\nPartner with Bureau of Data Technology & Strategy (BDTS) to identify and executive opportunities to support modernization of administrative tracking systems to ensure sustainable and user-centered tools.\n\\n\nAssist the Data Operations Manager in managing current and future administrative databases, backend systems, and front-end tools used across administrative functions.\n\\n\nManage high-level operational reports and compliance dashboards to support bureau-wide decision-making ensuring alignment with IT and agency policy.\n\\n\nTrack and operationalize streamlined process to ensure staff compliance with policies such as AUP, AI guidelines, and training requirements, including the development of automated workflows and monitoring tools.\n\\n\nProvide technical liaising and support to programs and bureaus, ensuring administrative tools are secure, integrated with agency systems, and responsive to user needs.\n\\n\nCreate technical documentation, workflow diagrams, and other materials to support tool adoption, sustainability, and knowledge sharing.\n\\n\nWhy you should work for us:\n\\n\n\\n\nBenefits: City employees are entitled to unmatched benefits such as:\n\\n\no a premium-free health insurance plan that saves employees over $10K annually, per a 2024 assessment.\no additional health, fitness, and financial benefits may be available based on the position’s associated union/benefit fund.\no a public sector defined benefit pension plan with steady monthly payments in retirement.\no a tax-deferred savings program and\no a robust Worksite Wellness Program that offers resources and opportunities to keep you healthy while serving New Yorkers.\n\\n\n\\n\nWork From Home Policy: Depending on your position, you may be able to work up to two days during the week from home.\n\\n\n- Job Security - you could enjoy more job security compared to private sector employment and be able to contribute to making NYC a healthy place to live and work.\nEstablished in 1805, the New York City Department of Health and Mental Hygiene (NYC Health Department) is the oldest and largest health department in the U.S., dedicated to protecting and improving the health of NYC. Our mission is to safeguard the health of every resident and cultivate a city where everyone, regardless of age, background, or location, can achieve their optimal health. We provide a wide array of programs and services focused on food and nutrition, anti-tobacco support, chronic disease prevention, HIV/AIDS treatment, family and child health, environmental health, mental health, and social justice initiatives. As the primary population health strategist and policy authority for NYC, with a rich history of public health initiatives and scientific advancements, from addressing the 1822 yellow fever outbreak to the COVID-19 pandemic, we serve as a global leader in public health innovation and expertise.\nCome join us and help to continue our efforts in making a difference in the lives of all New Yorkers!\nCommitment to Equity:\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.\nThe NYC Health Department is an inclusive equal opportunity employer committed to providing access and reasonable accommodation to all individuals. To request reasonable accommodation to participate in the job application or interview process, contact Sye-Eun Ahn, Director of the Office of Equal Employment Opportunity, at sahn1@health.nyc.gov or 347-396-6549.\nCOMPUTER SPECIALIST (SOFTWARE) - 13632\\n\n\\n\nMinimum Qualifications\n\\n\n(1) A baccalaureate degree from an accredited college, including or supplemented by twenty-four (24) semester credits in computer science or a related computer field and two (2) years of satisfactory full-time software experience in designing, programming, debugging, maintaining, implementing, and enhancing computer software applications, systems programming, systems analysis and design, data communication software, or database design and programming, including one year in a project leader capacity or as a major contributor on a complex project; or\n(2) A four-year high school diploma or its educational equivalent and six (6) years of full-time satisfactory software experience as described in “1\" above, including one year in a project leader capacity or as a major contributor on a complex project; or\n(3) A satisfactory combination of education and experience that is equivalent to (1) or (2) above. College education may be substituted for up to two years of the required experience in (2) above on the basis that sixty (60) semester credits from an accredited college is equated to one year of experience. A masters degree in computer science or a related computer field may be substituted for one year of the required experience in (1) or (2) above. However, all candidates must have a four year high school diploma or its educational equivalent, plus at least one (1) year of satisfactory full-time software experience in a project leader capacity or as a major contributor on a complex project.\nNOTE: In order to have your experience accepted as Project Leader or Major Contributor experience, you must explain in detail how your experience qualifies you as a project leader or as a major contributor. Experience in computer operations, technical support, quality assurance (QA), hardware installation, help desk, or as an end user will not be accepted for meeting the minimum qualification\nrequirements.\nSpecial Note\nTo be eligible for placement in Assignment Level IV, in addition to the Qualification Requirements stated above, individuals must have one year of satisfactory experience in a project leader capacity or as a major contributor on a complex project in data administration, database management systems, operating systems, data communications systems, capacity planning, and/or on-line applications programming.\n\\n\nPreferred Skills\n- Strong experience with Microsoft Power Platform (Power BI, Power Automate), SharePoint, Teams, and Access (front-end/back-end design and integration). - Ability to translate operational needs into technical solutions and liaise effectively between administrative staff and BDTS teams. - Familiarity with data architecture and engineering concepts and applying UX design principles to improve staff-facing tools. - Strong collaboration, and communication skills. - Experience in public sector, health department, or nonprofit operations preferred.\n\\n\n55a Program\nThis position is also open to qualified persons with a disability who are eligible for the 55-a Program. Please indicate at the top of your resume and cover letter that you would like to be considered for the position through the 55-a Program.\n\\n\nPublic Service Loan Forgiveness\nAs a prospective employee of the City of New York, you may be eligible for federal loan forgiveness programs and state repayment assistance programs. For more information, please visit the U.S. Department of Education’s website at https://studentaid.gov/pslf/.\n\\n\nResidency Requirement\nNew York City Residency is not required for this position\n\\n\nAdditional Information\n\\n\n\\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n        Job ID\\n\n\\n\n\\n        757547\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted until\\n\n\\n\n\\n         01/16/2026\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title code\\n\n\\n\n\\n         13632\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Civil service title\\n\n\\n\n\\n         COMPUTER SPECIALIST (SOFTWARE)\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title classification\\n\n\\n\n\\n         Competitive-1\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Business title\\n\n\\n\n\\n         Administrative Systems Analyst\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Experience Level:\\n\nExperienced (Non-Manager)\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Job level\\n\n\\n\n\\n         01\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Number of positions\\n\n\\n\n\\n         1\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Work location\\n\n\\n\n\\n         125 Worth Street, Nyc\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Category:\\n\nTechnology, Data & Innovation\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n      Administrative Systems Analyst\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=fead935df32c9813&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoAQ67M3pv5_3dy4ax0MbzkdCdPP&xfps=4a3c0c0b-a898-4717-b1ab-70d5dd375521&vjfrom=vjs&asub=mob&astse=b4376c2753cb7e05&assa=2154"
}