{
  "filename": "data_analyst_New_York__NY_page12_job1_Data_Analyst___Supply_Chain.html",
  "job_title": "Data Analyst – Supply Chain",
  "company": "Robotics Technologies",
  "location": "New York, NY",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T11:25:16.139Z",
  "full_description": "\\n\nJob ID:\nJ52385\n\\n\nJob Title:\nData Analyst – Supply Chain\n\\n\nLocation:\nNYC, NJ\n\\n\nDuration:\n11 Months + Extension\n\\n\nHourly Rate:\nDepending on Experience (DOE)\n\\n\nWork Authorization:\nUS Citizen, Green Card, OPT-EAD, CPT, H-1B,\nH4-EAD, L2-EAD, GC-EAD\n\\n\nClient:\nTo Be Discussed Later\n\\n\nEmployment Type:\nW-2, 1099, C2C\n\\n\n\\n\n\\n\nJOB DESCRIPTION:\n\\n\nKey Responsibilities:\n✔ Manage and analyze master data from Rapid Response and SAP\n✔ Build dashboards and reports in Smartsheet/Tableau for KPIs\n✔ Support supply plan data preparation and reporting\n✔ Drive user adoption and training for data governance processes\nWhat We’re Looking For:\n✅ Strong experience with Smartsheet, Tableau, Excel (must-have)\n✅ Rapid Response and SAP experience highly preferred\n✅ Data analysis and problem-solving skills\n✅ Ability to work independently and meet deadlines\n\\n\n\\n\n\\n\n\\n\n\\n\nEqual Opportunity Employer\n\\n\nROBOTICS TECHNOLOGIES LLC is an equal opportunity employer inclusive of female, minority, disability and veterans, (M/F/D/V). Hiring, promotion, transfer, compensation, benefits, discipline, termination and all other employment decisions are made without regard to race, color, religion, sex, sexual orientation, gender identity, age, disability, national origin, citizenship/immigration status, veteran status or any other protected status. ROBOTICS TECHNOLOGIES LLC will not make any posting or employment decision that does not comply with applicable laws relating to labor and employment, equal opportunity, employment eligibility requirements or related matters. Nor will ROBOTICS TECHNOLOGIES LLC require in a posting or otherwise U.S. citizenship or lawful permanent residency in the U.S. as a condition of employment except as necessary to comply with law, regulation, executive order, or federal, state, or local government contract\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=948e21d8868302f3&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoAq67M3pv5_3dy4ax0KbzkdCdPP&xfps=7da6a37f-9a6b-4d21-bd09-1436b4072910&vjfrom=vjs&asub=mob&astse=32e01bb269e52d76&assa=6604"
}