{
  "filename": "data_analyst_New_York__NY_page9_job6_Healthcare_Analyst.html",
  "job_title": "Healthcare Analyst",
  "company": "Essen Medical Associates",
  "location": "Bronx, NY",
  "salary": "$20 - $25 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:18:46.507Z",
  "full_description": "\\n Overview: \\n\n\\n\nAt Essen Health Care, we care for that!\n\\n\n\\n\n\\n\n\\n\nAs the largest privately held multispecialty medical group in the Bronx, we provide high-quality, compassionate, and accessible medical care to some of the most vulnerable and under-served residents of New York State. Guided by a Population Health model of care, Essen has five integrated clinical divisions offering urgent care, primary care, and specialty services, as well as nursing home staffing and care management. Founded in 1999, our over 20-year commitment has fueled an unwavering dedication toward innovating a better healthcare delivery system. Essen has expanded from a single primary care office to an umbrella organization offering specialties from women’s health to endocrinology, from psychiatry to a vast array of other specialties. All clinical services are offered via telehealth or in-person at over 35 medical offices and at home through the Essen House Calls program.\n\\n\n\\n\n\\n\n\\n\nEssen Health Care is the place Where Care Comes Together! We are looking for the most talented and effective individuals to join our rapidly growing company. With over 1,100 employees and 400+ Practitioners, we care for over 250,000 patients annually in New York City and beyond. From medical providers to administration & operational staff, there is a career here for you. Join our team today!\n\\n\nJob Summary: \\n\n\\n\nPosition title:\nHealthcare Data Analyst\\n\n\\n\n\\n\n\\n\nJob summary\n: Essen Health Care is seeking a\njunior-level Analyst\nwith a solid foundation in data to support the Operations Manager within the Cardio Vascular Division. This on-site role is well-suited for a candidate in the early stages of their career who is comfortable with data analysis and visualization and motivated to contribute to operational performance and data-informed decision-making in a healthcare setting.\\n\nResponsibilities: \\n\nData Collection & Management\n\\n\n\\n\nCollect, clean, validate, and organize operational data from internal systems.\n\\n\nEnsure data accuracy, consistency, and reliability across datasets and reports.\n\\n\nMaintain structured datasets to support recurring and ad-hoc analysis.\n\\n\n\\n\nData Analysis & Reporting\n\\n\n\\n\nPerform quantitative and qualitative analysis to identify trends, variances, and improvement opportunities.\n\\n\nPrepare routine and ad-hoc reports to support operational tracking and planning.\n\\n\nSupport KPI monitoring and performance analysis under the guidance of the Operations Manager.\n\\n\n\\n\nData Visualization & Insights\n\\n\n\\n\nDevelop and maintain dashboards and reports using\nPower BI\n.\n\\n\nPresent data findings in a clear and structured manner.\n\\n\nTranslate data into meaningful insights that support operational and business decisions.\n\\n\n\\n\nOperations & Team Support\n\\n\n\\n\nWork closely with the Operations Manager on day-to-day analytical tasks and projects.\n\\n\nCollaborate with clinical and administrative teams to understand data needs and definitions.\n\\n\nRespond to data and reporting requests accurately and within established timelines.\n\\n\n\\n\nQualifications: \\n\nRequired Skills & Qualifications\n\\n\n\\n\nBachelor’s degree in Analytics, Business, Statistics, Economics, Healthcare Administration, Data Science, Operations, or a related field.\n\\n\nStrong foundational understanding of data concepts\n, including data structures, data quality, and basic data modeling.\n\\n\nProficiency in\nMicrosoft Excel\n(formulas, pivot tables, data analysis).\n\\n\nWorking knowledge of\nSQL\nfor querying and extracting data.\n\\n\nExperience using\nPower BI\n(academic, internship, or project-based experience acceptable).\n\\n\nStrong analytical and problem-solving skills.\n\\n\nHigh attention to detail and accuracy.\n\\n\nAbility to clearly explain data findings to non-technical stakeholders.\n\\n\n\\n\nAdditional Requirements\n\\n\n\\n\nMust be based in New York and able to work on-site full time.\n\\n\nAuthorized to work in the United States.\n\\n\n\\n\nPreferred Qualifications\n\\n\n\\n\nInternship, academic project, or early professional experience involving data analysis or reporting.\n\\n\nExposure to healthcare, operations, or performance analytics.\n\\n\nFamiliarity with KPIs and basic reporting frameworks.\n\\n\n\\n\n\\n\nWhat We Offer\n\\n\n\\n\nEntry-level opportunity with hands-on exposure to real-world operational analytics\n\\n\nClose mentorship from operations leadership\n\\n\nOn-site, collaborative work environment within the CV Division\n\\n\nCompetitive compensation and benefits package\n\\n\nGrowth and learning opportunities in healthcare analytics\n\\n\nEqual Opportunity Employer: \\n\n\\n\nEssen Health care is proud to be an equal opportunity employer, and we seek candidates who desire to work in and serve an ethnically diverse population.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}