{
  "filename": "data_analyst_New_York__NY_page13_job4_Business_Analyst_SharePoint.html",
  "job_title": "Business Analyst SharePoint",
  "company": "DMV IT Service",
  "location": "Bronx, NY 10451•Hybrid work",
  "salary": "$74,000 - $83,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:27:38.474Z",
  "full_description": "Job Title:\nBusiness Analyst\nLocation:\nThe Bronx, NY\nEmployment Type:\nContract\nAbout Us::\nDMV IT Service LLC, founded in 2020, is a trusted IT consulting firm specializing in IT infrastructure optimization, cybersecurity, networking, and staffing solutions. We partner with clients to achieve technology goals through expert guidance, workforce support, and innovative solutions. With a client-focused approach, we also provide online training and job placements, ensuring long-term IT success.\nJob Purpose::\nThe Business Analyst will be responsible for managing data, documentation, and digital collaboration tools to ensure accuracy, compliance, and efficient access to key operational information. This role supports the department by maintaining systems, generating analytical insights, and developing documentation aligned with company policies and regulatory standards.\nRequirements:\nKey Responsibilities::\n\\n\n\\n\nDesign and maintain data reports, dashboards, and visual analytics that support strategic decision-making.\n\\n\nOversee and administer SharePoint sites, internal network drives, and enterprise document management platforms.\n\\n\nDevelop, update, and maintain procedures and process documentation for internal applications and workflows.\n\\n\nUpdate and manage databases of technical specifications across platforms including SharePoint and Spark (Con Edison’s AI system).\n\\n\nCollaborate with Gas Operations teams to monitor inquiries and ensure timely resolution of issues.\n\\n\nDraft, revise, and review company specifications to maintain compliance with PSC, DOT, OSHA, and other governing agencies.\n\\n\nInterpret technical standards, regulations, and engineering codes to guide operational teams.\n\\n\nSupport research, innovation, and R&D initiatives related to gas construction, distribution, and maintenance practices.\n\\n\nCreate and maintain Excel macros, scripts, and queries to automate workflows and improve reporting efficiency.\n\\n\nConduct field visits when necessary to validate data and support operational activities.\n\\n\nRequired Skills & Experience::\n\\n\n\\n\nProficiency in Microsoft Office Suite (Excel, Word, PowerPoint, Visio) and strong Windows-based file management skills.\n\\n\nExperience with SharePoint administration, document control systems, and digital collaboration tools.\n\\n\nStrong knowledge of data analytics, visualization, and reporting techniques.\n\\n\nUnderstanding of gas industry operations, including construction, distribution, and maintenance, is a plus.\n\\n\nFamiliarity with Federal, State, and Local gas regulations and PHMSA requirements preferred.\n\\n\nExcellent communication, analytical, and organizational skills.\n\\n\nProven ability to work both independently and collaboratively in a fast-paced, deadline-driven environment.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}