{
  "filename": "data_analyst_New_York__NY_page4_job2_Business_Operations_Analyst.html",
  "job_title": "Business Operations Analyst",
  "company": "Maganti IT Resources",
  "location": "21 State Street, Waterbury, CT 06702",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:57:16.281Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nLocation:\n21 State St, Waterbury, CT 06702\\n\n\\n\n\\n\n\\n\n\\n\nJob Type:\nFull time\\n\n\\n\n\\n\n\\n\n\\n\nOpen Date:\nApril 23, 2025\\n\n\\n\n\\n\n\\n\n\\n\nClose Date:\nMay 8,2025\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n   Maganti IT Resources, LLC is looking for fulltime Business Operations Analyst at Waterbury, CT office location.\\n\n\\n\nResponsibilities\n\\n\n\\n\n\\n    Duties include : \\n\nDevelop and execute operational strategies in alignment with the company's overarching goals. This entails establishing objectives, defining measurable success criteria, and devising action plans to attain these objectives.\n\\n\nInstitute rigorous quality standards and protocols to sustain superior product/service quality. Monitor performance against these benchmarks and implement corrective measures as needed to uphold quality standards.\n\\n\nIdentify potential operational risks and develop strategies to mitigate them. This could involve implementing safety measures, devising contingency plans, and ensuring adherence to regulatory requirements to minimize operational risks.\n\\n\nNegotiate agreements with vendors and suppliers to secure favorable terms and cultivate mutually beneficial partnerships.\n\\n\nFoster relationships with key suppliers and supervise procurement processes to ensure timely delivery of goods and services.\n\\n\nFoster a positive work environment and facilitate opportunities for professional growth and development among staff.\n\\n\nMonitor customer feedback and satisfaction levels to identify areas for enhancement in products or services.\n\\n\nImplement initiatives to elevate the customer experience and foster enduring relationships with clients.\n\\n\nCoordinate cross-functional teams, establish project timelines, and monitor progress to ensure successful project execution within budgetary and scheduling parameters.\n\\n\nCultivate a culture of ongoing improvement within the organization by encouraging innovation, soliciting input from stakeholders, and implementing industry best practices to dr ive operational excellence.\n\\n\n\\n\n\\n\nSkills and Qualification\n\\n\n\\n\n\\n\nA qualified candidates must possess a minimum of a Bachelor’s degree (or its equivalent) in Business Management, Business Administration, or a related field.\n\\n\n\\n\n\\n\nSend resume to :\n\\n\n\\n   Maganti IT Resources, LLC, 21 State St, Waterbury, CT 06702\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=0f0e19b4644cc0ba&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfn8f3pi9eb8ah&spon=0&xkcb=SoCN67M3pvmuMEygLZ0JbzkdCdPP&xfps=2a6f6edf-816b-4e96-9407-c5413dd40cac&sjdu=dJHspqP8wOtUI_TjCedV1yCj0IJgrer7vl7PWPg4Dfo&vjfrom=vjs&asub=mob&astse=0ace04ad83abaa03&assa=9750"
}