{
  "filename": "data_analyst_New_York__NY_page1_job6_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "UFlex USA, Inc.",
  "location": "55 Challenger Road, Ridgefield Park, NJ 07660",
  "salary": "$74,000 - $84,000 a year",
  "job_type": "Permanent, Full-time",
  "scraped_at": "2025-12-27T10:52:14.154Z",
  "full_description": "This is not an all inclusive job description but an overview of the duties and responsibilities. UFlex is open to relatively new college graduates.\n\\n\nDuties and Responsibilities\n\\n\n\\n\nCollect and analyze data for for potential business and/or organizational opportunities\n\\n\nCoordinate with different project and departmental teams to improve productivity and efficiency\n\\n\nAnalyze business processes and provide continuous improvement recommendations\n\\n\nCollaborate and communicate with departments within the organization and other stakeholders in optimizing goals, objectives & requirements.\n\\n\nStrong communication skills and ability to effectively present through process mapping, research, analytics, modeling and integration of technology to management, stakeholders and IT.\n\\n\nCreate Reports and visually present implementation of continuous improvement opportunities.\n\\n\nOther duties and responsibilities as assigned.\n\\n\n\\n\nRequirements:\n\\n\n\\n\nBachelors Degree in Business Analytics administration, finance, accounting or a related discipline is extremely important\n\\n\nAccuracy and attention to detail\n\\n\nWorking knowledge of Excel;\n\\n\nStrong organizational, problem solving & analytical skills\n\\n\nExceptional oral, written, and interpersonal communication skills\n\\n\nResults oriented\n\\n\nAbility to work in a collaborative and supportive environment\n\\n\nDiscretion and confidentiality\n\\n\nBusiness Analyst candidate having B2B selling experience (1 to 3 yrs.) of Printed flexible Packaging laminates and preformed pouches in North American market. The targeted industry is Snack Food, Candy & Confectionary, Spout Pouches, Pet Food, Lawn & Garden industries.\n\\n\nUFlex is India's largest multinational flexible packaging and solutions company. Our packaging excellence has positioned us as a preferred packaging solutions amongst global brands worldwide. Over the last three decades, we have earned an irreproachable reputation by defining the contours of the packaging industry in India and overseas. As a leading name among packaging companies in innovation and sustainability.\n\\n\n\\n\nJob Types: Full-time, Permanent\n\\n\nPay: $74,000.00 - $84,000.00 per year\n\\n\nBenefits:\n\\n\n\\n\n401(k) matching\n\\n\nAD&D insurance\n\\n\nDental insurance\n\\n\nDependent health insurance coverage\n\\n\nDisability insurance\n\\n\nHealth insurance\n\\n\nHealth savings account\n\\n\nLife insurance\n\\n\nPaid time off\n\\n\nPrescription drug insurance\n\\n\nVision insurance\n\\n\n\\n\nCompensation Package:\n\\n\n\\n\nYearly pay\n\\n\n\\n\nSchedule:\n\\n\n\\n\n8 hour shift\n\\n\nDay shift\n\\n\nMonday to Friday\n\\n\nOn call\n\\n\n\\n\nPeople with a criminal record are encouraged to apply\n\\n\nAbility to Relocate:\n\\n\n\\n\nRidgefield Park, NJ 07660: Relocate before starting work (Required)\n\\n\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}