{
  "filename": "data_analyst_Houston__TX_page1_job14_JPC_1057___Data_Support_Analys.html",
  "job_title": "JPC 1057 – Data Support Analyst",
  "company": "Pantheon Inc.",
  "location": "Spring, TX 77373",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:45:04.624Z",
  "full_description": "\\n\nLOCATION\n\\n\n\\n  Hybrid – Spring, TX 77373\\n\n\\n\nDESCRIPTION\n\\n\n\\n  We are seeking a talented individual to join our team as an Adaptive Planning Analyst. Our ideal candidate is someone who thrives in a fast-paced environment and is passionate about leveraging technology to drive business success.\\n\n\\n\n\\n  The Adaptive Planning Analyst will be responsible for configuring and supporting business process solutions under various projects (APEX, HCM, Econ Portfolio) within Workday Adaptive planning.\\n\n\\n\nPrimary skill set:\n\\n\n\\n\n\\n\n\\n    Workday Adaptive Planning\\n\n\\n\n\\n\n\\n    SQL\\n\n\\n\n\\n\n\\n    Strong Collaborator – to assist team with knowledge acceleration of system functionalities.\\n\n\\n\n\\n\nKey Responsibilities:\n\\n\n\\n\nCollaborate with the US-based team to manage and support key projects and ensure effective communication and coordination across time zones.\n\\n\nDevelop and maintain integrations between various systems, applications and within Adaptive planning (i.e. instance to instance).\n\\n\nUtilize SQL skills to manage and optimize integrations and configurations for seamless data flows.\n\\n\nSupport data mapping activities for business and analytic needs.\n\\n\nCollaborate with cross-functional teams to understand integration requirements and deliver effective solutions.\n\\n\nPromptly address and resolve system configuration issues through close collaboration with business customers and the vendor, as needed.\n\\n\nParticipate in the rotation of On-Call support during the crucial peak submission phase of business planning (typically from May to October) working collaboratively with team members to ensure seamless and uninterrupted business operations.\n\\n\nWork extensively within Workday Adaptive Planning application to ensure smooth integration and functionality.\n\\n\nConfigure and maintain the sheets, formulas, access rules, reports, dashboards, and other components of modeling within Adaptive Planning.\n\\n\n\\n\nCore Competencies:\n\\n\n\\n\nExperienced in Workday Adaptive Planning\n\\n\nStrong understanding of system integrations\n\\n\nProficient in constructing data models, generating comprehensive reports, and designing interactive dashboards.\n\\n\nSkilled in SQL; Ability to write complex queries, including joins, subqueries, and aggregate functions.\n\\n\n\\n\n\\n    Collaborates effectively on team-based projects\\n\n\\n\n\\n\nDesirable Competencies:\n\\n\n\\n\nComprehensive understanding of APIs including their design, development, and integration.\n\\n\nStrong understanding of financial planning and analysis processes.\n\\n\nKnowledgeable with annual Planning and Budgeting, forecasting and variance analysis\n\\n\nCompetent in Snowflake’s integration with other data tools and platforms\n\\n\nExperience with IBM Planning Analytics (TM1) is a plus\n\\n\n\\n\n\\n\nContact:\njorge.flores@pantheon-inc.com\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=4387042b92f21fd2&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfme75aj73689f&spon=0&xkcb=SoBm67M3pvk3MbRbpp0FbzkdCdPP&xfps=75148041-a287-4672-8c86-22d57552a818&vjfrom=vjs&asub=mob&astse=6f2d545f5cf937fe&assa=4899"
}