{
  "filename": "data_analyst_New_York__NY_page9_job14_Associate_Technical_Business_A.html",
  "job_title": "Associate Technical Business Analyst, Finance Data Products",
  "company": "Hospital for Special Surgery",
  "location": "New York, NY",
  "salary": "$60,000 - $91,125 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:20:08.554Z",
  "full_description": "\\n\nHow you move is why we’re here. ®\nNow more than ever.\n\\n\nGet back to what you need and love to do.\nThe possibilities are endless...\nNow more than ever, our guiding principles are helping us in our search for exceptional talent - candidates who align with our unique workplace culture and who want to maximize the abundant opportunities for growth and success.\nIf this describes you then let’s talk!\nHSS is consistently among the top-ranked hospitals for orthopedics and rheumatology by U.S. News & World Report. As a recipient of the Magnet Award for Nursing Excellence, HSS was the first hospital in New York City to receive the distinguished designation. Whether you are early in your career or an expert in your field, you will find HSS an innovative, supportive and inclusive environment.\n\\n\nWorking with colleagues who love what they do and are deeply committed to our Mission, you too can be part of our transformation across the enterprise.\n\\n\n\\n\nEmp Status\nRegular Full time \\n\n\\n\nWork Shift\nDay (United States of America) \\n\n\\n\nCompensation Range\nThe base pay scale for this position is $60,000.00 - $91,125.00. In addition, this position will be eligible for additional benefits consistent with the role. The salary of the finalist selected for this role will be determined based on various factors, including but not limited to: scope of role, level of experience, education, accomplishments, internal equity, budget, and subject to Fair Market Value evaluation. The hiring range listed is a good faith determination of potential compensation at the time of this job advertisement and may be modified in the future. \\n\n\\n\nWhat you will be doing\n\\n\nWhat You Will Be Doing\n\\n\nAs part of the Data & Analytics (HSS Data) team and aligned with the Finance vertical, you will own high-impact analysis and automation initiatives that advance budgeting, forecasting, and strategic planning for Regional and Florida Financial Operations. You will develop models, map financial workflows, design self-service data products and collaborate across finance, operations, and the technology organization to ensure financial activity is accurately reflected, governed, and translated into actionable recommendations.\n\\n\n\\n\nCore Responsibilities:\n\\n\n\\n\nWork under the guidance of senior BAs and Product Managers to understand user needs, business strategy, and technical concepts.\n\\n\nAssist in mapping current-state (\"as-is\") business processes and help identify pain points or improvement opportunities.\n\\n\nSupport the elicitation and documentation of requirements from stakeholders; practice translating business needs into technical language for development teams.\n\\n\nHelp capture key metrics, success criteria, and reporting objectives.\n\\n\nCollaborate with Product Managers within the PODs to help refine user stories, acceptance criteria, and data product/solution specifications.\n\\n\nServe as a bridge between domain experts (e.g., clinicians, finance leads) and technical teams, ensuring clear communication.\n\\n\nParticipate in validating final deliverables against business expectations by supporting user acceptance testing (UAT), gathering feedback, and contributing to test plans.\n\\n\nSupport user adoption activities by assisting with product demos, end-user training, and the creation of support documentation.\n\\n\nProvide foundational product support by helping to track usage analytics, documenting incidents, and triaging inbound bugs and enhancement requests.\n\\n\n\\n\nTypical Deliverables:\n\\n\n\\n\nContributions to requirements documents (BRDs, PRDs).\n\\n\nDrafts of business process and data flow diagrams.\n\\n\nDrafts of dashboard wireframes and mockups.\n\\n\nWell-documented user stories and acceptance criteria (in Jira).\n\\n\nTest cases and contributions to acceptance test plans.\n\\n\nDrafts of user guides and training documentation.\n\\n\n\\n\nKey Skills:\n\\n\n\\n\nAnalytical mindset with an eagerness to learn how to connect data to tangible business value.\n\\n\nStrong interpersonal and note-taking skills, with a desire to learn stakeholder interviewing and facilitation.\n\\n\nExcellent written and verbal communication skills.\n\\n\nFamiliarity with (or strong willingness to learn) Agile/Scrum methodologies.\n\\n\nA strong interest in developing domain knowledge (e.g., revenue cycle, clinical workflows).\n\\n\nBasic data literacy (e.g., understanding of databases, ability to read SQL) and a strong desire to become proficient.\n\\n\nHighly organized, detail-oriented, and a proactive learner.\n\\n\n\\n\nPOD Placement:\n\\n\n\\n\nEmbedded in the Finance POD, with potential to support others (e.g., Clinical, Research, Business Ops).\n\\n\nReports functionally up through Product Management.\n\\n\nWorks closely and cross-functionally with Product Managers, Data Access Developers, Design, and business stakeholder\n\\n\nContributes toward culture of shared leadership and ownership by the POD.\n\\n\n\\n\n\\n\nNon-Discrimination Policy\nHospital for Special Surgery is committed to providing high quality care and skilled, compassionate, reliable service to our community in a safe and healing environment. Consistent with this commitment, Hospital for Special Surgery provides care, admits, and treats patients and provides all services without regard to age, race, color, creed, ethnicity, religion, national origin, culture, language, physical or mental disability, socioeconomic status, veteran or military status, marital status, sex, sexual orientation, gender identity or expression, or any other basis prohibited by federal, state, or local law or by accreditation standards.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=b3f36458bb51fdfd&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoeno9jn0n81p&spon=0&xkcb=SoBj67M3pv402wQpQ50FbzkdCdPP&xfps=2beb4c43-6d89-42bc-b916-d5019da18950&vjfrom=vjs&asub=mob&astse=62d34f58a439c8d5&assa=8952"
}