{
  "filename": "data_analyst_New_York__NY_page1_job14_Analyst.html",
  "job_title": "Analyst",
  "company": "SRA Investors",
  "location": "New York, NY 10040",
  "salary": "$29.61 - $35.66 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:53:37.429Z",
  "full_description": "Job Overview\nWe are seeking a dynamic and detail-oriented Analyst to join our innovative team. In this role, you will harness your analytical expertise to interpret complex data sets, develop insightful reports, and support strategic decision-making processes. Your proactive approach and technical proficiency will drive improvements across business operations, ensuring data-driven solutions that propel our organization forward. This position offers an exciting opportunity to work with cutting-edge tools and methodologies in a collaborative environment committed to excellence and continuous growth.\n\\n\nResponsibilities\n\\n\n\\n\nCollect, clean, and analyze large datasets using SQL, Python, R, and ETL tools like Talend to extract meaningful insights.\n\\n\nDesign and develop interactive dashboards and reports utilizing Tableau, Power BI, Looker, and other visualization platforms to communicate findings clearly.\n\\n\nCollaborate with cross-functional teams in an Agile environment to define project requirements, prioritize tasks, and deliver timely results.\n\\n\nSupport the full Software Development Life Cycle (SDLC) for data projects, including planning, development, testing, deployment, and maintenance.\n\\n\nConduct business analysis to identify opportunities for process improvements and automation using VBA, Bash (Unix shell), and database design principles.\n\\n\nManage project timelines and resources effectively through project management best practices to ensure successful delivery.\n\\n\nMaintain comprehensive documentation of data models, workflows, and technical specifications using Visio or similar tools.\n\\n\nEngage in business analysis activities to understand stakeholder needs and translate them into technical solutions that enhance data accessibility and usability.\n\\n\n\\n\nSkills\n\\n\n\\n\nProficiency in SQL for querying relational databases such as Microsoft SQL Server and Oracle.\n\\n\nStrong experience with data visualization tools including Tableau, Power BI, and Looker.\n\\n\nKnowledge of programming languages like Python and R for advanced analytics and automation tasks.\n\\n\nFamiliarity with ETL processes using Talend or similar tools to facilitate data integration from multiple sources.\n\\n\nUnderstanding of database design principles for creating efficient data models supporting analytics initiatives.\n\\n\nExperience with SDLC methodologies within Agile frameworks to manage project lifecycles effectively.\n\\n\nAbility to perform comprehensive business analysis to identify key metrics and develop actionable insights.\n\\n\nSkills in analysis techniques using analysis skills such as statistical methods or predictive modeling.\n\\n\nExperience working with linked data concepts for integrating disparate datasets across platforms.\n\\n\nKnowledge of VBA scripting for automating repetitive tasks within Microsoft Office applications.\n\\n\nFamiliarity with Unix shell scripting (Bash) for server-side automation tasks. Join us as an Analyst where your expertise will shape strategic initiatives through innovative data solutions! We value energetic professionals eager to make a tangible impact by transforming complex information into clear, actionable insights that drive success across our organization.\n\\n\n\\n\nPay: $29.61 - $35.66 per hour\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}