{
  "filename": "data_analyst_New_York__NY_page5_job9_Business_Analyst___Assistant_V.html",
  "job_title": "Business Analyst - Assistant Vice President",
  "company": "Deutsche Bank",
  "location": "New York, NY•Hybrid work",
  "salary": "$85,000 - $140,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:59:55.455Z",
  "full_description": "\\n\n\\n\nBusiness Analyst - Assistant Vice President\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob ID:\nR0392588\\n\n\\n\n\\n\nFull/Part-Time:\nFull-time\\n\n\\n\n\\n\n\\n\n\\n\nRegular/Temporary:\nRegular\\n\n\\n\n\\n\nListed:\n2025-09-25\\n\n\\n\n\\n\n\\n\n\\n\nLocation:\nNew York\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPosition Overview\n\\n\n\\n\nJob Title:\nBusiness Analyst\n\\n\nCorporate Title:\nAssistant Vice President\n\\n\nLocation:\nNew York, NY\n\\n\n\\n\nOverview\n\\n\nThe Business Analyst supports the Program Manager and the entire team in gathering tech & business requirements, improving operational processes, guiding the dedicated development team, and supporting local front office users on any query related to the local Salesforce platform. The job of the BA is essential in delivering high-end products and in supporting the development team in having all documentation detailed and well prepared. You will interact with a variety of stakeholders, from IT developers and tech experts to compliance and risk officers: every day will never be the same. With this role you will enable the digital environment that helps our people share their knowledge, expertise, and real passion for our business. Deutsche Bank is investing heavily in technology, which means we are investing in you.\n\\n\n\\n\nWhat We Offer You\n\\n\n\\n\nA diverse and inclusive environment that embraces change, innovation, and collaboration\n\\n\nA hybrid working model, allowing for in-office / work from home flexibility, generous vacation, personal and volunteer days\n\\n\nEmployee Resource Groups support an inclusive workplace for everyone and promote community engagement\n\\n\nCompetitive compensation packages including health and wellbeing benefits, retirement savings plans, parental leave, and family building benefits\n\\n\nEducational resources, matching gift, and volunteer programs\n\\n\n\\n\n\\n\nWhat You’ll Do\n\\n\n\\n\nScope the system: Work closely together with the Program Manager and other team members, to ensure right granularity of requirements specification on an epic / story level.\n\\n\nTranslate business needs: Create models, diagrams, presentations, and design, configure solutions within the Salesforce platform, including workflows, reports, dashboards, and custom objects, to meet business objectives.\n\\n\nValidate requirements, UAT Testing & User Training (if required): You will validate E2E requirements via reviews, walkthroughs, and demo. You will also be key actor in writing & conducting UAT test cases and, in case required, train non-squads’ stakeholders.\n\\n\nLiaise & Communicate: Act as a key liaison between business users, product teams, and technical developers, ensuring everyone is aligned on project goals and technical implementation.\n\\n\nDocument: Create comprehensive documentation, such as user stories, functional specifications, and process models (AS-IS and TO-BE), to guide development and implementation.\n\\n\nMonitor: Proactively identify risks / issues that might affect squad’s overall health\n\\n\n\\n\n\\n\nSkills You’ll Need\n\\n\n\\n\nDemonstrated experience in dealing with complex Salesforce based CRM solutions, ideally in the banking industry. Salesforce certificate will be highly desirable.\n\\n\nExperience in dealing with the Bank’s internal processes and around compliance, legal, BISO / TISO, DPOs stakeholders.\n\\n\nRelevant and demonstrable experience in designing and documenting requirements in agile teams.\n\\n\nKnowledge of agile methods (SAFe, Scrum, Kanban, etc.) and tools (Jira or Confluence)\n\\n\nExperience in working in a challenging, fast-paced environment\n\\n\n\\n\n\\n\nSkills That Will Help You Excel\n\\n\n\\n\nClear ability to provide concise, precise, and managerial answers to a wide array of business-related topics.\n\\n\nExperience in working in a fast-paced environment.\n\\n\nAbility to deal with complex and ambiguous situations independently and with limited guidance.\n\\n\nIndependent and proactive working method and a high-quality standard.\n\\n\nFlexibility for moving between different requirements in a timely manner.\n\\n\n\\n\n\\n\nExpectations\n\\n\nIt is the Bank’s expectation that employees hired into this role will work in the New York, NY office in accordance with the Bank’s hybrid working model.\n\\n\n\\n\nDeutsche Bank provides reasonable accommodations to candidates and employees with a substantiated need based on disability and/or religion.\n\\n\n\\n\nThe salary range for this position in New York City is $85,000 to $140,000. Actual salaries may be based on a number of factors including, but not limited to, a candidate’s skill set, experience, education, work location and other qualifications. Posted salary ranges do not include incentive compensation or any other type of remuneration.\n\\n\n\\n\nDeutsche Bank Benefits\n\\n\nAt Deutsche Bank, we recognize that our benefit programs have a profound impact on our colleagues. That’s why we are focused on providing benefits and perks that enable our colleagues to live authentically and be their whole selves, at every stage of life. We provide access to physical, emotional, and financial wellness benefits that allow our colleagues to stay financially secure and strike balance between work and home. Click here to learn more!\n\\n\n\\n\nLearn more about your life at Deutsche Bank through the eyes of our current employees: https://careers.db.com/life\n\\n\n\\n\nThe California Consumer Privacy Act outlines how companies can use personal information. If you are interested in receiving a copy of Deutsche Bank’s California Privacy Notice, please email HR.Direct@DB.com .\n\\n\n\\n\n#LI-HYBRID\n\\n\n\\n\nWe strive for a culture in which we are empowered to excel together every day. This includes acting responsibly, thinking commercially, taking initiative and working collaboratively.\nTogether we share and celebrate the successes of our people. Together we are Deutsche Bank Group.\nWe welcome applications from all people and promote a positive, fair and inclusive work environment.\nQualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status or other characteristics protected by law. Click these links to view \"Deutsche Bank’s Equal Opportunity Policy Statement\" and the following notices: \"EEOC Know Your Rights\" ; \"Employee Rights and Responsibilities under the Family and Medical Leave Act\" ; and \"Employee Polygraph Protection Act\" .\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=4becfe823e7a7492&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnbj48jn1a803&spon=0&xkcb=SoAO67M3pvmhsM20BR0CbzkdCdPP&xfps=cc23afbf-78d0-410d-b63c-062fed94eb08&vjfrom=vjs&asub=mob&astse=110025b9ff374ffc&assa=4582"
}