{
  "filename": "data_analyst_New_York__NY_page13_job3_Business_Development_Analyst.html",
  "job_title": "Business Development Analyst",
  "company": "New Jersey Resources",
  "location": "Township of Wall, NJ•Hybrid work",
  "salary": "$76,400 - $97,300 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:27:28.239Z",
  "full_description": "Energize your future and join our dynamic team dedicated to advancing renewable energy projects. We are committed to fostering a collaborative environment that promotes teamwork and a sense of responsibility.\nNJR Clean Energy Ventures (CEV) is seeking a skilled Business Development Analyst to maintain our business unit's financial plan and forecast, support due-diligence efforts for solar project investments, and perform ongoing market analysis. This role involves developing and maintaining databases, financial models, and supporting executive-level communications.\nMajor Responsibilities:\n\\n\n\\n\nPerform research and analysis on renewable energy markets and fundamentals.\n\\n\nDevelop and maintain market and project analysis tools.\n\\n\nMaintain a strong working knowledge of energy and incentive markets (retail and wholesale).\n\\n\nAssist with project data analysis throughout different project stages.\n\\n\nCompile and prepare technical, statistical, and analytical reports and presentations.\n\\n\nAssist the development team on individual projects, including due diligence and financial modeling.\n\\n\nMaintain portfolio management tools for tracking project investments and RECs.\n\\n\nMaintain effective internal and external contacts.\n\\n\nFoster teamwork and a sense of responsibility.\n\\n\nPosition Requirements:\n\\n\n\\n\nBachelor’s degree in business or a related field.\n\\n\nExperience in market and project analysis.\n\\n\nExperience with energy markets and technologies.\n\\n\nStrong customer focus and project development skills.\n\\n\nStrong research and analytical skills.\n\\n\nAbility to develop market and project financial models.\n\\n\nAbility to focus and deliver proactively in a dynamic, multi-tasking, fast-paced environment.\n\\n\nDemonstrated ability to influence and collaborate across organizational boundaries.\n\\n\nExcellent interpersonal, verbal, and written communication skills.\n\\n\nStrong analytical, pattern detection, and problem-solving abilities.\n\\n\nProficiency in Microsoft Excel, Word, and PowerPoint.\n\\n\nTeam player with a passion to succeed and work effectively under pressure.\n\\n\nThe above job description is reflective of the primary duties of this position and in no way limits the supervisor from assigning any other duties, responsibilities or initiatives as deemed necessary.\n\\n\nJob Location Type is Hybrid.\nOther Details:\nCompensation:\nExpected base pay range for this role will be $76,400- $97,300.\nBase pay is based on several factors including, experience, skills, and knowledge.\nThis role will be eligible to participate in an annual short term incentive program.\nBenefits:\nMedical insurance coverage from day 1; 401k vesting immediate.\n\\n\n\\n\nEmployee insurance and medical plans, including prescription, vision and dental benefits.\n\\n\n401(k) program with generous company match.\n\\n\nCompany stock purchase plan.\n\\n\nWellness programs, including free on and off-site fitness centers.\n\\n\nEmployee Assistance Program (EAP).\n\\n\nTuition reimbursement program.\n\\n\nPaid time off including paid holidays.\n\\n\nNew Jersey Resources is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, age, gender identity and/or expression, national origin, disability, veteran, or other protected status.",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=7128dcf15fd37e65&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfovnurkuq78l9&spon=0&xkcb=SoB_67M3pv5w3QyMTJ0IbzkdCdPP&xfps=782217eb-e11c-47a3-a58e-606245d7c7ea&vjfrom=vjs&asub=mob&astse=f3fa7ba29415f85c&assa=3331"
}