{
  "filename": "data_analyst_New_York__NY_page9_job12_Trauma_Registrar_1_Data_Analys.html",
  "job_title": "Trauma Registrar 1 Data Analyst - Department Of Surgery",
  "company": "Hartford Hospital",
  "location": "79 Jefferson Street, Hartford, CT 06106",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:19:47.937Z",
  "full_description": "\\n\nLocation Detail:\n79 Jefferson St HH Bliss Wing (10064)\n\\n\nShift Detail:\nMonday through Friday, day shift.\n\\n\nWork where\nevery moment\nmatters.\n\\n\nEvery day, more than 40,000 Hartford HealthCare colleagues come to work with one thing in common: Pride in what we do, knowing every moment matters here. We invite you to become part of Connecticut’s most comprehensive healthcare network.\n\\n\nJoin us at Hartford Hospital as we live our values every day. As part of Hartford HealthCare we create a better future for healthcare in Connecticut and beyond. By embodying these values we have become nationally respected for patient care and most trusted for personalized coordinated care. Come be part of something special!\n\\n\nHartford Hospital is one of the largest and most respected teaching hospitals New England. We are a Level 1 Trauma Center that provides cutting edge treatment to its patients. This is made possible by being home to the largest robotic surgery center in the Northeast and the Center for Education, Simulation and Innovation (CESI), one of the most-advanced medical simulation training centers in the world. When hospitals cannot provide the advanced care, expertise and new treatment options their patients require, they turn to us.\nJob Summary:\n\\n\nThe Trauma Registrar 1 is responsible for the Trauma Registry, a data base unique to trauma patients including patient identification, chart abstraction, collection, coding, scoring and entering of data into a designated registry data base. This position ensures the accuracy of the data that is collected and collaborates with performance improvement and administrative planning. This position also ensures that trauma data is retrieved, entered, analyzed and verified in accordance with state and national mandated regulations to ensure American College of Surgeons verification and state designation for Trauma Center status.\n\\n\nIn addition, this position assists with quality control activities, information requests and studies as requested. Lastly, this position identifies and maintains a data base for trauma cases to meet state requirements and minimal standards of the American College of Surgeons.\n\\n\nResponsibilities:\n\\n\n\\n\nAbstracts data from medical records for inclusion into the Trauma Registry database.\n\\n\nUtilizes the NTDB dictionary to accurately code procedures, diagnoses, and injuries using ICD-10 coding, AIS injury coding, E-codes and other appropriate coding schemes, and accurately enters into Trauma Registry within departmental guidelines.\n\\n\nEnsures that trauma data is retrieved, entered, analyzed and verified in accordance with state and national mandated regulations to ensure American College of Surgeons verification and State designation for Trauma Center status.\n\\n\nPrepares reports based on research requests, and data reports for quality initiatives.\n\\n\nPerforms data analysis and data validation on Trauma Registry data on a routine basis to ensure validity, accuracy and completeness of data entry.\n\\n\nParticipates in performance improvement monitoring by gathering data on performance metrics, identifying and reporting complications, and performing analysis of registry data in support of clinical process improvement initiatives\n\\n\nAssists those facilities with annual download to state and national trauma registries such as National Trauma Data Bank (NTDB) and Trauma Quality Improvement (TQIP).\n\\n\nMaintains professional development and current knowledge of standards and data sets of NTDB and State Trauma Registry Dictionary.\n\\n\nMaintains professional developments such as maintenance of certification Certified Specialist in Trauma Registry.\n\\n\n\\n\nQualifications\n\\n\n\\n\nHigh school diploma\n\\n\nKnowledge of medical terminology and of basic anatomy and etc.\n\\n\nAssociates degree preferred in related field such as Health Information Management, etc. preferred.\n\\n\n1 to 2 years in a position requiring knowledge of electronic medical record and PC skills with knowledge of database system such as input data and retrieving data.\n\\n\nKnowledge of ICD-9 and ICD-10 coding preferred\n\\n\nHires must complete the American Trauma Society’s Trauma Registry course and the Association of the Advancement of Automotive Medicine Injury Scaling course within 24 months of employment\n\\n\nSuccessfully participate in the ICD-10 refresher course every 5 years\n\\n\nAccrue at least 24 hours of trauma-related CE during the verification cycle\n\\n\n\\n\n\\n\nWith locations around the state, Hartford HealthCare offers exciting opportunities for career development and growth. Here, you are part of an organization on the cutting edge – helping to bring new technologies, breakthrough treatments and community education to countless men, women and children. We know that a thriving organization starts with thriving employees- we provide a competitive benefits program designed to ensure work/life balance. Every moment matters. And this is\nyour moment\n.\n\\n\nAs an Equal Opportunity Employer/Affirmative Action employer, the organization will not discriminate in its employment practices due to an applicant’s race, color, religion, sex, sexual orientation, gender identity, national origin, and veteran or disability status.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}