{
  "filename": "data_analyst_New_York__NY_page2_job3_Digital_Support_Analyst.html",
  "job_title": "Digital Support Analyst",
  "company": "WÜSTHOF GmbH",
  "location": "Milford, CT 06461",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:54:05.657Z",
  "full_description": "\\n\nThe Brand\n\\n\nWÜSTHOF has one mission since its beginning in 1814: crafting the finest knives that last for generations. Founded in Solingen, Germany, known for centuries as the \"City of Blades,\" the brand is owned by the seventh generation of the WÜSTHOF family. In their state-of-the-art manufacturing facility, the company creates a variety of knife collections and cooking utensils. WÜSTHOF is appreciated for its art of crafting; it takes over forty manufacturing steps to make a WÜSTHOF knife, with many made by hand, using traditional skills and techniques. Forged knives from the famous CLASSIC Collection have become the symbol of WÜSTHOF and are a lifelong companion for chefs all over the world. With over 350+ employees in North America and Europe, the brand is available at leading culinary retailers worldwide.\n\\n\n\\n\nPosition Overview\n\\n\nThe Digital Analyst will support the Digital Team from a technical perspective. This includes working cross functionally and internationally with Operations, Finance and Digital to ensure parity within the digital landscape. This role will support our .com team as well as our Amazon/Marketplace teams. This role requires a self-starter that can bring projects to completion by the deadline set. As well as look for insights in the data, providing recommendations to the team.\n\\n\nKey Responsibilities & Duties\n\\n\n\\n\nOwnership of digital data requests and reporting on a daily, monthly, etc. basis.\n\\n\nCollaborate with the digital team to submit product forecasts and demand, ensuring best sellers remain 100% in stock\n\\n\n\\n\nDemand planning to ensure healthy in-stock levels to optimize sales.\n\\n\nCoordinate with CS and Manager for maximum Amazon PO confirmation rate.\n\\n\nData integrity to ensure accuracy, consistency and completeness across all reporting.\n\\n\n3. ADHOC data requests by the digital team\n\\n\n\\n\n\\n\nQualifications & Skills:\n\\n\n\\n\nExcellent analytical skills utilizing Excel, SQL or native platform reporting like Shopify\n\\n\nAmazon Vendor Central understanding\n\\n\nUnderstanding of GA4 and LookerStudio\n\\n\nExperience developing reports and manipulating data in Excel or a Business Intelligence tool\n\\n\nAction-oriented with strong follow-through and prioritization skills\n\\n\nMust have the ability to work with a rapidly changing business and thrive in a fast-paced environment while hitting deadline\n\\n\n\\n\nWÜSTHOF is an equal opportunity employer and we are committed to creating a diverse team. We will consider all qualified applicants regardless of age, race, color, religion, gender, gender, gender, gender identity or expression, sexual orientation, national origin, disability, genetics, or veteran status.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}