{
  "filename": "data_analyst_New_York__NY_page11_job12_Operations_Business_Analyst_I_.html",
  "job_title": "Operations Business Analyst I - Property Preservation",
  "company": "Cenlar FSB",
  "location": "425 Phillips Boulevard, Ewing, NJ 08618",
  "salary": "$50,716 - $77,596 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:24:43.578Z",
  "full_description": "Cenlar is the nation’s leading mortgage loan subservicer. Our unique culture is defined by our core values of respect, trust, integrity and care. A promote-from-within philosophy, and opportunities for continuous professional growth make Cenlar a great place to launch or boost your career.\nThe Operations Business Analyst provides detailed and summary reporting to assist in the monitoring of the quality, processing timeliness and regulatory compliance. The Analyst works with a cross-functional team to design, plan, develop and implement initiatives around both new and existing processes and identifies and executes on strategies to improve workflow through automation and/or enhanced reporting. This position collaborates with various business units across the company, including leadership, to translate business needs into strategies and plans with focused execution.\nJob Responsibilities\n\\n\n\\n\nProvides detailed and summary reporting to assist in the monitoring of the quality, processing timeliness and regulatory compliance\n\\n\nWorks with a cross-functional team in planning, developing and implementing initiatives around both new and existing processes\n\\n\nIdentifies and executes on strategies to improve workflow through automation and/or enhanced reporting\n\\n\nPartners directly with business owners to implement solutions to process defects\n\\n\nCreates task plans and action items for tracking projects, timeline adherence, and follow-ups with business units\n\\n\nManages and executes a schedule of daily, weekly and monthly reports to provide detail and summary reports for the purpose of monitoring the work of the processing vendor\n\\n\nDevelops, runs and quality controls ad-hoc reports as requested\n\\n\nBuilds and maintains relationships with key individuals within the organization business teams and use these relationships to align needs within the department and initiate process changes\n\\n\nWorks with a cross-functional team in planning, developing and implementing initiatives around both new and existing processes\n\\n\nAnalyzes internal practices, understands the business risk management needs, and research both internal and external solutions for process improvements\n\\n\nDevelops, maintains and monitors reporting to support department leadership in the areas of staffing requirements, work-force management, productivity statistics and other key metrics utilized in running the business unit\n\\n\nMaintains working knowledge of departmental processes and procedures to identify opportunities for process improvements that result in efficiency gains, cost savings and/or risk mitigation, and work with management/staff to implement approved initiatives\n\\n\nKeeps abreast of developments within the broad area of IT and looks for opportunities to apply them to the company/department goals\n\\n\nProvides daily, weekly, and monthly updates to management, as necessary\n\\n\nAssists with project support in reporting, root cause analytics, process mapping, and tracking/reporting of results\n\\n\nAppropriately assess risk when business decisions are made, include but not limited to compliance and operational risk. Demonstrate consideration for Cenlar’s reputation as well as our clients, by driving compliance with applicable laws, rules and regulations, adhering to Policy, applying sound ethical judgment regarding personal behavior, conduct and business practices, and escalating, managing and reporting control issues, as well as effectively supervise the activity of others and create accountability with those who fail to maintain these standards.\n\\n\nRequirements:\n\\n\n\\n\nBachelor’s Degree or equivalent experience\n\\n\n1 to 3 years of Mortgage Banking industry experience preferred\n\\n\nProject management/leadership and/or business analyst experience preferred\n\\n\nExcellent critical thinking and logical reasoning abilities\n\\n\nOrganizational and prioritization skill\n\\n\nExcellent verbal and written communication skills\n\\n\nDesire to learn and understand processes with ability to translate learnings into actionable tasks\n\\n\nMedium technical skills specifically in Excel, Access, SQL, and SharePoint a plus\n\\n\nAbility to multi-task\n\\n\nAbility to work with all levels of individuals as a team player\n\\n\nTotal Rewards:\nAt Cenlar, you’ll receive an outstanding benefits package that includes paid medical, dental, and life insurance, 401(k), and tuition assistance as well as opportunities for training and professional advancement.\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, sexual orientation, gender identity), national origin, age, disability, or status as a protected veteran.\nCenlar is a Drug-Free Workplace committed to maintaining a safe, healthy, and productive work environment. All employment offers are contingent upon successfully passing any required drug screening in accordance with applicable laws and company policy.\nCenlar complies with the Americans with Disabilities Act and state laws. Applicants needing accommodation for any hiring step—such as completing a form, test, or interview—should let us know by contacting recruitment@cenlar.com\nThe actual compensation offered will depend on factors including but not limited to the candidate's experience, qualifications, skills, and location. This range listed below represents the reasonable minimum and maximum salary the company expects to pay for this position.",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=ce6465d781cb97cc&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfonhnakuq7821&spon=0&xkcb=SoDZ67M3pv5R5RSC4J0HbzkdCdPP&xfps=17fb4d03-25cf-4f3e-a8b8-65cb9a107745&vjfrom=vjs&asub=mob&astse=9c1ec249b878e4f6&assa=3962"
}