{
  "filename": "data_analyst_New_York__NY_page11_job13_Data_Analyst___Center_for_Pati.html",
  "job_title": "Data Analyst - Center for Patient Safety Science",
  "company": "Columbia University",
  "location": "New York, NY",
  "salary": "$66,300 - $70,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:24:49.369Z",
  "full_description": "\\n\n\\n\nJob Type: Officer of Administration\n\\n\nRegular/Temporary: Regular\n\\n\nHours Per Week: 35\n\\n\nSalary Range: $66,300 - $70,000\n\\n\n\\n\n\\n\nThe salary of the finalist selected for this role will be set based on a variety of factors, including but not limited to departmental budgets, qualifications, experience, education, licenses, specialty, and training. The above hiring range represents the University's good faith and reasonable estimate of the range of possible compensation at the time of posting.\n\\n\n\\n\n\\n\nPosition Summary\n\\n\nThe Columbia University Center for Patient Safety Science (CPSS) is seeking a Full-Time Data Analyst. Launched by Columbia University Irving Medical Center (CUIMC), CPSS aims to advance the science and tools necessary to achieve zero patient harm. The Center unites multidisciplinary teams of clinicians, researchers, data scientists, statisticians, and other experts to tackle significant patient safety challenges, enhancing the safety and quality of care for patients at CUIMC/NewYork-Presbyterian and globally. The successful candidate will be proactive, collaborative, and able to work effectively with others to achieve shared goals.\n\\n\n\\n\nResponsibilities\n\\n\n\\n\nProvide data analyst support for CPSS projects.\n\\n\nQuery the clinical data warehouse to obtain relevant data.\n\\n\nClean, organize, and merge data from multiple sources.\n\\n\nConduct exploratory data analysis.\n\\n\nCoordinate with the team to ensure the accuracy and efficiency of data collection and data entry tools and processes.\n\\n\nPrepare summary statistics, tables, and figures for reports and presentations under supervision.\n\\n\nPerform advanced data analysis under the guidance of data scientists and clinician scientists.\n\\n\nPerform additional related duties as needed\n\\n\n\\n\n\\n\nMinimum Qualifications\n\\n\n\\n\nBachelor’s degree or equivalent in education and experience\n\\n\nAbility to work on campus at Columbia University Irving Medical Center\n\\n\nStrong project management and multitasking abilities\n\\n\nWillingness to take initiative and solve problems\n\\n\nAbility to learn new skills and data models\n\\n\nExcellent communication skills and the ability to work in multidisciplinary teams\n\\n\nStrong interpersonal skills for establishing and maintaining good working relationships\n\\n\n\\n\n\\n\nPreferred Qualifications\n\\n\n\\n\nMaster’s degree in data science, computer science, or related field\n\\n\nProficiency in SQL\n\\n\nProficiency in Python or R\n\\n\nBackground in statistics\n\\n\nAbility to independently conduct exploratory data analysis\n\\n\nExperience working with healthcare data\n\\n\n\\n\n\\n\nOther Requirements\n\\n\n\\n\nSuccessful completion of applicable compliance and systems training requirements\n\\n\n\\n\n\\n\nEqual Opportunity Employer / Disability / Veteran\n\\n\nColumbia University is committed to the hiring of qualified local residents.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=f31a4f47775d18e4&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfonhnakuq7821&spon=0&xkcb=SoBt67M3pv5R5RSC4J0GbzkdCdPP&xfps=3a241893-18cc-42e9-961a-7d8f14710093&vjfrom=vjs&asub=mob&astse=d8d389b46a01e3db&assa=4537"
}