{
  "filename": "data_analyst_New_York__NY_page4_job13_Temp_Senior_Analyst__Customer_.html",
  "job_title": "Temp Senior Analyst, Customer & Behavioral Insights",
  "company": "David Yurman Enterprises LLC",
  "location": "New York, NY 10013•Hybrid work",
  "salary": "$50 - $55 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:58:27.115Z",
  "full_description": "\\n\nAbout Us\n\\n\nDavid Yurman is a celebrated American jewelry company founded in New York by David Yurman, a sculptor, and his wife, Sybil, a painter and ceramicist. When the artists began collaborating, their goal was simply to make beautiful objects to wear. Led today by their son Evan, David Yurman creates timeless, yet contemporary collections for women and men defined by inspiration, innovation, consummate craftsmanship and cable – the brand’s artistic signature. David Yurman collections are available at 50 retail stores throughout the United States, Canada, Hong Kong and France and at over 300 locations worldwide, through their exclusive authorized fine jewelry and timepiece network of retailers.\n\\n\n\\n\nOur Values\n\\n\nAt David Yurman, creativity, innovation and impeccable craftsmanship are at the core of everything we do. Fueled by the energy of our hometown, New York City, artistic passion informs each and every jewelry design. The Yurman family’s guiding vision continually defines and redefines what it means to be the preeminent American luxury jewelry brand. We are committed to responsible business and social practices and to the protection and advancement of human rights. We believe in partnering with others who share these values and understand their importance.\n\\n\n\\n\nJob Description\n\\n\nJob Title:\nTemp Senior Analyst, Customer & Behavioral Insights\nDuration:\n3–6 months\n\\n\nOverview\n\\n\nWe’re looking for a hands-on Senior Analyst to answer high-value questions about what drives customer lifetime value and to help enrich our CRM with behavioral data. You’ll dig into purchase patterns, geographies, product preferences, and engagement signals to understand:\nWhich behaviors or attributes actually move LTV? Are they changing over time? When do customers fall off? What’s different about customers who move from silver gold tiers?\n\\n\nThis role is for someone who can do the analysis and communicate clear, tight, actionable summaries for business stakeholders.\n\\n\nEssential Duties & Responsibilities\n\\n\n\\n\nAnalyze purchase behavior (first product, AOV, category mix, gifting vs self, channel, promo sensitivity) to determine impact on LTV and retention.\n\\n\nIdentify location / store / market-level attributes that correlate with higher value or faster repeat.\n\\n\nBuild time-based and cohort views to answer:\\n\n\\n\nAre LTV drivers changing over time?\n\\n\nAre recent cohorts better/worse than LY?\n\\n\nAt what tenure/age do customers fall off?\nWhat’s different about customers who upgrade (e.g. silver\\n\ngold)?\n\\n\n\\n\nChase down data owners and source teams to validate, reconcile, and ensure what we publish is trusted.\n\\n\nPresent concise, business first findings to non-technical partners\n\\n\n\\n\nMust-Haves\n\\n\n\\n\nAdvanced SQL (4–6+ years): complex joins, CTEs, window functions, building cohorts directly from transactions / customer tables.\n\\n\nStrong customer data background (retail, ecommerce, or similar).\n\\n\nComfortable validating, reconciling, and questioning when numbers don’t line up\n\\n\nExperience turning vague asks (“are our high-value customers changing?”) into structured analysis.\n\\n\nComfortable in Snowflake/BigQuery or similar\n\\n\n\\n\nNice-to-Haves\n\\n\n\\n\nTableau or Sigma for building exec-facing views / self-serve assets.\n\\n\nGA4, Adobe Analytics, or similar for behavioral/digital funnel signals.\n\\n\nRetail / luxury / loyalty exposure.\n\\n\n\\n\nLocation:\nTribeca NYC / Hybrid (remote possible for the right candidate)\n\\n\nEstimated Pay Rate:\n$50.00-$55.00 per hour\n\\n\nBase pay is one component of David Yurman’s total compensation package, which may also include the following for eligible employees: access to healthcare benefits, 401(k) plan, bonus, employee discounts, Summer Fridays (corporate roles), generous paid time off, sick time, and more.\n\\n\n\\n\nDiversity, Equity & Inclusion at David Yurman\n\\n\nAs a company founded by artists, David Yurman champions self-expression in everything we do. We are committed to fostering a culture of openness and creative collaboration within our entire community, and we cherish the diversity of our employees’ backgrounds and perspectives. We will always advocate for equity and inclusion for all.\n\\n\n\\n\nDavid Yurman is an Equal Employment Opportunity employer and provides equal opportunities to all employees and applicants without regard to an individual’s age, race, creed, color, religion, national origin, sex (including pregnancy, sexual orientation, gender).\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}