{
  "filename": "data_analyst_New_York__NY_page3_job12_Lead_Digital_Product_Analyst.html",
  "job_title": "Lead Digital Product Analyst",
  "company": "Bombas",
  "location": "New York, NY",
  "salary": "$110,000 - $150,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:56:36.985Z",
  "full_description": "\\n\nJob Title:\n\\n\nLead Digital Product Analyst\n\\n\nAbout Bombas:\n\\n\nBombas is a comfort focused premium basics brand with a mission to help those in need. The company launched in 2013, after the founders learned that socks are the #1 most requested clothing item at homeless shelters. From there, they set out to solve that problem, donating a pair of socks for every pair they sell. How do you donate a lot of socks? You sell a lot. And how do you sell a lot? You make the most comfortable socks in the history of feet. Millions of pairs sold and donated later, Bombas has continued to innovate within its mission and product, introducing new socks, as well as underwear and t-shirts, the #2 and #3 most requested clothing items at homeless shelters, all while continuing to make a positive impact on the community where we all work and live.\n\\n\nClick\nhere\nto see what it's like to work inside the Bombas Hive!\n\\n\nThe word Bombas is derived from the Latin word for bumblebees. Bees work together to make their hive a better place. At Bombas, we're inspired by that. We know it's the collective efforts of our team that keeps the Hive alive and strong - a team that is diverse and inclusive. Different perspectives strengthen our ability to make the most comfortable versions of the products people wear closest to their bodies every day and to serve the communities where we all work and live. We are committed to continuously building a Hive where all are welcomed, seen, and heard regardless of age, color, ethnicity, gender, gender identity, genetics, physical or mental ability, protected veteran status, race, religion and sexual orientation. As a team, we will strive to create room for different experiences and empower all voices.\n\\n\n\\n\nBased on the specific needs and job requirements, this role will be working out of our Bombas HQ in New York City.\n\\n\n\\n\nAbout the Job:\n\\n\nWe are looking for a strategic, data-driven, and impact-oriented individual to join our Customer Analytics team as a\nLead Digital Product Analyst\n, reporting directly to our Director of Analytics. The ideal candidate has 4–6+ years of experience in site analytics, experimentation, and eCommerce performance optimization.\n\\n\nThis role is perfect for someone who thrives at the intersection of data, product, and customer experience, and who is eager to build the analytical foundation that drives our site experience forward.\n\\n\nYou'll partner closely with Digital Product, Engineering, Site Merchandising, and Data Platform teams to track site performance, strategize site testing and optimizations, and analyze site behavior to uncover insights. You'll be responsible for driving site analytics practices, collaborating on A/B test designs and readouts, ensuring data accuracy, and building data models to explore site behavior and provide clarity across tracking and measurement systems.\n\\n\nWhat you'll be responsible for:\n\\n\n\\n\nServe as the analytics lead for site performance, partnering with Digital Product, Engineering, and cross-functional teams to scope questions, design A/B tests and analyses, and deliver actionable insights.\n\\n\nBuild and maintain dashboards in Heap and Looker that provide visibility into site funnel performance, customer journeys, and conversion KPIs.\n\\n\nConduct deep-dive analyses of on-site behavior and performance to inform product and eCommerce strategy, and present findings to stakeholders.\n\\n\nPartner with Digital Product on the design, execution, and analysis of A/B and multivariate tests, ensuring statistical rigor and actionable learnings.\n\\n\nDevelop and refine site metrics and performance frameworks, ensuring consistent definitions and alignment across teams.\n\\n\nPartner with Engineering and Product to define, implement, and validate tracking across site analytics systems (Heap, Optimizely, GTM, Contentsquare, etc.), ensuring accurate tagging, data integrity, and quality.\n\\n\nCollaborate with Data Engineering and Platform teams to build site data models and ensure accuracy of site analytics tooling.\n\\n\nTranslate complex findings into clear, compelling data stories that influence site strategy, roadmap prioritization, and feature development.\n\\n\n\\n\nWhat we'll love about you:\n\\n\n\\n\nStrong SQL skills and experience analyzing large-scale site datasets.\n\\n\nHighly proficient with site analytics tools (preferably Heap) and BI tools (preferably Looker), with a track record of building actionable dashboards.\n\\n\nHands-on experience working with engineers to build site event tracking, GTM, and implementation best practices.\n\\n\nExperience collaborating with both technical and non-technical stakeholders to translate business needs into practical engineering requirements.\n\\n\nDemonstrated experience designing and analyzing A/B tests (Optimizely or equivalent), with strong statistical knowledge (confidence intervals, lift analysis).\n\\n\nProficiency in statistics, including hypothesis testing, significance calculations, and regression analysis.\n\\n\nFamiliarity with ETL processes, data modeling, and site instrumentation best practices.\n\\n\nExcellent project management and stakeholder engagement skills, with the ability to manage multiple projects simultaneously.\n\\n\nDeep understanding of eCommerce performance metrics funnels, conversion optimization, and customer journeys.\n\\n\nStrategic thinker who balances detail-oriented execution with big-picture insights.\n\\n\nStrong communicator who can translate complex data into actionable business recommendations.\n\\n\nComfortable working cross-functionally and driving alignment across multiple stakeholders.\n\\n\n\\n\nWhat you'll love about us:\n\\n\n\\n\nWe are a team of smart, interesting, diverse, funny, and loving people.\n\\n\nWe offer competitive compensation, employer paid health, medical and dental benefits, 401k with match, paid parental leave, snacks, socks and a fun, relaxed office environment.\n\\n\nWe take the responsibility to make sure you are excited, happy, and find fulfillment in your work very seriously.\n\\n\nWe value fun. This is why we host office lunches, offsite team outings and company retreats.\n\\n\nWe believe in giving back to the community and helping those in need, which is why we volunteer as a team regularly.\n\\n\nWe believe success comes from the collective effort of all, which is why all full-time employees receive equity in the business.\n\\n\nWe understand the value of health, relaxation, spending time with friends and family, and traveling the world and offer flexible paid time off for all full-time employees. This includes over 20 paid company holidays, year-round \"Flexible Fridays\" and unlimited vacation, sick, and wellness days.\n\\n\nWe understand the importance of communication and offer a monthly phone stipend for all full-time employees.\n\\n\nWe believe a healthy body equals a healthy mind, so we offer a $100 monthly wellbeing reimbursement to all full-time employees.\n\\n\n\\n\nWhat you'll bring:\n\\n\n\\n\n4–6+ years of experience in site analytics, eCommerce analytics, or digital product analytics.\n\\n\nAdvanced SQL skills, with the ability to query and manipulate large datasets.\n\\n\nProficiency in statistics, including hypothesis testing, significance calculations, and regression analysis.\n\\n\n\\n\nBombas is committed to delivering competitive and equitable pay for our employees.\n\\n\nEach component of the Bombas total rewards package, including benefits and pay, is aimed at contributing to an environment where team members have resources to manage their lives and are enabled to focus on doing their best work.\n\\n\nThe pay range for this position at the start of employment is expected to be between\n$110,000 and $150,000/year\n. However, the base pay offered may vary depending on multiple factors, including job-related knowledge, skills, experience, market factors, and business need.\n\\n\nThe Bombas total rewards package offered for this position may also include other elements, such as annual bonus and equity target award opportunities as well as medical, financial, and well-being benefits. Additional details of these benefits will be provided if a candidate receives an offer of employment.\n\\n\nIf hired, the position is \"at-will\" and the Company reserves the right to modify any component, plan, or program of the total rewards package at any time, for any reason.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n             #LI-TS1\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nIf you require reasonable accommodation in completing this application, interviewing, completing any employment testing, or otherwise participating in this hiring process, please direct your inquiries to\njobs@bombas.com\n.\nOnly requests related to accommodations will be responded to.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}