{
  "filename": "data_analyst_New_York__NY_page7_job6_Associate___Front_Office_Busin.html",
  "job_title": "Associate - Front Office Business Analyst",
  "company": "Morgan Stanley",
  "location": "1585 Broadway Avenue, New York, NY 10036",
  "salary": "$90,000 - $150,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:14:05.349Z",
  "full_description": "\\n\nIn the Technology division, we leverage innovation to build the connections and capabilities that power our Firm, enabling our clients and colleagues to redefine markets and shape the future of our communities. This is a Business Analysis III position at the Associate level, which is part of the job family responsible for analyzing business processes, identifying needs, and establishing requirements to enhance efficiency and productivity through a blend of business acumen and analytical skills.\n\\n\n\\n\nMorgan Stanley is a leading global financial services firm providing a wide range of investing banking, securities, investment management and wealth management services. The firm's employees serve clients worldwide including corporations, governments, and individuals from more than 1,200 offices in 43 countries. As a market leader, the talent and passion of our people is critical to our success. Together, we share a common set of values rooted in integrity, excellence, and strong team ethic. Morgan Stanley can provide a superior foundation for building a professional career - a place for people to learn, to achieve and grow. A philosophy that balances personal lifestyles, perspectives and needs is an important part of our culture.\n\\n\n\\n\nRole Profile:\nMutual Fund technology team at Morgan Stanley is a dynamic and innovative department that is responsible for Mutual Fund Trading, Execution and Settlement with the fund companies. Our team is looking for a dynamic, self -motivated, highly driven and technology savvy individual to fill the role of Trading Business Analyst. This role supports the team in leading key strategic and regulatory initiatives. You will work on variety of game changing projects and help shape the future of Mutual Fund platform.\n\\n\nWhat you’ll bring to the role:\n\\n\n\\n\nDevelop a deep understanding of Mutual Fund trading and middle office functions that support order execution, confirmation, and settlement.\n\\n\nPartner with Technology, Business and Operations partners to understand and elaborate requirements while driving strategic business and platform goals.\n\\n\nParticipate in technical design discussions to ensure the design meets specifications and drive cross system integrations.\n\\n\nDocument functional requirements, define system integration API details, data model requirements while supporting test plans and defining in-depth User Acceptance Criteria’s\n\\n\nLead and manage projects through development, testing and deployment to production by aligning respective teams, setting expectations, and addressing requirement related questions.\n\\n\nIdentify strategies and improvement opportunities while also reengineering processes for greater efficiency.\n\\n\nProvide updates to the key stakeholders on the progress and any delays or risks.\n\\n\nBe highly motivated, willing to learn and engage with global team.\n\\n\n\\n\n\\n\nWhat you’ll do in the role:\n\\n\n\\n\nBachelor’s in business, Computer Science, Finance, Engineering, Physics, Math or equivalent experience.\n\\n\nThe ability to translate business requirements to technical specifications and technical stories ensuring delivery aligns with stakeholder expectations.\n\\n\nStrong communication skills, highly detail oriented with solid analytical and problem-solving skills.\n\\n\nAbility to get things done in a highly dynamic, often evolving business environment while demonstrating flexibility and adaptability to changes in priorities.\n\\n\nAbility to write, update and execute SQL queries and expertise in UML use case diagrams.\n\\n\nProficiency in understanding system architecture, design, domain data models and system integration details.\n\\n\nKnowledge of financial services industry and an understanding of end-to-end system development life cycles.\n\\n\nA proven ability to build strong collaborative working relationships with business partners and department leads.\n\\n\nStrong understanding of the Agile Software Development Lifecycle and proficiency with process diagramming and project management tools.\n\\n\n\\n\n\\n\nWHAT YOU CAN EXPECT FROM MORGAN STANLEY:\n\\n\n\\n\nWe are committed to maintaining the first-class service and high standard of excellence that have defined Morgan Stanley for over 89 years. Our values - putting clients first, doing the right thing, leading with exceptional ideas, committing to diversity and inclusion, and giving back - aren’t just beliefs, they guide the decisions we make every day to do what's best for our clients, communities and more than 80,000 employees in 1,200 offices across 42 countries. At Morgan Stanley, you’ll find an opportunity to work alongside the best and the brightest, in an environment where you are supported and empowered. Our teams are relentless collaborators and creative thinkers, fueled by their diverse backgrounds and experiences. We are proud to support our employees and their families at every point along their work-life journey, offering some of the most attractive and comprehensive employee benefits and perks in the industry. There’s also ample opportunity to move about the business for those who show passion and grit in their work.\n\\n\n\\n\nTo learn more about our offices across the globe, please copy and paste https://www.morganstanley.com/about-us/global-officesinto your browser.\n\\n\n\\n\n\\n  Expected base pay rates for the role will be between $90,000 and $150,000 per year at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.\\n\n\\n\n\\n\nMorgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees.\n\\n\n\\n\nIt is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law.\n\\n\n\\n\nMorgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=d436209fc7db2472&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfo1hnsi8qp803&spon=0&xkcb=SoBp67M3pv4J5G2EiJ0NbzkdCdPP&xfps=1f3b5fee-81bd-4829-9d0b-eb567ada76ef&vjfrom=vjs&asub=mob&astse=91fa8124ada6f0fe&assa=9988"
}