{
  "filename": "data_analyst_New_York__NY_page11_job5_Information_Technology_Analyst.html",
  "job_title": "Information Technology Analyst 1",
  "company": "New Jersey Courts",
  "location": "Trenton, NJ 08625•Hybrid work",
  "salary": "$60,909.02 - $100,301.72 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:23:30.428Z",
  "full_description": "JOB\nIf another position becomes available within five months of this recruitment’s closing date, the applicant pool from this posting may be used to fill additional vacancies.When you come to work for New Jersey Judiciary you will join an 8500-member strong TEAM that operates with the highest standards of independence, integrity, fairness and quality service. You will be engaged with work that has purpose, meaning and makes a difference in lives of the public we serve. We work hard every day to build the public’s trust and confidence in our court system, which includes issues such as bail reform, marijuana decriminalization and recovery court. Whether it be in a courtroom, an administrative office, a courthouse training room, an IT office or in the field, our Judiciary workforce is improving the lives of countless individuals and families every day. We honor the dignity and individualism of each member of our organization while fostering professionalism and continuous improvement in our work.SALARY: The salary range for this position is $60,909.02 to $100,301.72 for Schedule A, and $60,909.02 to $95,286.62 for Schedule B. For newly hired individuals, the starting salary will normally be at the minimum of the salary range. For current Judiciary employees, salary upon promotion or advancement will be an increase of 5% of base salary, not to exceed the maximum of the range, or the minimum salary of the band/level, whichever is greater. Judiciary employees hired prior to June 3, 2014, are considered Schedule A. Newly hired individuals, and Judiciary employees hired on or after June 3, 2014, are considered Schedule B.The Judiciary offers a strong opportunity for growth.The New Jersey Judiciary is seeking an organized, customer service oriented individual with excellent total quality management, technical application, and written communication to join the Office of Probation Services Reports, Analytics, and Statistics Unit (RAS). Under the direction of the Court Executive 2b, the ITA1 will perform statistical analyses of Probation Services related data using applied research methods and conduct research on Probation best practices.The selected individual will assist in the preparation, presentation and dissemination of research findings, including writing research reports; assist in the development and usage of appropriate and sound methodology to design and manage research projects; and perform simple to moderately complex statistical analyses of criminal justice and non-criminal justice data sets utilizing Focus/WebFocus, SAS/SPSS, Access, Excel or other statistical software.REMOTE WORK: The Judiciary currently offers a hybrid work schedule, and this position may qualify for up to 2 days of remote work outside of Judiciary buildings. To participate in this program, in addition to installing a multifactor authentication app on your phone or tablet, you will be required to have high speed home internet access.\nEXAMPLE OF DUTIES\nDefining project requirements with related project milestones and schedules.Acting as a liaison between external customers (including judges, court staff, attorneys, and other governmental entities) and the RAS team.Develop specifications for new dashboards utilizing Web Focus and Tableau. Construct workflow diagrams, generate user documentation, recommend changes to new and existing systems in partnership ATCSU and ITO. Design logical and physical databases and database schemas.Conduct quantitative or qualitative research of processes, programs and/or projects. Respond to Vicinage and Management requests for specific data from the various systems to enhance probation supervision. Analyze and/or troubleshoot programming issues that are related to data received from outside vendors. Reviewing the data and conducting quality assurance testing to assure data is accurate and business rules are being applied properly while programming.Coordinate oversight of both the new Quality Assurance Initiatives and dashboards under development.Assist in implementing the new Quality Assurance programs based on the risk screening tools; Assist with coordinating the roll-out of the Quality Assurance and Risk Assessment initiatives statewide.Regular and predictable physical presence at the worksite is an essential function of this position.\nSUPPLEMENTAL INFORMATION\nPhysical Ability:\nFor some positions, applicants must have the ability to perform work which requires climbing and prolonged standing, stretching, bending and reaching. The selected candidate must be able to frequently lift and carry supplies weighing from 30 to 50 pounds and, occasionally, materials weighing up to 75 pounds. Driver's License: Appointees will be required to possess a driver’s license valid in New Jersey only if the operation of a vehicle, rather than employee mobility, is necessary to perform essential duties of the position. Authorization to Work: US citizenship is not required. Selected candidate must be authorized to work in the US according to Department of Homeland Security, US Citizenship and Immigration Services regulations.Special Note: Newly hired employees must agree to a thorough background check that will include fingerprinting. All data received will be kept in strict confidence except to inform the individual of the findings and what action will be taken as a result of this information.Residency Law: In accordance with N.J.S.A. 52:14-7 (L. 2011, Chapter 70), the \"New Jersey First Act,\" all persons newly hired by the Judiciary within one year must establish, and then maintain, principal residence in the State of New Jersey. Any person may request an exemption from that requirement from the Employee Residency Review Committee in the Department of Labor & Workforce Development on the basis of either hardship or employer critical need. HOW TO APPLY: The NJ Judiciary requires all applicants to complete the application process fully and as instructed. All applicants must complete the work experience and education sections and attach any required documents. Applications must describe all relevant work experience in detail, beginning with your current or most recent job, including military service (indicate rank), internships and job-related volunteer work, if applicable. Use a separate section to describe each position. Applicants who indicate \"see resume\" or enter their initials to acknowledge that they have skipped the Work History and Education sections will not be considered, unless they do not possess any education history or work experience. Only applicants that follow the application instructions and submit completed applications will be considered.The New Jersey Judiciary consists of: the Supreme Court, the Superior Court including the Appellate Division and the Trial Court of the 15 vicinages in New Jersey, the Tax Court and the Municipal Court System. The Administrative Office of the Courts provides technical assistance, operational support, training, research and development, budget and personnel coordination, and development and operation of information systems for the Courts of New Jersey. The Judiciary of New Jersey is an Equal Opportunity/Affirmative Action Employer Committed to Ensuring an Open Door to JusticeNeoGov applicant support at 1-877-204-4442 (toll free call) Monday through Friday, 6:00 AM to 6:00 PM Mountain Time (MT)",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=cc267275bbf9cc88&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfonhnakuq7821&spon=0&xkcb=SoAK67M3pv5R5RSC4J0ObzkdCdPP&xfps=2b370953-dfde-4a9f-a3ac-f4ca3d9a29f3&vjfrom=vjs&asub=mob&astse=e7b064dce6d0a899&assa=821"
}