{
  "filename": "data_analyst_New_York__NY_page5_job6_Global_Capital_Markets_Busines.html",
  "job_title": "Global Capital Markets Business Control Unit, Analyst/Associate",
  "company": "Morgan Stanley",
  "location": "1585 Broadway Avenue, New York, NY 10036",
  "salary": "$140,000 - $250,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:59:28.118Z",
  "full_description": "\\n\nThe IBD and GCM Business Control Unit within IBD and GCM Management supports IBD and GCM in executing a variety of strategic, financial and regulatory initiatives, including the client and transaction onboarding process to meet the Firm’s regulatory and internal requirements as related to assessments of Know Your Customer (KYC), anti-money laundering, anti-corruption, sanctions and franchise-related matters. This position provides an opportunity to support the oversight of the onboarding process for the Investment Banking Division (IBD) and Global Capital Markets (GCM) businesses.\n\\n\n\\n\nKey Responsibilities:\n\\n\n- Provide guidance to investment banking division (IBD) and global capital markets (GCM) teams and/or operations teams on satisfying onboarding requirements for a given transaction\n\\n\n- Monitor progression of outstanding onboarding processes and work with IBD and GCM teams and relevant functions to progress processes as needed\n\\n\n- Support the completion of applicable diligence reviews for a given transaction, including assessing potential issues, coordinating between deal teams and relevant control functions and escalating issues as needed\n\\n\n- Communicate developments on transactions to senior stakeholders\n\\n\n- Develop and implement strategic enhancements to the IBD and GCM onboarding process and related controls\n\\n\n- Produce onboarding-related reporting and training materials for senior audiences\n\\n\n- Opportunity to support additional strategic initiatives and projects for the IBD and GCM BCU teams\n\\n\n\\n\nQualifications\n\\n\n- Bachelor’s degree, with 2-10 years of relevant financial industry experience; experience with client onboarding, KYC and anti-financial crimes related regulatory requirements a plus\n\\n\n- Solid analytical skills, with familiarity or interest in investment banking and capital markets activities and products\n\\n\n- Strong verbal and written communication skills\n\\n\n- Ability to establish and maintain positive intra-department and cross-functional working relationships\n\\n\n- Solution-oriented, with ability to “think out of the box” and to manage to tight timelines\n\\n\n- Ability to work independently, with strong attention to detail\n\\n\n- Ability to work effectively in a team environment\n\\n\n- Ability to work effectively in a team environment and provide guidance to junior team member\n\\n\n\\n\nWHAT YOU CAN EXPECT FROM MORGAN STANLEY:\n\\n\n\\n\nWe are committed to maintaining the first-class service and high standard of excellence that have defined Morgan Stanley for over 89 years. Our values - putting clients first, doing the right thing, leading with exceptional ideas, committing to diversity and inclusion, and giving back - aren’t just beliefs, they guide the decisions we make every day to do what's best for our clients, communities and more than 80,000 employees in 1,200 offices across 42 countries. At Morgan Stanley, you’ll find an opportunity to work alongside the best and the brightest, in an environment where you are supported and empowered. Our teams are relentless collaborators and creative thinkers, fueled by their diverse backgrounds and experiences. We are proud to support our employees and their families at every point along their work-life journey, offering some of the most attractive and comprehensive employee benefits and perks in the industry. There’s also ample opportunity to move about the business for those who show passion and grit in their work.\n\\n\n\\n\nTo learn more about our offices across the globe, please copy and paste https://www.morganstanley.com/about-us/global-officesinto your browser.\n\\n\n\\n\nExpected base pay rates for the role will be between $140,000 and $250,000 per year for VP, at the commencement of employment. However, base pay if hired will be determined on an individualized basis and is only part of the total compensation package, which, depending on the position, may also include commission earnings, incentive compensation, discretionary bonuses, other short and long-term incentive packages, and other Morgan Stanley sponsored benefit programs.\n\\n\n\\n\nMorgan Stanley's goal is to build and maintain a workforce that is diverse in experience and background but uniform in reflecting our standards of integrity and excellence. Consequently, our recruiting efforts reflect our desire to attract and retain the best and brightest from all talent pools. We want to be the first choice for prospective employees.\n\\n\n\\n\nIt is the policy of the Firm to ensure equal employment opportunity without discrimination or harassment on the basis of race, color, religion, creed, age, sex, sex stereotype, gender, gender identity or expression, transgender, sexual orientation, national origin, citizenship, disability, marital and civil partnership/union status, pregnancy, veteran or military service status, genetic information, or any other characteristic protected by law.\n\\n\n\\n\nMorgan Stanley is an equal opportunity employer committed to diversifying its workforce (M/F/Disability/Vet).\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=9574edde655ce37c&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnbj48jn1a803&spon=0&xkcb=SoDn67M3pvmhsM20BR0NbzkdCdPP&xfps=02d12ec4-9566-4faf-b961-4cf58f24cc6b&vjfrom=vjs&asub=mob&astse=9e334efcad02ab95&assa=8450"
}