{
  "filename": "data_analyst_New_York__NY_page10_job13_Associate_Analyst_Supply_Chain.html",
  "job_title": "Associate Analyst Supply Chain Data COE",
  "company": "Campbell Soup Company",
  "location": "Camden, NJ",
  "salary": "$65,400 - $94,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:22:23.861Z",
  "full_description": "\\n\n\\n  Since 1869, we've connected people through food they love. We’re proud to be stewards of amazing brands that people trust. Our portfolio includes the iconic Campbell’s brand, as well as Cape Cod, Chunky, Goldfish, Kettle Brand, Lance, Late July, Pacific Foods, Pepperidge Farm, Prego, Pace, Rao’s Homemade, Snack Factory, Snyder’s of Hanover. Swanson, and V8.\\n\n\\n\n\\n\n\\n  Here, you will make a difference every day. You will be supported to build a rewarding career with opportunities to grow, innovate and inspire. Make history with us.\\n\n\\n\n\\n\n\\n  Why Campbell’s…\\n\n\\n\n\\n\nBenefits begin on day one and include medical, dental, short and long-term disability, AD&D, and life insurance (for individual, families, and domestic partners).\n\\n\nEmployees are eligible for our matching 401(k) plan and can enroll on the first day of employment with immediate vesting.\n\\n\nCampbell’s offers unlimited sick time along with paid time off and holiday pay.\n\\n\nIf in WHQ – free access to the fitness center. Access to on-site day care (operated by Bright Horizons) and company store.\n\\n\nGiving back to the communities where our employees work and live is very important to Campbell’s. Our “Campbell’s Cares” program matches employee donations and/or volunteer activity up to $1,500 annually.\n\\n\nCampbell’s has a variety of Employee Resource Groups (ERGs) to support employees.\n\\n\n\\n\n\\n\n\\n  How you will make history here...\\n\n\\n\n\\n  This position is responsible for supporting the data and analytics strategies for the Enterprise Planning Team. They will partner with key business stakeholders to understand metrics, risks and opportunities and then support the development of dashboards and exception management tools to track our business results and performance. Their goal is to grow their analytical expertise and develop a working knowledge of business context to support the COE Team in providing the Enterprise Planning Team with access to the right data at the right time to drive better business results.\\n\n\\n\n\\n\n\\n  What you will do...\\n\n\\n\n\\n\n\\n\n\\n    Responsible for publishing daily/weekly/monthly reports on schedule with consistent accuracy.\\n\n\\n\n\\n\n\\n    Provide training and troubleshooting support to users of existing reports and dashboards including working with IT to address any system issues that are driving reporting errors.\\n\n\\n\n\\n\n\\n    Develop a deep understanding of the various data sources (SAP, Envision, Mexvision, Power BI, etc.) and individual metrics/data that are critical to planning (Inventory, Production, Orders, etc.)\\n\n\\n\n\\n\n\\n    Support the blueprinting and development of new reports and dashboards to support the Enterprise Planning Team.\\n\n\\n\n\\n\n\\n    Create efficient, consolidated refreshable reports utilizing data from multiple sources by leveraging queries, pivot tables, statistical formulas, lookups, functions, and macros.\\n\n\\n\n\\n\n\\n    Drive continuous improvement by reducing manual data manipulation whenever possible through automation.\\n\n\\n\n\\n\n\\n    Support any testing required for upgrades to any data systems.\\n\n\\n\n\\n\n\\n\n\\n  Who you will work with...\\n\n\\n\n\\n\nReport into Manager, Data Analytics\n\\n\n\\n\n\\n\n\\n  What you bring to the table... (Must Have)\\n\n\\n\n\\n\n\\n\n\\n    Bachelor’s degree required.\\n\n\\n\n\\n\n\\n    6 months+ of work experience in supply chain or analytical role.\\n\n\\n\n\\n\n\\n    Microsoft Office skills, including Advanced Excel skills.\\n\n\\n\n\\n\n\\n\n\\n  It would be great if you have... (Nice to Have)\\n\n\\n\n\\n\n\\n\n\\n    Preferred Technical Skills: SAP ECC & APO, Power Query, Power BI, Power Automate, MicroStrategy Suite, Microsoft SharePoint Designer\\n\n\\n\n\\n\n\\n    1+ years of experience within Supply Chain\\n\n\\n\n\\n\n\\n    Continuous improvement mindset.\\n\n\\n\n\\n\n\\n\n\\n  Compensation and Benefits:\\n\n\\n\n\\n\n\\n  The target base salary range for this full-time, salaried position is between\\n\n$65,400-$94,000\\n\n\\n\n\\n  Individual base pay depends on work location and additional factors such as experience, job-related skills, and relevant education or training. Total pay may include other forms of compensation. In addition, we offer competitive health, dental, 401k and wellness benefits beginning on the first day of employment. Please ask your Talent Acquisition Partner for more information about our total rewards package.\\n\n\\n\n\\n\n\\n  The Company is committed to providing equal opportunity for employees and qualified applicants in all aspects of the employment relationship, including consideration for employment, without regard to race, color, sex, sexual orientation, gender identity, national origin, citizenship, marital status, protected veteran status, disability, age, religion, or any other classification protected by law.\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=fdb1b36aa682be99&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoj3k62dir088&spon=0&xkcb=SoBP67M3pv5DoOyJaB0GbzkdCdPP&xfps=6a9d9458-1877-4ecd-9fbf-d21bc764c6c4&vjfrom=vjs&asub=mob&astse=28a1e52f226c02b4&assa=4227"
}