{
  "filename": "data_analyst_New_York__NY_page13_job13_Analyst__Customer_Insights.html",
  "job_title": "Analyst, Customer Insights",
  "company": "KnitWell Group",
  "location": "7 Times Square, New York, NY 10036",
  "salary": "$66,300 - $79,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:28:52.383Z",
  "full_description": "\\n\nAbout us\nKnitWell Group, a specialty retail operating company, comprises some of the most iconic brands in America – Ann Taylor, Chico's, Haven Well Within, Lane Bryant, LOFT, Soma, Talbots, White House Black Market. Individually, our brands are unique and strong. Together, we are powerful.\n\\n\nOur common thread is our commitment to create exceptional products, provide memorable experiences, and achieve superior results. Our associates are innovators who thrive through collaboration and are dedicated to excellence. At the heart of it all are the customers we serve. We are dedicated to creating fashion that not only looks good but also makes our customers feel good.\\n\n\\n\nAbout the role\n\\n\nThe Customer Insights (CI) team provides consumer and market intelligence across our portfolio of women’s apparel brands. We partner with cross-functional teams to answer business questions and design research that helps uncover customers’ motivations, unmet needs, and shopping patterns. These findings guide decisions across product design, merchandising, planning & allocation, marketing, customer experience, and overall brand strategy.\n\\n\n\\n\nAs an Analyst on the CI team, you will support customer-facing projects ranging from quick-turn questions to larger research initiatives. Day-to-day work includes analyzing data, interpreting customer feedback, and preparing clear summaries for brand partners. We are looking for someone with strong analytical skills and a genuine interest in understanding the ‘why’ behind customer behavior.\n\\n\n\\n\nThe impact you can have\n\\n\n\\n\nCollaborate with CI team leads and business partners to design and field projects in support of priority business questions\n\\n\nSupport the execution of surveys, online customer communities, and other research methods, including questionnaire design, survey programming, and fieldwork monitoring.\n\\n\nAnalyze quantitative and qualitative data to identify patterns, themes, and insights\n\\n\nPrepare clear, organized data visuals and reports to communicate findings\n\\n\nMonitor macro customer, category, and competitive trends relevant to our brands\n\\n\n\\n\n\\n\nYou'll bring to the role\n\\n\n\\n\nBachelor’s Degree required\n\\n\n1-3 years of relevant professional experience preferred (e.g., strategy, research, consulting, corporate retail)\n\\n\nProficient in Microsoft PowerPoint, Word, Excel, Outlook\n\\n\nExperience with survey research platforms and statistical tools, like SPSS or Q, is a plus\n\\n\nAbility to interpret datasets, identify patterns, and visualize insights to tell a clear story\n\\n\nIntuitive understanding of consumer psychology, behavior and related business considerations\n\\n\nStrong attention to detail and high standards of accuracy in analysis and reporting\n\\n\nExperience or demonstrated interest in retail / fashion\n\\n\nStrong interpersonal skills and ability to prioritize requests effectively\n\\n\nDemonstrates curiosity, resourcefulness, and adaptability in a fast-paced environment\n\\n\n\\n\n\\n\nBenefits\n\\n\n\\n\nYou will be eligible to receive a merchandise discount at select KnitWell Group brands, subject to each brand’s discount policies.\n\\n\nSupport for your individual development plus opportunities for career mobility within our family of brands.\n\\n\nA culture of giving back – local volunteer opportunities, annual donation and volunteer match to eligible nonprofit organizations, and philanthropic activities to support our communities. *\n\\n\nMedical, dental, vision insurance & 401(K)*\n\\n\nEmployee Assistance Program (EAP)\n\\n\nTime off – paid time off & holidays*\n\\n\nThe target salary range for this role is: $66,300 - 79,000.\n\\n\nAny job offer will consider factors such your qualifications, relevant experience, and skills. Eligibility of certain benefits and associate programs are subject to employment type and role.\n\\n\nApplicants to this position must be authorized to work for any employer in the US without sponsorship. We are not providing sponsorship for this position\n.\n\\n\nIn office time is required\n3-4 days per week\nto support strong collaboration and development. *\n\\n\n\\n\n\\n\n#LI-LL1\n\\n\n\\n\nLocation:\nTimes Square Tower-ANN-New York, NY 10036\\n\nPosition Type:\nRegular/Full time\\n\n\\n\nEqual Employment Opportunity\n\\n\nThe Company is an equal opportunity employer and welcomes applications from diverse candidates. Hiring decisions are based upon a candidate's qualifications as they relate to the requirements of the position under consideration and are made without regard to sex (including pregnancy), race, color, national origin, religion, age, disability, genetic information, military status, sexual orientation, gender identity, or any other category protected by applicable law. The Company is committed to providing reasonable accommodations for job applicants with disabilities. If you require an accommodation to perform the essential duties of the position you are seeking or to participate in the application process, please contact myHRSupport@knitwellgroup.com. The Company will make reasonable accommodations for otherwise qualified applicants or employees, unless such accommodations would impose an undue hardship on the operations of the Company’s business. The Company will not revoke or alter a job offer based on an applicant’s request for reasonable accommodation.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}