{
  "filename": "data_analyst_New_York__NY_page6_job14_Data_Steward___Analyst.html",
  "job_title": "Data Steward / Analyst",
  "company": "Teachers College Columbia University",
  "location": "New York, NY 10027•Hybrid work",
  "salary": "$35.01 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:02:51.988Z",
  "full_description": "\\n\n\\n\n\\n\nJob no:\n513936\nPosition type:\nInterim\nLocation:\nNew York\nCategories:\nInformation Systems/Technology, Hybrid\n\\n\n\\n\n\\n\nJob Summary/Basic Function:\nWe seek a Data Steward / Analyst to support our enterprise data governance and cataloging initiatives in a full-time, time-limited 6-month-long role. The analyst will work with technical staff and business units to document data systems, improve metadata, and support reporting. This is a college-wide effort led by Teachers College Information Technology (TCIT), and the role will sit within the central IT organization. This role provides broad exposure to data governance, cataloging, and basic analysis. It is an excellent opportunity for someone early in their career who wants hands-on experience in the data management field.\nCHARACTERISTIC DUTIES AND RESPONSIBILITIES:\n\\n\nData Cataloging & Governance:\n\\n\n\\n\nDocument data systems, sources, and reports in the enterprise data catalog.\n\\n\nCapture metadata such as definitions, formats, usage, and sensitivity (e.g., PII).\n\\n\nContribute to data governance efforts by ensuring consistency and accuracy of documentation.\n\\n\n\\n\nData Analysis & Reporting :\n\\n\n\\n\nPerform basic data profiling and validation checks.\n\\n\nSupport senior analysts on simple queries, reporting, or data quality tasks.\n\\n\n\\n\nCollaboration & Communication :\n\\n\n\\n\nEngage with business stakeholders to gather and validate data definitions.\n\\n\nPartner with IT teams to understand source systems and data flows.\n\\n\nHelp produce user-friendly documentation to support data literacy efforts.\n\\n\n\\n\nMinimum Qualifications:\n\\n\n\\n\nBachelor’s degree in Information Systems, Data/Information Management, Business, or related field (or equivalent experience).\n\\n\nStrong attention to detail and organizational skills.\n\\n\nAbility to work effectively with both technical and non-technical stakeholders.\n\\n\nCuriosity and eagerness to learn about data governance and analytics.\n\\n\n\\n\nPreferred Qualifications:\n\\n\n\\n\nFamiliarity with SQL, reporting, or data visualization and cataloging tools.\n\\n\nExposure to data privacy, governance, or compliance concepts.\n\\n\n\\n\nAppointment Details\nThis is a time-limited role for 6 months.\nThe position is not eligible for extension or conversion to a permanent role.\nCandidates will gain practical experience across data governance, cataloging, and analysis.\n\\n\nSalary Range:\n\\n\n$35.01 - $35.01\n\\n\nWork Modality:\n\\n\nHybrid\n\\n\nHybrid/Remote\n\\n\nTeachers College maintains a hybrid work environment, which provides employees with flexible work arrangements while ensuring we preserve the important aspects of our unique in-person college-campus culture. Depending on role and business needs, colleagues will either work onsite or in a hybrid model (a combination of in-office and virtual days). Employees are expected to live within a 150-mile radius of the College.\n\\n\n\\n\nEqual Employment Opportunity\n\\n\nTeachers College is committed to fostering an inclusive academic community and to providing equal opportunity in employment. All qualified applicants will receive consideration regardless of race, color, sex, religion, creed, national origin, age, citizenship, disability, marital status, sexual orientation, veteran status, or any other category protected by applicable law.\n\\n\nIf you would like to discuss any disability-related accommodations under the Americans with Disabilities Act, or a similar law, related to applying for employment at Teachers College, Columbia University, please email the Office of Access and Services for Individuals with Disabilities:\noasid@tc.columbia.edu\n\\n\n\\n\nAdvertised:\nDec 09, 2025 Eastern Standard Time\nApplications close:\nFeb 15, 2026 Eastern Standard Time\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=5c17aaaeb155d90e&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnfc72293c07e&spon=0&xkcb=SoD067M3pvmyVWACJ70FbzkdCdPP&xfps=e3c60421-c597-48f1-bc6a-1c880ad51bb1&vjfrom=vjs&asub=mob&astse=6472d9e94a10534a&assa=2321"
}