{
  "filename": "data_analyst_New_York__NY_page5_job10_BUSINESS_ANALYST___NYC.html",
  "job_title": "BUSINESS ANALYST - NYC",
  "company": "Alexander Group",
  "location": "909 3rd Ave Ste P20, New York, NY 10022",
  "salary": "$90,000 - $100,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:00:05.797Z",
  "full_description": "\\n Description: \\n\nAlexander Group: Decades of experience growing revenue for global companies\n\\n\nAlexander Group provides management consulting services to the world’s leading organizations. When clients need to grow revenue, they look to Alexander Group for data-driven insights, actionable recommendations, and most importantly, results.\n\\n\nFounded in 1985, we’ve served more than 3,000 companies around the world, across all industries. This experience gives us not only a highly sophisticated set of best practices to grow revenue — we also have a rich repository of industry data that informs all of our recommendations.\n\\n\nOur dedication to revenue growth and sales strategy has led to:\n\\n\n\\n\nMore than 70% of our clients being Fortune 500 corporations\n\\n\nProject work in more than 25 countries\n\\n\nExtensive industry experience in B2B markets\n\\n\n\\n\nThe Business Analyst works closely with an assigned Project Manager and becomes a fully integrated project team member in their first months of employment. The combination of on-the-job learning, classroom training and on-going coaching and mentoring enable Business Analysts to enjoy outstanding professional growth and career opportunities. The firm’s culture, built on teamwork and meritocracy, empowers our professionals to support each other in their career development.\n\\n\nThe Business Analyst career track includes promotion to Associate Consultant to Management Consultant and beyond for individuals looking to develop a rewarding, long-term career in consulting with Alexander Group.\n\\n\nResponsibilities:\n\\n\n\\n\nCreate and use analytical models to simulate or forecast business problems and results\n\\n\nConduct data analysis including basic statistical analysis\n\\n\nParticipate in client interviews and related fact-finding initiatives\n\\n\nApply logic and Alexander Group methodologies to provide recommendations to clients\n\\n\nUse and develop communication skills to communicate project findings, conclusions and recommendations with your peers and clients\n\\n\nPrepare initial drafts of high quality, error free deliverables\n\\n\nParticipate in client meetings to review and present analytical approaches and interpret results\n\\n\nRequirements: \\n\n\\n\nBachelor’s degree with solid academic achievement\n\\n\nCoursework in business administration, finance or economics is a strong plus\n\\n\n1+ years of relevant professional experience\n\\n\nGood business acumen and awareness of business trends\n\\n\nModerate to advanced Excel and PowerPoint skills are required\n\\n\nQuantitative skills and general problem solving skills for business problems\n\\n\nStrong interpersonal and team working skills\n\\n\nGood communication skills (written and verbal)\n\\n\nAbility to learn quickly and resourcefully\n\\n\nHigh degree of motivation, flexibility and creativity\n\\n\nGenuine desire to work hard and progress rapidly in the consulting profession\n\\n\nPositive attitude and strong willingness to learn from mentors and peers\n\\n\nAbility to travel (sometimes on short notice)\n\\n\n\\n\nSalary Range: $90,000-100,000. Bonus Eligible.\n\\n\nEEO Employer. Desired Work Eligibility: Eligible to work in the U.S. with no restrictions or visa sponsorship. TN Visa accepted. No phone calls please.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=619b1d7e2210c8a8&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnbj48jn1a803&spon=0&xkcb=SoCT67M3pvmhsM20BR0BbzkdCdPP&xfps=b8adb271-a722-4aef-bd2c-5d3305302591&vjfrom=vjs&asub=mob&astse=040526bd477acb6c&assa=6073"
}