{
  "filename": "data_analyst_New_York__NY_page10_job3_Digital_Marketing_Analyst__Ful.html",
  "job_title": "Digital Marketing Analyst, Full Time, Morristown",
  "company": "Atlantic Health System",
  "location": "Morristown, NJ",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:20:41.449Z",
  "full_description": "\\n\n\\n\nKey Responsibilities\n:\n\\n\n\\n\nOwn and maintain recurring dashboards and reports using Power BI and GA4.\n\\n\nRespond to ad hoc data requests from marketing, product, and digital experience teams.\n\\n\nPull and analyze data using SQL from Data Cloud and other sources.\n\\n\nTranslate business questions into data queries and actionable insights.\n\\n\nCollaborate with the Manager of Analytics to ensure consistent metric definitions and data quality.\n\\n\nMonitor site performance, user behavior, and campaign effectiveness.\n\\n\nAssist in tagging validation and QA for new digital features or campaigns.\n\\n\nDocument reporting logic and maintain a library of reusable queries and reports.\n\\n\n\\n\n\\n\n\\n\n\\n\nRequired Skills & Experience\n:\n\\n\n\\n\n\\n\n\\n\nBachelor degree required.\n\\n\n\\n\n\\n\n\\n  2–4 years of experience in digital or marketing analytics, preferably in a consumer-facing or regulated industry (e.g., healthcare, finance).\n\\n\n\\n\nProficiency in Google Analytics 4 (GA4) and Power BI.\n\\n\nWorking knowledge of SQL for querying large datasets.\n\\n\nStrong attention to detail and comfort working with large, complex data sets.\n\\n\nAbility to communicate findings clearly to non-technical stakeholders.\n\\n\n\\n\n\\n\n\\n\nPreferred Qualifications\n:\n\\n\n\\n\nFamiliarity with Salesforce Data Cloud or similar data platforms.\n\\n\nExperience with tagging frameworks (e.g., GTM, Adobe Launch).\n\\n\nUnderstanding of HIPAA, OCR, and digital privacy best practices.\n\\n\nExposure to data governance, data modeling tools (e.g. dbt), & semantic layer concepts is a bonus.\n\\n\n\\n\n\\n\n\\n\n\\n\nAtlantic Medical Group is a physician-led and physician-governed organization that delivers the highest quality health care, at the right place, the right price, and the right time. We are a multispecialty physician group with more than 1,000 doctors, nurse practitioners and physician assistants at over 300 locations throughout northern and central New Jersey and northeast Pennsylvania. Our mission is to deliver exceptional care recognizing the unique needs of all those we serve. Our vision is to achieve the best outcomes with our patients at the center of the physician-led team, driven by service, innovation and continuous learning.\n\\n\nOur integrated network offers seamless access to Atlantic Health System’s entire health care continuum and our nationally and regionally ranked hospitals. In collaboration with Atlantic Health System, several of our practices offer urgent care and walk-in services.\n\\n\nIn addition to primary care physicians, the team includes specialists that care for patients in all aspects of their health from pediatrics to geriatrics and everything in between. We make health decisions easier for patients with enhanced access to referrals.\nAtlantic Health System offers a competitive and comprehensive Total Rewards package\nthat supports the health, financial security, and well-being of all team members. Offerings vary based on role level (Team Member, Director, Executive). Below is a general summary, with role-specific enhancements highlighted:\n\\n\n\\n\n\\n\nTeam Member Benefits\n\\n\n\\n\n\\n\n\\n\nMedical, Dental, Vision, Prescription Coverage (22.5 hours per week or above for full-time and part-time team members)\n\\n\nLife & AD&D Insurance.\n\\n\nShort-Term and Long-Term Disability (with options to supplement)\n\\n\n403(b) Retirement Plan: Employer match, additional non-elective contribution\n\\n\nPTO & Paid Sick Leave\n\\n\nTuition Assistance, Advancement & Academic Advising\n\\n\nParental, Adoption, Surrogacy Leave\n\\n\nBackup and On-Site Childcare\n\\n\nWell-Being Rewards\n\\n\nEmployee Assistance Program (EAP)\n\\n\nFertility Benefits, Healthy Pregnancy Program\n\\n\nFlexible Spending & Commuter Accounts\n\\n\nPet, Home & Auto, Identity Theft and Legal Insurance\n\\n\n\\n\n____________________________________________\n\\n\n\\n\n\\n  Note: In Compliance with the NJ Pay Transparency Act (effective Sunday, June 1, 2025), all job postings will include the hourly wage or salary (or a range), as well as this summary of benefits. Final compensation and benefit eligibility may vary by role and employment status and will be confirmed at the time of offer.\\n\n\\n\nEEO STATEMENT\n\\n\nAtlantic Health System, Inc. is an equal employment opportunity employer and federal contractor or subcontractor and therefore abides by applicable laws to protect applicants and employees from discrimination in hiring, promotion, discharge, pay, fringe benefits, job training, classification, referral, and other aspects of employment, on the basis of race, color, religion, sex (including pregnancy, gender identity and sexual orientation), national origin, citizenship status, disability, age, genetics, or veteran status.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=6b7c6314e61f1577&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoj3k62dir088&spon=0&xkcb=SoAS67M3pv5DoOyJaB0IbzkdCdPP&xfps=4899bd83-6b45-460f-a354-62d8d68edd37&vjfrom=vjs&asub=mob&astse=ed7e13b7a969043f&assa=6434"
}