{
  "filename": "data_analyst_New_York__NY_page4_job3_Business_Systems_Analyst___SAP.html",
  "job_title": "Business Systems Analyst ( SAP)",
  "company": "NovelTek Systems",
  "location": "15 Corporate Place South, Piscataway, NJ 08854",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:57:23.003Z",
  "full_description": "\\n\nDuration: Full Time\n\\n\nDescription:\n\\n\nSeeking qualified Business Systems Analyst ( SAP) with Master’s Degree or foreign equivalent in Business Admin or Engg along with 12 months of related work experience Responsible for evaluating, designing and configuring computer systems and software to meet the needs of their employer or client and work as Lead S4 HANA SAP Consultant for finance module. Perform actual data migration from source ORACLE to target S/4 HANA 2020 for the entire landscape (Sandbox, Development, Quality & Production) and helped business with data reconciliation between the two systems. Analyze, determine the root cause, recommend, and implement solutions/ fixes within Service Level Agreement (SLA) timeframe and facilitate workshops to collect business requirements and translate them to system requirements with the ability to identify gaps, issues, and work-around solutions.\n\\n\nTravel to unanticipated client site locations within US may be required.\n\\n\nQualified Candidates should send their resumes to:\n\\n\nSuresh Kandala\nHR NovelTek Systems Inc..\n15 Corporate Place South Suite 234,\nPiscataway, NJ 08854\n\\n\n\\n\nJob Location:\nPiscataway, New Jersey 08854\\n\n\\n\n\\n\n\\n\n\\n\nAt NovelTek, job opportunities abound within our growing system for IT professionals alike. We promote from within whenever possible, and are committed to providing benefits and programs that support our team member's careers and personal development. Our in-depth expertise in numerous verticals gives you the opportunity to pick up skills in diverse areas. We help you add value to yourself in a healthy environment that catalyzes professional growth.\n\\n\nYou would be the part of a dynamic team that synergies efforts to help you deliver your best. At NovelTek, we give our people the opportunity to be their most creative and proactive. Our expertise goes beyond ‘delivering value’ to clients – into harnessing the talent of our people and giving them room to grow. We have created an environment conducive to learning. Our supportive team will help you realize your full potential.\n\\n\nIf you have the vision to grow, and the desire to go beyond the mediocre, meet us.We look forward to welcoming you as part of our team\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=e34e1a0ca3a5092b&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfn8f3pi9eb8ah&spon=0&xkcb=SoA567M3pvmuMEygLZ0IbzkdCdPP&xfps=35524bc2-39e2-482d-8348-5e65cd327df8&sjdu=13L9_re1RiEJPdUHLwJeOrrDqYB1O8sR9orwDdbYot9jr0KbApGtX_uCfmPdgzTH&vjfrom=vjs&asub=mob&astse=1f582993b977779a&assa=6960"
}