{
  "filename": "data_analyst_New_York__NY_page8_job6_Business_Analyst___Jersey_City.html",
  "job_title": "Business Analyst - Jersey City",
  "company": "Photon",
  "location": "Jersey City, NJ",
  "salary": "$48,000 - $169,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:16:22.272Z",
  "full_description": "\\n\n\\n\nResponsibilities\n\\n\n\\n\n\\n\n\\n\nAnalyze data requirements and identify disparate data sources required for consolidation and distribution.\n\\n\n\\n\n\\n\n\\n\n\\n\nDocument functional specifications and coordinate delivery of the same with technology team.\n\\n\n\\n\n\\n\n\\n\n\\n\nReview logical and conceptual data models in alignment with business requirements.\n\\n\n\\n\n\\n\n\\n\n\\n\nWork with the stakeholders to understand and gather requirements and produce business specifications\n\\n\n\\n\n\\n\n\\n\n\\n\nValidate solution implementations and ensure they meet business and functional requirements.\n\\n\n\\n\n\\n\n\\n\n\\n\nProvide production deployment support and investigate data quality issues.\n\\n\n\\n\n\\n\n\\n\n\\n\nWork with various technology leads to ensure the gaps in the data completeness or accuracy are bridged.\n\\n\n\\n\n\\n\n\\n\nQualifications\n\\n\n\\n\n\\n\n\\n\nSubject matter expertise in financial industry - wholesale loans /lending business OR Capital Markets or Finance or Risk Reporting\n\\n\n\\n\n\\n\n\\n\n\\n\nStrong hands on experience with database and SQL is required.\n\\n\n\\n\n\\n\n\\n\n\\n\nExcellent documentation, analytical skills to produce process flow diagrams, business modelling, and functional design.\n\\n\n\\n\n\\n\n\\n\n\\n\nProficiency in MS Office (Word, Excel, Visio, PowerPoint) with extensive experience using Excel for data analysis.\n\\n\n\\n\n\\n\n\\n\n\\n\nExperience with Data tracing/ Lineage efforts\n\\n\n\\n\n\\n\n\\n\n\\n\nKnowledge of logical and physical data model\n\\n\n\\n\nCompensation, Benefits and Duration\n\\n\nMinimum Compensation: USD 48,000\nMaximum Compensation: USD 169,000\nCompensation is based on actual experience and qualifications of the candidate. The above is a reasonable and a good faith estimate for the role.\nMedical, vision, and dental benefits, 401k retirement plan, variable pay/incentives, paid time off, and paid holidays are available for full time employees.\nThis position is not available for independent contractors\nNo applications will be considered if received more than 120 days after the date of this post\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=f074026d0c521ffd&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoa4c0i8qp87r&spon=0&xkcb=SoBj67M3pv4nSMACJ70MbzkdCdPP&xfps=b3b19ee8-a597-49a3-9f2b-7ee59743efa9&vjfrom=vjs&asub=mob&astse=3d62a51cd6d5ae27&assa=2717"
}