{
  "filename": "data_analyst_New_York__NY_page8_job3_TPRM_Services_Analyst.html",
  "job_title": "TPRM Services Analyst",
  "company": "Workforce Opportunity Services",
  "location": "1003 Us Highway 202, Raritan, NJ 08869",
  "salary": "$22.50 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:15:51.508Z",
  "full_description": "\\n Overview: \\n\n\\n\nWorkforce Opportunity Services (WOS)\nis a leading 501(c)(3) nonprofit dedicated to developing the skills of high-potential individuals who may not have access to career opportunities. Through strategic partnerships, WOS connects motivated talent with organizations seeking to expand their workforce with skilled professionals.\\n\n\\n\n\\n\n\\n\nUtilizing a scientifically based model derived from research conducted at Columbia University, we recruit, educate, train, and place high-potential talent with leading organizations around the world.\\n\n\\n\n\\n\nThis is a consultancy role with the potential to hire with our partner Johnson & Johnson.\nCaring for the world, one person at a time, inspires and unites the people of Johnson & Johnson. We embrace innovation—bringing ideas, products and services to life to advance the health and well-being of people around the world. We believe in collaboration, and that has led to breakthrough after breakthrough, from medical miracles that have changed lives, to the simple consumer products that make every day a little better. Our over 125,000 employees in 60 countries are united in a common mission: To help people everywhere live longer, healthier, happier lives.\n\\n\n\\n\nOverall Position Description:\n\\n\nAn Entry Level Analyst position within Johnson & Johnson’s Information Security & Risk Management (ISRM) organization, specifically within Third-party Risk Management (TPRM) has opened, within a team that is dedicated to managing J&J’s cybersecurity, data and operational risks stemming from our relationships with third parties, vendors and suppliers globally.\n\\n\n\\n\nYou will work with core members of the TPRM Services team, alongside ISRM’s GRC Solutions and Cybersecurity Assessment execution teams, to help with day-to-day operational needs towards the running and executing of Johnson & Johnson’s Third-Party Risk Management program and strategy.\n\\n\n\\n\nThe role involves working with data from several sources to analyze and determine process improvement areas, identify patterns, develop or execute procedures that may involve collaboration, outreach and follow ups to internal J&J business or procurement partners, ISRM external partners and third-party stakeholders towards risk management activities.\nResponsibilities: \\n\n\\n\nData Analysis & Maintenance: Collect, organize, and analyze large volumes of data using appropriate tools and techniques. Track status updates and progress.\n\\n\nData Interpretation: Identify patterns, trends, and anomalies within the data, and develop insights that can be used to inform security strategies.\n\\n\nReporting: Prepare comprehensive reports and presentations summarizing data analysis findings, including key metrics, trends, and recommendations.\n\\n\nProcess Improvement: Collaborate with team members to identify areas for process improvement, automation, and optimization of processes within the TPRM services organization.\n\\n\nCompliance Monitoring: Monitor compliance with internal security policies, industry regulations, and best practices, and provide recommendations for remediation as necessary.\n\\n\nCollaboration: Work closely with internal cross-functional teams and with external partners to drive risk management objectives.\n\\n\nProfessional Development: Stay up-to-date with the latest trends, techniques, and tools in data analysis and risk management to enhance your skills and knowledge.\n\\n\nQualifications: \\n\nCandidate Profile:\n\\n\n\\n\nAuthorized to work in the United States\n\\n\nPost 9/11 Military Veteran with an Honorable discharge,\nOR\ncurrently serving in the National Guard/Reserve\n\\n\nHigh School Diploma or Equivalent with IT experience\n\\n\nAvailable to work Full-time\n\\n\n\\n\nQualifications:\n\\n\n\\n\nCommunication: Strong written and verbal communication skills, with the ability to clearly articulate requirements in a clear and concise manner, oriented towards the intended internal or external, technical or business audience.\n\\n\nPresentation Skills: Proficient in presentation skills with a proven track record of creating and delivering impactful presentations to stakeholders.\n\\n\nIntermediate to Advanced skills in Microsoft Excel and data analysis tools. Experience using pivot tables and creating Dashboards.\n\\n\nAnalytical & Creative Thinking: Competent analytical and problem-solving skills, with the ability to derive insights from complex datasets, examine facts, ask questions, explore different possible solutions and the ability to communicate findings and prevent viable options / next steps effectively.\n\\n\nAttention to Detail: Keen eye for detail and a commitment to maintaining data accuracy and meeting committed deadlines.\n\\n\nOrganization: The ability to prioritize and organize their work. Maintain updated status of tasks and track progress towards accomplishing specific goals and initiatives.\n\\n\nCuriosity & Willingness to learn: Understand security tools and services used in the TPRM program to fully grasp and extract value, insights and ways to draw maximum business value.\n\\n\nTeam Player: Excellent interpersonal and collaboration skills, with the ability to work effectively in a diverse, team-oriented environment.\n\\n\nAdaptability: Ability to adapt to a fast-paced, dynamic environment and manage multiple tasks simultaneously.\n\\n\nEducation/Qualification: Bachelor’s degree in a relevant field of study and/or relevant certifications preferred.\n\\n\nAdditional Information: \\n\nJob Type:\n\\n\n\\n\nFull Time\n\\n\n\\n\nSalary:\n\\n\n\\n\n$22.50/Hour (Plus Benefits after 90 days of FT)\n\\n\n\\n\nLocation:\n\\n\n\\n\nRaritan, NJ\n\\n\nBenefits: \\n\n\\n\nLow Cost Individual Health Insurance\n\\n\nPaid Vacation\n\\n\nPaid Company Holidays\n\\n\nEducation Assistance/Reimbursement (Toward first degree - Bachelors/Associates)\n\\n\nIndividual Mentor\n\\n\n401k Retirement Savings\n\\n\nAbout Us: \\n\nOur vision is to empower early-career professionals to achieve long-lasting professional success and financial independence while supporting companies in building workplaces that reflect and engage with the communities they serve. We are in the business of creating dynamic partnerships that transform lives.\nPay Range: USD $22.50 - USD $22.50 /Hr.\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=edbfd0cd4ec8a97f&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoa4c0i8qp87r&spon=0&xkcb=SoD-67M3pv4nSMACJ70PbzkdCdPP&xfps=1d241bbf-c824-4416-919a-fcf67bffaf6f&vjfrom=vjs&asub=mob&astse=c30cb19dc7783808&assa=1822"
}