{
  "filename": "data_analyst_New_York__NY_page8_job4_Power_BI_Developer_Data_Analys.html",
  "job_title": "Power BI Developer/Data Analyst",
  "company": "Ulbrich Stainless Steels & Special Metals, Inc.",
  "location": "North Haven, CT 06473",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:16:01.728Z",
  "full_description": "\\n\nCompany Description\n\\n\nUlbrich was established in 1924 and is family-owned and privately held. An international corporation with subsidiaries located in the US, Mexico, Germany and Austria. Ulbrich employs over 700 people worldwide.\n\\n\nAt Ulbrich, we are\nImproving Lives with More Than Metal.\nWe work hard for each other, our families, and the communities we live in. The respect and integrity of Ulbrich team members, dedication to their professions, collaborative participation in lean, and ensuring that safety comes first, has created a culture that has a positive impact on the lives of many. We connect with the world through our responsibility to produce critical products that benefit mankind.\n\\n\nThe Ulbrich culture is guided by a set of shared values we call\nOur Core Tenets\n.\nThe tenets we live by each day are Continuous Improvement, Quality Commitment, Family Values, Total Company Involvement, and Customer Responsiveness. Through practicing these shared values, we drive profitable growth and success.\n\\n\nCome join the Ulbrich team and become part of a greater purpose and a promising future!\nJob Description\n\\n\nUlbrich Stainless Steels and Special Metals Inc. is looking for a detail-oriented\nPower BI Developer/Data Analyst\n. This entry-level role based at our corporate headquarters in North Haven, CT is ideal for individuals passionate about data visualization, analytics, and business intelligence. You will work closely with business stakeholders to transform raw data into actionable insights using Power BI and other analytical tools.\n\\n\nResponsibilities include:\n\\n\n\\n\nDevelop and maintain Power BI Dashboards and reports to support business decision-making;\n\\n\nPerform data cleaning, transformation and modeling to prepare datasets for analysis;\n\\n\nCollaborate with business teams to understand requirements and translate them into effective visualizations;\n\\n\nMonitor and optimize report performance and implement best practices for BI solutions;\n\\n\nAssist in ad-hoc data analysis and generate insights to support operation and strategic initiatives; and\n\\n\nDocument process, data models, and report standards for future reference.\n\\n\nQualifications\n\\n\n\\n\n0-2 years of experience in information systems\n\\n\nBachelor's degree in Computer Science, Information Systems or Data Analytics\n\\n\nBasic knowledge of Power BI (or similar BI tool) and data visualization principles\n\\n\nStrong analytical and problem-solving skills with attention to detail\n\\n\nProficiency in Microsoft Excel (pivot tables, formulas, charts)\n\\n\nUnderstanding of ETL process and data warehousing concepts\n\\n\nExposure to DAX and Power Query in Power BI is a plus\n\\n\nGood communication skills and ability to work collaboratively in a team environment\n\\n\nAdditional Information\n\\n\nThis position offers competitive salary and benefits and the opportunity to expand your skills within a company that offers both a diverse workforce and a welcoming company culture.\n\\n\nUlbrich is an Equal Opportunity Employer.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}