{
  "filename": "data_analyst_Houston__TX_page1_job10_Business_Intelligence_Analyst.html",
  "job_title": "Business Intelligence Analyst",
  "company": "Grenza",
  "location": "10333 Harwin Drive, Houston, TX 77036",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:44:23.614Z",
  "full_description": "\\n\nDescription:\nBusiness Intelligence Analyst to gather requirements from SME and gather related information from MEDITECH EHR documentation. Interact with users to analyze the report requirements and develop multi-purpose reports to use across all the departments. Use Business Intelligence tool to create Reports and Dashboards as per the project requirements. Create and Maintain Technical Design Document. Data engineering and Data Modelling using Qlik Platform. Designing QlickView and QlickSense application user interfaces and providing the statistical analysis to the users. Create and maintain complex SQL views for specific Crystal Reports and Tableau reports. Create and Schedule Data Extracts for better performance of dashboards with multiple worksheets in Tableau Server. Create Entity Relationship (ER) diagrams to the proposed database. Create SSIS package to extract, transform and load (ETL) data from different data sources in to destination Data Warehouse, Flat File, OLE DB using SQL Server Integration Services and Informatica. Transform raw data into meaningful data and provide deeper insights of the Business Process. Design and Develop different reports like Drill through reports, Sub Reports, Drill Down Repots, Master and Detail Reports based on the requirements using multiple Business Intelligence Tools where appropriate. Ensure quality of the final application in terms of functionality using SAP BO, Tableau, QlickView, QlickSense, IBM Cognos, MDX, MDS, DQS, ITIL, SAP ECC, R/3, Data Services, Datastage, SQL Server, SSRS, SSAS, MS PowerBI, Postgres SQL.\n\\n\n\\n\nRequired\n: Bachelor’s or higher degree in Computer Science, Computer Information Systems, Software Engineering, Information Technology, Computer Applications or a related field, or its equivalent, related to this field of work and the necessary competencies.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSend Resumes to HR, Grenza Inc., 10333 Harwin Dr, Ste 385, Houston, TX 77036.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=453618d608a76dc9&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfme75aj73689f&spon=0&xkcb=SoB167M3pvk3MbRbpp0BbzkdCdPP&xfps=73363834-6c11-48c2-8154-b3949ebf8bcc&sjdu=Rs-RFJYUFBMrL_kzfEoo3rJEhFRjByqtts0dspNeoViHywvLZar3j78yWiwpzZna&vjfrom=vjs&asub=mob&astse=7da1cc7fa473d794&assa=3917"
}