{
  "filename": "data_analyst_New_York__NY_page3_job1_Clinical_Informatics___Reporti.html",
  "job_title": "Clinical Informatics & Reporting Analyst",
  "company": "Southwest Community Health Center Inc",
  "location": "46 Albion Street, Bridgeport, CT 06605",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:55:30.889Z",
  "full_description": "\\n Description: \\n\nSUMMARY:\nThe Clinical Informatics & Reporting Analyst integrates informatics and advanced analytics to strengthen clinical quality, operational and financial performance, value-based care outcomes, and organizational decision-making. The Analyst develops and manages reports and reporting datasets, delivers actionable analytic insights, and supports optimization of EHR documentation and workflows to enhance reporting, data capture, and data governance. Analytics responsibilities focus on the analysis of structured data obtained from reports, dashboards, EHR systems, and other reporting tools.\n\\n\nSPECIFIC DUTIES AND RESPONSIBILITIES:\nAll duties are subject to accommodation in accordance with the American Disability Act (ADA).\n\\n\n\\n\nPerform advanced analytics to generate actionable insights for leadership and care teams.\n\\n\nDevelop and maintain clinical, operational, and financial reports, integrating data across multiple systems to support data-driven decision-making.\n\\n\nAnalyze population health and value-based care performance metrics to identify opportunities for improvement and support organizational initiatives.\n\\n\nTranslate organizational needs into dashboards and analytic tools that enhance visibility into clinical, operational, and financial performance.\n\\n\nEnsure data accuracy, integrity, and usability; support data governance, validation, and standardization initiatives.\n\\n\nCollaborate with clinical, operational, and executive leadership to interpret analytic results, provide contextual insights, and guide the implementation of data-driven improvements.\n\\n\nPrepare and deliver summaries, visualizations, dashboards, and presentations that communicate complex analytic findings clearly to clinical, operational, and administrative stakeholders.\n\\n\nPartner with the CMIO on informatics and analytics initiatives to optimize EHR documentation, streamline workflows, and enhance data-driven decision-making across the organization.\n\\n\nPerform other duties as assigned.\n\\n\n\\n\nPhysical Requirements and Work Environment:\nThe physical requirements and work environment described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. This position requires the manual dexterity sufficient to operate phones, computers, and other office equipment. The position requires the physical ability to kneel, bend and perform light lifting. This person must have the ability to write and speak clearly using the English language to convey information and be able to hear at normal speaking levels both in person and over the telephone. Specific vision abilities required by this job include close vision, depth perception and the ability to adjust focus. Generally, the working conditions are good with little or no exposure to extremes in health, safety hazards and/or hazardous materials. This person must have the ability to travel as required to work with staff.\nRequirements: \\n\nQualifications:\n\\n\n\\n\nStrong analytic, statistical, and problem-solving skills with the ability to translate data into actionable insights.\n\\n\nProficiency with analytical and data visualization tools (e.g., Power BI, Tableau).\n\\n\nUnderstanding of clinical workflows, EHR documentation practices, and healthcare quality measurement.\n\\n\nAbility to clearly communicate technical concepts to both clinical and non-technical audiences.\n\\n\nStrong organizational skills with the ability to manage multiple projects and deadlines.\n\\n\nDemonstrated ability to work independently and collaboratively with multidisciplinary teams.\n\\n\nFamiliarity with data governance principles, data stewardship, and data standards.\n\\n\n\\n\nEducation and/or Experience:\n\\n\n\\n\nMaster’s degree in health or clinical informatics preferred, or equivalent experience/training in informatics.\n\\n\nStrongly preferred:\n\\n\nExperience with clinical analytics and EHR reporting tools.\n\\n\nExperience in a healthcare, FQHC, or value-based care environment.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}