{
  "filename": "data_analyst_New_York__NY_page3_job11_Salesforce_Business_Analyst.html",
  "job_title": "Salesforce Business Analyst",
  "company": "Internet Brands",
  "location": "Newark, NJ 07102",
  "salary": "From $80,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:56:30.966Z",
  "full_description": "\\n\n\\n  The Business Analyst is responsible for developing business and technical requirements characterizing the business needs and ultimately driving the development and design for the software development team. The Business Analyst will possess excellent client interface, analytical and data gathering skills. This role will require interfacing with customers, domain experts, software engineers and QA for the purpose of creating, reviewing, and finalizing requirements specifications, change requests, software specifications, user interface designs, traceability matrices and other product documentation.\\n\n\\n\n\\n\n\\n\n\\n\nResponsibilities:\n\\n\n\\n\n\\n\nA strong understanding of the Lead to Cash life cycle, specifically in the Salesforce ecosystem.\n\\n\nWork with various stakeholders, subject matter experts and other relevant personnel to develop business requirements to support the development of software applications.\n\\n\nFacilitate and participate in team-working sessions to elicit accurate information while also providing insights regarding product workflow, consistency, and usability to guide the design to a comprehensive solution.\n\\n\nParticipate in the design, development and implementation of processes to support the Business Analysis function within the Software Development Department.\n\\n\nActively participate in a team environment, recognizing opportunities to help the team complete project goals.\n\\n\nParticipate in testing tasks as needed to ensure code meets requirements.\n\\n\nWork with the project team to develop and write acceptance criteria.\n\\n\nCommunicate progress and issues to project manager and other project stakeholders.\n\\n\nEstimate assigned work and meet established deadlines in a fast-paced environment.\n\\n\nWork with software development team to ensure continuous process improvement.\n\\n\nPerform other job-related duties as required.\n\\n\n\\n\n\\n\nQualifications:\n\\n\n\\n\n\\n\nBachelor’s degree in computer science, a related field, or equivalent experience.\n\\n\nSalesforce Admin Certification required, BA certification is a plus as is CPQ or Order to Cash experience.\n\\n\nStrong documentation skills.\n\\n\nStrong interpersonal, client interface skills with demonstrated success working with customers, domain experts, production, software engineering.\n\\n\nBroad business knowledge with full system development life cycle (SDLC) experience.\n\\n\nAbility to differentiate the business point of view from the technical point of view.\n\\n\nExcellent analytical and data gathering skills.\n\\n\nDetail oriented with superior problem-solving skills.\n\\n\nAbility to work in a cooperative team environment.\n\\n\nAbility to handle multiple tasks and priorities effectively.\n\\n\nAbility to effectively present information to management and team members.\n\\n\n\\n\n\\n  At Internet Brands, we carefully consider a wide range of factors when determining compensation, including your background and experience. These considerations can cause your compensation to vary. We expect the compensation for this role to start at $80k and will depend on your skills, qualifications, and experience. We encourage all interested candidates to apply.\\n\n\\n\n\\n\n\\n\n\\n\nAbout Internet Brands:\n\\n\n\\n\n\\n  In addition to our awesome culture, we offer a comprehensive benefits package designed to support the health and well-being of you and your family. Our benefits include health insurance options such as medical, dental, and vision coverage, flexible spending accounts (FSA) for medical and dependent care, short-term and long-term disability insurance, and life and AD&D insurance. We also provide a 401(k) retirement savings plan with a company match, paid time off (PTO), paid holidays, commuter benefits as well as access to our Employee Assistance Program (EAP) and well-being coaching services. In addition, employees can take advantage of voluntary benefits such as home, auto and pet insurance, and discounted legal and financial services. For more details, feel free to inquire during the interview process.\\n\n\\n\n\\n\n\\n\n\\n  Internet Brands®, headquartered in El Segundo, Calif, is a fully integrated online media and software services company focused on four high-value vertical categories: Health, Automotive, Legal, and Home/Travel. The company's properties and platforms include the WebMD, Medscape, and Henry Schein ONE networks, which are the global leaders in their markets; Nolo, Avvo, and Martindale, which form the largest consumer information provider in the legal market; and CarsDirect, Fodor's Travel, and many others which are leaders in their key vertical markets. Internet Brands' award-winning consumer websites lead their categories and serve more than 250 million monthly visitors, while a full range of web presence offerings has established deep, long-term relationships with SMB and enterprise clients. The company's powerful, proprietary operating platform provides the flexibility and scalability to fuel the company's continued growth. Internet Brands is a portfolio company of KKR and Warburg Pincus.\\n\n\\n\n\\n  Internet Brands and its wholly owned affiliates are an equal opportunity employer. Internet Brands will consider qualified applicants with criminal histories in a manner consistent with the City of Los Angeles Fair Chance Initiative for Hiring Ordinance (FCIHO).\\n\n\\n\n\\n\n\\n\n\\n  Notice to California residents: you can find information about our privacy practices, on: https://www.internetbrands.com/work-with-us/cpra\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}