{
  "filename": "data_analyst_New_York__NY_page2_job1_Data_Analyst_Level_1.html",
  "job_title": "Data Analyst Level 1",
  "company": "Physician Affiliate Group of New York",
  "location": "506 Lenox Avenue, New York, NY 10037",
  "salary": "$65,654 - $80,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:53:55.613Z",
  "full_description": "\\n\n\\n\n\\n\nPhysician Affiliate Group of New York (PAGNY)\nis adding a\nData Analyst - Level 1\nto the group at\nNYC Health + Hospitals/Harlem\n.\nHarlem Hospital is a 282-bed hospital that provides a broad array of preventive, primary, and acute care services. Additionally, Harlem Hospital is a Level II Trauma Center, complete with Trauma and elective Orthopedic Surgery. The hospital maintains a strong academic affiliation with\nColumbia University Vagelos College of Physicians and Surgeons\nto maintain its high healthcare delivery standards.\\n\n\\n\n\\n\n\\n\n\\n\n\\n   The Mission of\nNYC Health + Hospitals\nis to extend equally to all New Yorkers, regardless of the ability to pay, comprehensive health services of the highest quality in an atmosphere of humane care, dignity, and respect. Their Values are built on a foundation of social and racial equity and has established the ICARE standards for all staff.\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nNYC Health + Hospitals\nis the nation’s largest municipal health care delivery system in the United States. Dedicated to providing the highest quality health care services to all New Yorkers with compassion, dignity and respect, and regardless of immigration status or ability to pay.\\n\n\\n\n\\n\n\\n\n\\n   The Adult Virology Clinic is an outpatient clinic within NYC Health and Hospitals/Harlem. The clinic Serves close to 1000 patients /year. The clinic follows a none-stop-shop model of service delivery by a multidisciplinary team and receives city, state and federal government funding.\\n\n\\n\n\\n\n\\n\n\\n\nOpportunity Details\n:\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nHours of operation is Monday to Friday 9:00am - 5:00pm\n.\\n\n\\n\n\\n\n\\n    Under the direction of the Assistant Director of Virology, is responsible for the on-going assessment, design, development and implementation of clinic wide clinical, financial and supportive services and systems.\\n\n\\n\n\\n\n\\n    Provide Virology leadership team with identified risks, concerns, and ambiguities discovered during the gathering of of data and assist team in developing solutions. develop and modify requirements documentation for the design and implementation of clinical and non-clinical information systems; critically evaluate information from various sources; distinguish user needs from actual business needs and partner with Assistant Director and other project managers, and IT leadership in optimizing the scope, benefits and risks of actual and proposed projects as well as assist in managing stakeholder/ funders expectations.\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n    1. A Master’s degree or advanced clinical degree from an accredited college or university; or a Baccalaureate degree from an accredited college or university.\\n\n\\n\n\\n\n\\n    (1) year of experience gathering and documenting business, clinical, and/or functional requirements for software applications development and implementation in a clinical, allied health, non-allied health, behavioral health, information technology, information services, business, analytics or related area; or (1) year of experience in a relevant clinical and/or healthcare administration role/function.\\n\n\\n\n\\n\n\\n    A satisfactory combination of education, training, and experience will be considered.\\n\n\\n\n\\n\n\\n    Specialty certification(s) issued by a national commercially available program, state, professional society, academic or technical institution in an area(s) listed above, may be credited on a month-to-month basis toward the required work experience for a total of one (1) year.\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nWages and Benefits Include:\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n    10% 401K company contribution after one year of service, with 3% company contribution\nstarting day one.\n\\n\n\\n\n\\n\n\\n    Choice of a three-tiered, very low-cost medical plans.\\n\n\\n\n\\n\n\\n    Excellent dental insurance, including orthodontics coverage.\\n\n\\n\n\\n\n\\n    Generous paid time off program.\\n\n\\n\n\\n\n\\n\nAnnual Salary range - $65,654 - $80,000*\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPhysician Affiliate Group of New York, P.C. (PAGNY)\nmission is to provide accountable, responsive, quality care with the highest degree of sensitivity to the needs of the diverse population that lives in our New York Community. PAGNY is one of the largest physician groups in the country and directly employs nearly 4,000 physicians and allied health professionals who provide services to\nNYC Health + Hospitals\n, the largest municipal health care system in the nation serving more than a million New Yorkers annually. Our providers are highly skilled professionals with outstanding credentials who deliver the highest level of quality healthcare to patients throughout New York City.\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPhysician Affiliate Group of New York, P.C. (PAGNY)\nis an equal opportunity employer committed to equitable hiring practices and a supportive workplace. All candidates are considered based on their individual qualifications, potential, and experience.\\n\n\\n\n\\n\n\\n\n\\n   To learn more about our culture and ongoing workplace practices, please visit our Workplace Culture | PAGNY page.\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSalary Disclosure Information:\n\\n\n\\n\n\\n\n\\n\n\\n   The salary listed for this position complies with New York City's Salary Transparency Law for Job Advertisements. The salary applies specifically to the position being advertised and does not include potential bonuses, incentive compensation, or benefits. Actual total compensation may vary based on factors such as experience, skills, qualifications, historical performance, and other relevant criteria.\\n\n\\n\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}