{
  "filename": "data_analyst_New_York__NY_page5_job2_Retail_Applications_Analyst.html",
  "job_title": "Retail Applications Analyst",
  "company": "David Yurman Enterprises LLC",
  "location": "24 Vestry Street, New York, NY 10013",
  "salary": "$100,000 - $110,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:58:55.529Z",
  "full_description": "\\n\nAbout Us\n\\n\nDavid Yurman is a celebrated American jewelry company founded in New York by David Yurman, a sculptor, and his wife, Sybil, a painter and ceramicist. When the artists began collaborating, their goal was simply to make beautiful objects to wear. Led today by their son Evan, David Yurman creates timeless, yet contemporary collections for women and men defined by inspiration, innovation, consummate craftsmanship and cable – the brand’s artistic signature. David Yurman collections are available at 50 retail stores throughout the United States, Canada, Hong Kong and France and at over 300 locations worldwide, through their exclusive authorized fine jewelry and timepiece network of retailers.\n\\n\n\\n\nOur Values\n\\n\nAt David Yurman, creativity, innovation and impeccable craftsmanship are at the core of everything we do. Fueled by the energy of our hometown, New York City, artistic passion informs each and every jewelry design. The Yurman family’s guiding vision continually defines and redefines what it means to be the preeminent American luxury jewelry brand. We are committed to responsible business and social practices and to the protection and advancement of human rights. We believe in partnering with others who share these values and understand their importance.\n\\n\n\\n\nJob Description\n\\n\nTitle:\nRetail Applications Analyst (POS/Omnichannel)\n\\n\n\\n\nDepartment:\nRetail Technology\n\\n\n\\n\nReports To:\nManager, Retail Applications\n\\n\n\\n\nOverview\n\\n\nYou will strengthen David Yurman’s store technology stack and omnichannel capabilities by configuring, supporting, and improving retail applications that power the in‑store experience and end‑to‑end customer journey. The role blends hands‑on application support, light development/configuration, and project delivery across POS, clienteling, payments, order management, and integrations. Experience with Teamwork Commerce POS and Tulip clienteling is preferred.\n\\n\nWhat You’ll Do\n\\n\nRun (Operations & Support)\n\\n\n\\n\nOwn day‑to‑day support for POS/clienteling/payment workflows across retail and corporate events (e.g., special sales), meeting SLAs/OLAs.\n\\n\nTriage incidents and problems; drive root cause analysis and permanent fixes with vendors and internal teams (Problem/Incident Mgmt).\n\\n\nExecute release/upgrade cycles (sandboxes, UAT, test scripts, cutover plans); coordinate with store ops and vendor teams.\n\\n\nMaintain application configuration, environments, and user access/roles (SOX-compliant change & access controls).\n\\n\nMonitor integrations and jobs; review logs and resolve failures (e.g., API, EDI, message queues).\n\\n\n\\n\nBuild (Projects & Enhancements)\n\\n\n\\n\nDeliver enhancements from discovery through deployment: requirements, solution options, estimates, test plans, change tickets, and training.\n\\n\nAnalyze and optimize data flows between POS, CRM, OMS, ERP, and reporting (e.g., Salesforce, Oracle EBS, middleware).\n\\n\nSupport new store openings and relocations (device provisioning, peripherals, payments certification, network validation).\n\\n\n\\n\nPartner (Cross‑Functional & Vendor)\n\\n\n\\n\nWork closely with Retail Operations, CRM, Finance/Accounting, Loss Prevention, and IT Infrastructure.\n\\n\nCoordinate vendor work (Teamwork Commerce, Tulip, Adyen, logistics partners, integrators) and hold them to SLAs.\n\\n\nTranslate business needs into clear functional/technical requirements and change requests; document user guides and SOPs.\n\\n\n\\n\nGovern (Quality, Security, Compliance)\n\\n\n\\n\nChampion data accuracy and PCI/PII best practices; follow secure handling of payment tokens and customer data.\n\\n\nContribute to playbooks/runbooks, test scripts, and knowledge base articles in Confluence; track work in Jira.\n\\n\n\\n\nEssential Duties & Responsibilities (Representative)\n\\n\n\\n\nImplement, manage, and support retail applications, integrations, and SQL‑backed data workflows.\n\\n\nCoordinate release calendars and regression testing; lead UAT with super users and store teams.\n\\n\nCreate implementation and cutover plans for projects and new store deployments.\n\\n\nWrite and run SQL queries for analysis, issue triage, and validation; partner on API payload reviews.\n\\n\nProvide expert support for POS, payment terminals (e.g., Adyen AMS‑1), printers/scanners (e.g., Zebra), and iOS devices.\n\\n\nProactively identify process/automation opportunities; recommend practical solutions and phased roadmaps.\n\\n\n\\n\nQualifications\n\\n\nMust‑Haves\n\\n\n\\n\nMinimum 1-3 years experience in retail systems with hands‑on POS/clienteling/omnichannel experience.\n\\n\nDemonstrated experience supporting production applications and leading small/medium projects.\n\\n\nWorking knowledge of SQL (read/write basic to intermediate queries) and APIs.\n\\n\nFamiliarity with iOS device management and SSO (Jamf/Intune, Okta/Azure AD), and web services concepts.\n\\n\nStrong documentation, communication, and stakeholder management skills.\n\\n\nAbility to juggle incidents, small enhancements, and project tasks in a fast‑paced environment.\n\\n\n\\n\nNice‑to‑Haves\n\\n\n\\n\nExperience with Teamwork Commerce POS, Tulip clienteling, Adyen payments, Salesforce, Oracle EBS, and middleware.\n\\n\nKnowledge of omnichannel flows: Endless Aisle, Ship‑to‑Store/BOSS(\nB\nuy\nO\nnline\nS\nhip from\nS\ntore/BOPIS(\nB\nuy\nO\nnline\nP\nick\nU\np in\nS\ntore), Store Fulfillment.\n\\n\nExposure to monitoring/logging, reporting (e.g., Looker/Tableau), and basic scripting.\n\\n\nUnderstanding of ITIL practices (Change, Incident, Problem); retail inventory/transfer flows; store networking basics.\n\\n\n\\n\nWays We’ll Measure Success (First 6–12 Months)\n\\n\n\\n\nTime‑to‑resolve and incident recurrence reduction for top issues.\n\\n\nOn‑time, low‑defect delivery of at least two releases or store deployment waves.\n\\n\nDocumented SOPs/runbooks and regression test suites for critical flows.\n\\n\nPositive feedback from stores and business partners on responsiveness and solution quality.\n\\n\n\\n\nAdditional Details\n\\n\n\\n\nSchedule: Hybrid; occasional evening/weekend work during releases or major incidents.\n\\n\nTravel: ~5–10% for store openings, pilots, or vendor onsite sessions.\n\\n\nTools: Jira/Confluence, SQL client, Postman/Insomnia, MDM (Jamf/Intune), identity (Okta/Azure AD).\n\\n\n\\n\n\\n\nLocation:\nTribeca (New York, NY)\n\\n\n\\n\nWork Model:\nHybrid (3 in-office / 2 remote)\n\\n\n\\n\nEstimated Base Pay:\n$100,000-$110,000\n\\n\n\\n\nBase pay is one component of David Yurman’s total compensation package, which may also include the following for eligible employees: access to healthcare benefits, 401(k) plan, bonus, employee discounts, Summer Fridays (corporate roles), generous paid time off, sick time, and more.\n\\n\n\\n\nDiversity, Equity & Inclusion at David Yurman\n\\n\nAs a company founded by artists, David Yurman champions self-expression in everything we do. We are committed to fostering a culture of openness and creative collaboration within our entire community, and we cherish the diversity of our employees’ backgrounds and perspectives. We will always advocate for equity and inclusion for all.\n\\n\n\\n\nDavid Yurman is an Equal Employment Opportunity employer and provides equal opportunities to all employees and applicants without regard to an individual’s age, race, creed, color, religion, national origin, sex (including pregnancy, sexual orientation, gender).\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}