{
  "filename": "data_analyst_New_York__NY_page13_job8_Business_Development_Analyst__.html",
  "job_title": "Business Development Analyst - U.S. Wealth",
  "company": "AQR",
  "location": "1 Greenwich Plaza, Greenwich, CT 06830",
  "salary": "$110,000 - $120,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:28:12.167Z",
  "full_description": "\\n\n\\n\nAbout AQR Capital Management\n\\n\nAQR is a global investment management firm built at the intersection of financial theory and practical application. We strive to deliver superior, long-term results for our clients by looking past market noise to identify and isolate what matters most, and by developing ideas that stand up to rigorous testing. Our focus on practical insights and analysis has made us leaders in alternative and traditional strategies since 1998.\n\\n\nAt AQR, our employees share a common spirit of academic excellence, intellectual honesty and an unwavering commitment to seeking the truth. We're determined to know what makes financial markets tick – and we'll ask every question and challenge every assumption. We recognize and respect the power of collaboration, and believe transparency and openness to new ideas leads to innovation.\n\\n\n\\n\nThe Team\n\\n\nAQR is looking to hire a full-time Analyst to join our U.S. Wealth team. As part of our Business Development group, our U.S. Wealth team engages with taxable U.S. investors and their advisors. The team is responsible for education, awareness and managing new and current client relationships for AQR strategies through dedicated coverage to the Family Office community, Registered Investment Advisor community, as well as elite advisors and teams within the major Broker-Dealer segment.\n\\n\n\\n\nYour Role\n\\n\n\\n\nProvide senior relationship managers with sales and administrative support, including scheduling of meetings, preparing analytics, presentations, client and prospect materials, and updating of databases (CRM).\n\\n\nProvide inbound and outbound client support, including helping to service clients, quantify prospects, and sending follow-up information.\n\\n\nProactively use databases and sales reports to assist senior relationship managers in managing their territories.\n\\n\nWork closely with Portfolio Management, Portfolio Solutions, Compliance, Legal, Operations, Risk, and Trading teams to address client requests.\n\\n\nDevelop robust AQR product and asset class knowledge and demonstrate interest in the industry.\n\\n\nParticipate in projects and initiatives to help improve overall team functionality and efficiency.\n\\n\n\\n\n\\n\nWhat You'll Bring\n\\n\n\\n\nA Bachelor's degree; concentrations in Economics, Marketing, Finance or Business\n\\n\n1-2 years of relevant post-undergraduate experience at an investment management or asset management firm, a consulting firm or investment bank\n\\n\nHigh degree of intellectual curiosity\n\\n\nHigh proficiency in PowerPoint and Excel\n\\n\nFINRA series 7 and 63 licenses required\n\\n\n\\n\n\\n\nWho You Are\n\\n\n\\n\nHard working and eager to learn in a highly intellectual, collaborative environment\n\\n\nInterested in a long-term career trajectory in a sales role\n\\n\nWell-organized and detail-oriented\n\\n\nEnthusiastic about developing and implementing ideas\n\\n\nSelf-starter, able to work independently as well as within a team\n\\n\nExceptional analytical and problem solving skills\n\\n\nStrong oral and written communication skills\n\\n\nKnowledge of finance and the investment management industry is highly desirable\n\\n\n\\n\n\\n\nThe salary range for this role is expected to be $110,000 to $120,000. This is the range that we in good faith believe is accurate for this role at the time of this posting. We may ultimately pay more or less than the posted range, depending upon factors such as skills, experience, location, or other business and organizational needs. This wage range may also be modified in the future.\n\\n\nThis job is also eligible for an annual discretionary bonus. We offer comprehensive package of benefits including paid time off, medical/dental/vision insurance, 401(k), and any other benefits to eligible employees.\n\\n\nNote: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, benefits, or any other form of compensation and benefits that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company's sole discretion, consistent with the law.\n\\n\n\\n\nAQR is an Equal Opportunity Employer. EEO/VET/DISABILITY\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=cc64e29229d9e24b&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfovnurkuq78l9&spon=0&xkcb=SoCF67M3pv5w3QyMTJ0DbzkdCdPP&xfps=f37b4290-ba1f-43db-ba43-1c2666de3e87&vjfrom=vjs&asub=mob&astse=3658b3a88a24ffd7&assa=3946"
}