{
  "filename": "data_analyst_New_York__NY_page9_job5_Analyst__Ticketing_Analytics.html",
  "job_title": "Analyst, Ticketing Analytics",
  "company": "Major League Baseball",
  "location": "New York, NY 10017",
  "salary": "$70,000 - $80,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:18:36.299Z",
  "full_description": "\\n\n\\n\nMLB’s Ticketing department is a centralized resource within Baseball’s Office of the Commissioner. The Ticketing organization works cross-functionally across MLB to support the development and execution of our strategies for growing baseball globally.\n\\n\nMLB is hiring an Analyst, Ticket Analytics to be a key contributor in support of some of the top initiatives being undertaken across the industry. This position will report directly to the Director, Ticketing Analytics within the Ticketing department and will focus on leveraging data and analytics to help drive business impact with a specific focus on the ticketing vertical.\n\\n\nThe ideal candidate will have an intimate understanding of the complexities of the sports ticketing landscape, and will bring a strong, structured analytical toolkit and experience to a fast-paced and collaborative environment.\n\\n\nQualifications & Skills\n\\n\n\\n\n1+ years of experience in data strategy and/or analytics roles, ideally within Sports, or Media & entertainment\n\\n\nCollege Graduate. B.A./B.S. degree with a relevant academic major (mathematics, statistics, computer science) is strongly preferred, though candidates with non-traditional schooling backgrounds and strong relevant experience will be considered.\n\\n\nAdvanced knowledge of quantitative data collection and data analysis using SQL is required, experience with data science and statistical concepts such as regression modeling in R or Python is preferred\n\\n\nIdeal candidate will have a low-ego, team-oriented mindset and desire to deliver effective results.\n\\n\nDesire to implement best practices, processes, and structures to amplify the outputs of the team\n\\n\nDemonstrated competency in translating data into actionable insights that help define strategic direction\n\\n\nDesire to work in a fast-paced, cross-functional environment that regularly integrates with multiple stakeholders including but not limited to strategy teams, BI, and data engineering\n\\n\nHighly developed communication skills with the ability to story-tell using data and influence executive leadership\n\\n\nExperience with BI platforms such as Looker, Tableau, or other data visualization software is preferred\n\\n\nPrevious experience working within the sports industry is preferred\n\\n\n\\n\nResponsibilities\n\\n\n\\n\nOwn the categorization and mapping of MLB ticketing data\n\\n\nWork to standardize Club ticketing data in an effort to provide accurate and relevant reporting\n\\n\nAudit and reconcile ticketing data feeds with financial and Club-submitted reporting\n\\n\nBuild ad-hoc reports and dashboards using primary and secondary ticketing data\n\\n\nWork as a liaison between Data Engineering and Business teams to help determine structure, ETL processes, and enhancements of the ticketing database\n\\n\nAssist with day-to-day management and coordination of partner relationships\n\\n\nThorough and timely documentation of revenue driving initiatives\n\\n\nManage additional projects as assigned\n\\n\n\\n\nSalary Range:\n$70,000 - $80,000 (Base Salary) + Bonus\n\\n\nAs a candidate for this position, your salary and related aspects of compensation will be contingent upon your work experience, education, skills, and any other factors MLB considers relevant to the hiring decision. In addition to your salary, MLB believes in providing a competitive compensation and benefits package for its employees.\n\\n\nTop MLB Perks & Benefits\n\\n\n\\n\nCompetitive Benefits Package\n\\n\nCompany 401K Contribution\n\\n\nPaid Time Off and Holidays\n\\n\nPaid Parental Leave\n\\n\nAccess to Free Tickets to Baseball Games & MLB.TV\n\\n\nDiscounts at MLB Store | MLBShop.com\n\\n\nEmployee Assistance Programs (EAP)\n\\n\nOnsite/Online Training & Development Programs\n\\n\nTuition Reimbursement\n\\n\nDisability Benefits (short term and long term)\n\\n\nLife and Accidental Death Insurance\n\\n\nPet Insurance\n\\n\n\\n\n\\n\n\\n\n\\n\nWhy MLB?\n\\n\nMajor League Baseball (MLB) is the most historic of the major professional sports leagues in the United States and Canada. Employees love working at MLB because of the culture of growth, teamwork, and professionalism. Employees who are most successful at MLB take initiative, know how to identify problems and provide solutions, and always put the Team first. For those ready to step up to the plate and join the major leagues, MLB takes the same approach as teams do with their players: empowering our “workforce athletes” to be at their best by engineering experiences that put employees in the best position to succeed. Major League Baseball is looking for candidates who are passionate about growing America’s pastime to best serve its fans for decades to come.\n\\n\nCalifornia Residents: Please see our California Recruitment Privacy Policy for more details.\n\\n\nColorado Residents: Colorado based applicants may redact or remove age-identifying information such as age, date of birth, or dates of school attendance or graduation. You will not be penalized for redacting or removing this information.\n\\n\nApplicants requiring a reasonable accommodation for any part of the application and hiring process, please email us at accommodations@mlb.com. Requests received for non-disability related issues, such as following up on an application, will not receive a response.\n\\n\nAre you ready to Step Up to the Plate?\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=5c932a1699a38333&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoeno9jn0n81p&spon=0&xkcb=SoCZ67M3pv402wQpQ50ObzkdCdPP&xfps=56c51e80-27b9-4c36-bdec-c921784b7cda&vjfrom=vjs&asub=mob&astse=7c6a236800c97266&assa=6666"
}