{
  "filename": "data_analyst_New_York__NY_page1_job1_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "tignovate",
  "location": "New York, NY 10013",
  "salary": "$45 - $50 an hour",
  "job_type": "Part-time",
  "scraped_at": "2025-12-27T10:50:56.817Z",
  "full_description": "\\n\nJob Description:\n\\n\nDescription\n\\n\nWe are seeking a highly motivated and detail-oriented Data Analyst to join our dynamic team. As a Data Analyst, you will play a pivotal role in transforming raw data into actionable insights that will drive strategic decisions and improve business outcomes. Your analytical expertise will allow you to interpret complex datasets, identify trends, and provide recommendations to stakeholders across various departments. You will be responsible for gathering, cleaning, and analyzing data from multiple sources, ensuring its accuracy and relevance. In this fast-paced environment, you will collaborate closely with cross-functional teams to understand their data needs and develop comprehensive reports and dashboards. Additionally, you will utilize statistical techniques to conduct deep-dive analyses, revealing patterns and correlations that may not be immediately apparent. The ideal candidate will have a profound passion for data and problem-solving, with a keen eye for detail and an ability to communicate findings clearly and effectively. If you are looking to make a significant impact through data-driven decision-making, we encourage you to apply for this exciting opportunity where innovation meets analytics.\n\\n\nResponsibilities\n\\n\n\\n\nCollect, clean, and preprocess large datasets from various sources to ensure data integrity.\n\\n\nAnalyze data using statistical methods to identify trends, patterns, and anomalies that provide actionable insights.\n\\n\nCreate and maintain comprehensive dashboards and reports to track key performance indicators (KPIs).\n\\n\nCollaborate with cross-functional teams to understand their data needs and translate business requirements into analytical solutions.\n\\n\nDocument processes and methodologies for data analysis and reporting to ensure consistency and accuracy.\n\\n\nPresent findings and recommendations to stakeholders using data visualization techniques and clear narrative.\n\\n\nStay updated with industry trends and best practices in data analytics to continually improve the analytical process.\n\\n\n\\n\nRequirements\n\\n\n\\n\nBachelor's degree in Data Science, Statistics, Mathematics, or a related field.\n\\n\nProven experience as a Data Analyst or in a similar role, with a strong portfolio demonstrating your analytical capabilities.\n\\n\nProficient in data analysis tools such as SQL, Excel, and statistical software (e.g., R, Python).\n\\n\nExperience with data visualization tools (e.g., Tableau, Power BI) to create compelling visual narratives.\n\\n\nSolid understanding of statistical analysis techniques and methodologies.\n\\n\nStrong problem-solving skills with the ability to analyze complex data and present findings.\n\\n\nExcellent communication skills, both written and verbal, with a focus on translating data into actionable insights.\n\\n\n\\n\nExperience and Skills:\nFrom: tignovate\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}