{
  "filename": "data_analyst_New_York__NY_page13_job1_The_Data_School_NY___Data_Anal.html",
  "job_title": "The Data School NY - Data Analyst Consultant",
  "company": "The Information Lab",
  "location": "124 East 14th Street, New York, NY 10003",
  "salary": "$66,300 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:27:11.968Z",
  "full_description": "\\n\n\\n\nApplications for this cohort will be considered on a rolling basis for cohorts beginning every 4 months. The next open cohort begins on May 4, 2026.\n\\n\n\\n\n\\n\n\\n\nBefore applying to this role,\nplease familiarize yourself with our\naptitude-based selection process\n. Applications without an accompanying Tableau Public visualization\nwill not be considered\n.\n\\n\n\\n\n\\n\n\\n\nThe Information Lab has a simple mission: to help people make sense of data. We believe that companies that use data well will have better futures than those that don’t. We have helped clients such as The Vanguard Group, JPMorgan Chase, PwC, JLL, and Paramount Global do just that through specializing in and consulting on the leading products for data visualization and data integration - Tableau and Alteryx - since 2011.\\n\n\\n\n\\n\n\\n\nAs a consultant in The Data School program, you will experience on-the-job training that is far more immersive and rewarding than traditional roles. The Data School offers a 28-month contract where we will pay you to learn about data and technology from some of the greatest data experts across the world (including six Tableau Visionaries and three Alteryx ACEs).\n\\n\n\\n\n\\n\n\\n  You’ll undertake this intensive training over four months in our fantastic facility located on Union Square. Then, you’ll showcase your new-found knowledge and skills with some of the biggest and most recognized blue-chip clients in the US in a series of placements following your training.\\n\n\\n\n\\n\n\\n\nBut there’s more to our training than just technical skills.\\n\n\\n\n\\n\n\\n\nWith support from your coaches and the wider team, you will learn broader skills about storing, managing, and presenting data as well as personal skills to help boost your own confidence in becoming an exceptional consultant. We teach these skills in an inclusive and collaborative environment where everyone is responsible for each other’s development and success.\\n\n\\n\n\\n\n\\n\nOur training and consulting focus on two software programs, Tableau and Alteryx, which you can excel at without coding knowledge. Our consultants come from different walks of life and many had never heard of Tableau before they stumbled across us (you can meet some of them here). The one thing they do have in common is a passion for problem-solving, especially with data and evidence. If you share the same inquisitive nature and have a drive to uncover the truth with data, then The Data School could be the perfect next chapter in your career.\\n\n\\n\n\\n\n\\n\nEveryone is welcome at The Information Lab and The Data School, no matter what your background is, your educational history, what you look like, or what topics you like to analyze in your own time. Diversity is an asset that helps us discover more varied stories in both our client’s data and the rest of the world’s. It suggests solutions and improvements for intractable problems in new and unexpected places. Will your passion help us solve the next generation of data problems?\n\\n\n\\n\n\\n\n\\n  Show us and start your journey with The Data School - we ask you to create a dashboard with a dataset of your choice. For full details on applying, visit www.thedataschool.com/apply or see below for a summary.\\n\n\\n\nWe would love to hear from you if you are:\n\\n\n\\n\ncomfortable working with numbers\n\\n\nanalytical\n\\n\ndata-driven\n\\n\na people person\n\\n\na problem solver\n\\n\na confident communicator\n\\n\n\\n\nFacts and figures\n\\n\n\\n\nLocation:\nCivic Hall, 124 E 14th St, New York, NY 10003\n\\n\nContract:\n28 month\n\\n\nVacation:\n25 days paid time off per year\n\\n\nOther benefits:\nHealth Insurance, 401k (4% match), Laptop, Mobile Phone\n\\n\n\\n\nApplication process (IMPORTANT, PLEASE READ CARFULLY)\n\\n\n\\n\nFind a dataset which interests you, the more you are interested in the subject the better the result will be.\n\\n\nDownload either the Tableau Public app or, if you are in full-time education you can apply for a Tableau Student Licence.\n\\n\nSign up and create a Tableau Public profile and publish your dashboard to it.\n\\n\nComplete the application form and send us the URL to your dashboard in the box provided.\n\\n\nTry to send in your first draft (when you're happy with it!) well in advance of the deadline for your chosen cohort.\n\\n\nWe will take a look and you will have the chance to iterate on your dashboard based on our feedback points.\n\\n\nSome datasource resources (use Google also!): Makeover Monday, Kaggle, Data Commons, NYC Open Data, some other ideas.\n\\n\n\\n\n\\n  Successful applicants will be offered a 28-month fixed-term contract within The Information Lab with a starting salary of $66,300 per year, with calendar year increases.\nWe can, unfortunately, only accept applicants for this role who are eligible to work in the United States without work authorization or future sponsorship. We use the federal E-Verify program to validate the work authorization of all new hires\n.\n\\n\n\\n\n\\n\n\\n\nThis is an in-person role based in New York City, with the possibility of a hybrid schedule after the 4-month training period.\n\\n\n\\n\n\\n\n\\n  We recruit from all degree disciplines and academic backgrounds and welcome applications from career changers. We are proud of our diverse workplace and do not discriminate on gender, ethnicity, race, or sexual orientation.\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=b1302b331411a6e8&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfovnurkuq78l9&spon=0&xkcb=SoBW67M3pv5w3QyMTJ0KbzkdCdPP&xfps=5ebeae16-4646-4821-b1cd-09ef3062abdc&vjfrom=vjs&asub=mob&astse=f139af65b132f3c2&assa=8427"
}