{
  "filename": "data_analyst_New_York__NY_page2_job8_CLINICAL_DATA_ANALYST.html",
  "job_title": "CLINICAL DATA ANALYST",
  "company": "Zenith LifeScience",
  "location": "South Plainfield, NJ",
  "salary": "$80,000 - $100,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:54:36.420Z",
  "full_description": "\\n\nDepartment: Clinical Research & Data Management\n\\n\nThe Clinical Data Analyst plays an essential role in the data collection & Data evaluation phase of clinical research. The process of collecting, managing and analyzing research data is done in accordance with regulatory standards to obtain quality information that is complete and error-free; the goal is to gather as much of such data for analysis as possible. The inherent goal of any clinical data manager is to produce, analyze and maintain quality data.\n\\n\nResponsibilities:\n\\n\n\\n\nPerforming and Project managing clinical Data Management (DM) activities for clinical trials including protocol review, CRF (Case Report Form) development, database set up activities, data validation process (including manual data review of listings), and SAE (Serious Adverse Events) reconciliation, managing local laboratory and external labs and database lock.\n\\n\nRepresenting Data Management on clinical teams and coordinate deliverables by other functions and/or CRO (Clinical Research Organization) as necessary to achieve DM deliverables.\n\\n\nCoordinating with Programming team to provide support to the data review and safety updates (coordinate generation of data review listings, data retrieval to support data review and analysis, SDTM (Study Data Tabulation Model).\n\\n\nResponsible for all data cleaning activities for multiple Respiratory studies and a COVID-19 vaccine study by managing thousands of trial participants and ensuring data accuracy and completeness throughout each study.\n\\n\nResponsible for Data cleaning using system programmed checks (System queries) and twice weekly SAS generated listings in Medidata Rave and Inform EDC.\n\\n\nCoordinate CRO (Clinical Research Organization) data validation activities (coordinate data transfer specs, data reconciliation, query generation and resolution).\n\\n\nWorked on a tool called EXACT/SAS for data cleaning of Core checks (DOV errors, basic checks for studies) EDU checks (Vendor related checks) & MRL checks (Study specific checks)\n\\n\n\\n\nEducational and/or experience requirements:\n\\n\n\\n\nBachelor’s or Master of Science in health informatics or Clinical Research\n\\n\nGood Understanding and experience in clinical trials and regulatory documents\n\\n\nHands on experience on clinical data analysis activities\n\\n\n\\n\nJob Type:\nFull-time\n\\n\nSalary:\n$80,000.00 to $100,000.00 /year\n\\n\nPlease send profile at careers@zenithlifescience.com for direct consideration or question.\n\\n\n\\n\nPosted on 02/11/2023\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=5b4fd2315354b0c3&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfn2hp0j73685t&spon=0&xkcb=SoC567M3pvmFm_Rbpp0DbzkdCdPP&xfps=7f04cc79-d4e6-4501-adc3-ae65694dcdf2&sjdu=lCm_AapMUVH4gk01H9SC3pP0HjnR3JkJv7c1ity4qk4csCGOQW2tjSf8B2BPzmWW&vjfrom=vjs&asub=mob&astse=a846f73325ae3dc8&assa=1157"
}