{
  "filename": "data_analyst_Houston__TX_page2_job4_Functional_Analyst_2.html",
  "job_title": "Functional Analyst 2",
  "company": "University of Houston",
  "location": "4302 University Dr, Houston, TX 77204",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:45:42.129Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n495276\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nFull-Time\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPolice\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nAdd to favorites\n\\n\n\\n\n\\n\n\\n\n\\n\nView favorites\n\\n\n\\n\n\\n\n\\n\nDepartment\n: Police\nSalary\n: Commensurate with Experience/Education \\n\nDescription\n:\n\\n\nUnder general supervision, performs process analysis and design through coordination with technical and functional staff. Pursuant to the State of Texas Executive Order No. GA-48, this position researches, works on, or has access to critical infrastructure and requires the ability to maintain the security or integrity of the University infrastructure. This position requires personnel be routinely reviewed to determine whether or not criminal history or continuous connections for the government or political apparatus of a foreign adversary might prevent the employee from being able to maintain the security or integrity of the infrastructure.\n\\n\n1. Responsible for complex system process analysis, design and simulation. Understands the University's business systems and State of Texas regulations.\n\\n\n2. Responsible for analysis and re-design of current processes.\n\\n\n3. Communicates and resolves issues with functional staff, and coordinates programming requirements with technical staff. Recommends and facilitates improvements to current policies and procedures.\n\\n\n4. Integrates new process with existing ones, and coordinates training requirements for end-users.\n\\n\n5. Recommends testing strategies and acceptance criteria.\n\\n\n6. Performs other job-related duties as assigned.\n\\n\nMQ: Requires a thorough understanding of both theoretical and practical aspects of an analytical, technical or professional discipline; or the basic knowledge of more than one professional discipline. Knowledge of the discipline is normally obtained through a formal, directly job-related 4 year degree from a college or university or an equivalent in-depth specialized training program that is directly related to the type of work being performed.\n\\n\nRequires a minimum of one (1) years of directly job-related experience.\n\\n\nAdditional Job Posting Information:\n\\n\nKey Responsibilities\n\\n\n\\n\nSecurity Planning:\n\\n\n\\n\n\\n\nDefine optimal locations for security cameras and emergency call boxes based on environmental conditions, crime data, and industry standards.\n\\n\nDefine criteria to ensure camera placements meet operational objectives.\n\\n\nCreate and maintain detailed maps and documentation of surveillance assets.\n\\n\n\\n\n\\n\nTechnology Integration & Support:\n\\n\nAssist in the deployment and integration of police technologies such as:\n\\n\nAutomated License Plate Readers (ALPRs)\n\\n\nReal-Time Crime Centers (RTCC)\n\\n\nBody-Worn Camera Systems\n\\n\nMobile Data Terminals (MDTs)\n\\n\nPublic Safety Drones and UAS\n\\n\nFacial Recognition Systems\n\\n\nAccess Control Systems\n\\n\nEvaluate system performance and recommend improvements.\n\\n\n\\n\n\\n\nData Analysis & Reporting:\n\\n\nAnalyze crime trends, incident reports, and surveillance data to support technology placement and usage.\n\\n\nGenerate reports and visualizations to inform decision-making and resource allocation.\n\\n\n\\n\n\\n\nStakeholder Collaboration:\n\\n\nWork with law enforcement personnel to understand operational needs.\n\\n\nCoordinate with university departments and University Information Technology for technology deployment.\n\\n\nEnsure compliance with privacy laws, data retention policies, and public safety regulations.\n\\n\n\\n\n\\n\nProject Management:\n\\n\nParticipate in planning, budgeting, and implementation of security technology projects.\n\\n\nStrong working knowledge of DORI analysis and its application in surveillance planning.\n\\n\nFamiliarity with public safety technologies and their operational use.\n\\n\nExcellent analytical, communication, and documentation skills.\n\\n\nAbility to work independently and collaboratively across departments.\n\\n\nExperience with Video Management Systems\n\\n\nMust have a valid Texas Driver’s License before receiving job offer.\n\\n\nMust be available to work additional shifts and assignments.\n\\n\nMust pass a Criminal History and valid Driver’s License check prior to an interview.\n\\n\nMust pass Background Investigation prior to employment.\n\\n\nMust pass a pre-employment drug screening.\n\\n\nUHPD requires all applicants to complete the criminal history fields on their application. Applicants with incomplete criminal history fields will not be considered for a position.\nRequired information includes, but may not be limited to:\n\\n\n\\n\nDOB\n\\n\nDriver’s license\n\\n\nLast 4 digits of SSN\n\\n\nVeterans are strongly encouraged to apply and will receive preference in employment over other applicants for the same position who do not have a greater qualification.\nSalary will be based on years of experience.\nWe offer exceptional benefits:\n\\n\n\\n\nPaid Time Off (accrual increases with your service years)\n\\n\nSick leave accrual\n\\n\nComprehensive free medical coverage for employees\n\\n\n(premiums apply for family members)\n\\n\n\\n\nGreat optional benefits to enhance your medical coverage\n\\n\nMany on-campus / off-campus employee perks\n\\n\nThe selected candidate must have and/or obtain a Texas Driver’s License prior to job offer.\nPreferred Qualifications\nExperience with municipal or public sector security planning.\nKnowledge of CPTED (Crime Prevention Through Environmental Design) principles.\nProficiency in GIS/mapping tools and surveillance system platforms.\nExperience with data visualization tools (e.g., Power BI, Tableau).\nPHYSICAL & ENVIRONMENTAL DEMANDS:\nThe physical demands described here are representative of those that must be met\nby an employee to successfully perform the essential responsibilities and functions of\nthe job and are not meant to be all inclusive. While performing this job the staff member shall:\nEnvironmental:\nThe employee maybe exposed to inclement weather conditions; extensive public contact\nwith student, faculty and staff.\nAll staff are “essential personnel” and are required to report to work\nduring inclement weather.\nPhysical:\nPosition requires moderate physical activity.\nField work required for site assessments and technology evaluations.\nOffice-based planning, analysis, and reporting.\nMay require occasional evening or weekend hours for special projects or emergency response.\n\\n\nAll positions at the University of Houston-System are security sensitive and will require a criminal history check.\n\\n\nThe University of Houston System and its universities are Equal Opportunity Institutions. Everyone is encouraged to apply.\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=6f149c90beabfcce&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfmissbl03785n&spon=0&xkcb=SoCj67M3pvlEerygL50PbzkdCdPP&xfps=ca8a9e94-2d87-41cc-96e8-1657cca0ecae&vjfrom=vjs&asub=mob&astse=e059e62bbaf7da2d&assa=7295"
}