{
  "filename": "data_analyst_New_York__NY_page3_job7_Inventory_Systems_and_Producti.html",
  "job_title": "Inventory Systems and Production Control Analyst",
  "company": "Accel International Holdings, Inc.",
  "location": "Meriden, CT 06450•Hybrid work",
  "salary": "$65,000 - $75,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:56:06.962Z",
  "full_description": "Overview:\n\\n\nWe are looking for a tech-savvy, hands-on\nInventory Systems & Production Control Analyst\nto assist with the rollout and ongoing management of our new ERP system. This is a hybrid role that blends elements of IT, operations, and production support.\n\\n\nYou’ll be part of the core team helping to design, test, and launch the inventory and production workflows in our system—then stay on to maintain and optimize them as the system becomes part of our day-to-day operations.\n\\n\nThis is a great opportunity for someone early in their career with strong Excel skills, a problem-solving mindset, and interest in how production, inventory, and systems come together.\n\\n\nKey Responsibilities: Phase 1: ERP Implementation Support\n\\n\n\\n\nAssist with building out the production and inventory sections of the ERP system.\n\\n\nClean and map part number and QC data into structured Excel templates.\n\\n\nVerify and validate existing data prior to upload.\n\\n\nHelp Sales compile customer-specific QC tables for upload.\n\\n\nSupport testing of production and inventory workflows.\n\\n\nAssist with setup and testing of new hardware (scales, printers, tablets, handhelds).\n\\n\nLearn and document new system functions and features.\n\\n\nTrain end-users on basic system usage when ready.\n\\n\nSupport physical inventory transfers and system updates during go-live.\n\\n\nHelp with minor system configuration tasks (Crystal Reports, SQL queries, NMonitor dashboards).\n\\n\nSupport one-off reporting requests from Finance and other departments.\n\\n\n\\n\nPhase 2: Post-Go-Live System Ownership\n\\n\n\\n\nServe as the point person for production and inventory transactions in the ERP system.\n\\n\nManage work order creation, printing, and tracking via SAP/BEAS.\n\\n\nMonitor and control inventory data accuracy: scrap, re-tagging, weight corrections, cycle counts, etc.\n\\n\nTroubleshoot system errors and help operators resolve real-time issues.\n\\n\nCoordinate with IT/support vendors to resolve hardware issues (scales, printers, tablets, etc.).\n\\n\nMaintain item master data, BOMs, routings, and shop floor data.\n\\n\nConsolidate part numbers, manage planning-related transactions, and help with shop floor reservations.\n\\n\nGenerate and maintain inventory and production reports.\n\\n\nSupport Engineering with data changes and process improvements.\n\\n\nInvestigate root causes of scrap or inventory inaccuracies.\n\\n\nAssist with other operational needs such as inventory organization, scrapping, and project-based work.\n\\n\n\\n\nQualifications:\n\\n\nRequired:\n\\n\n\\n\nStrong Excel skills (lookup functions, pivot tables, data cleaning).\n\\n\nOrganized, detail-oriented, and comfortable working with data.\n\\n\nStrong communication and documentation skills.\n\\n\nComfortable in a production or warehouse environment.\n\\n\nWilling to learn new systems and technologies quickly.\n\\n\n\\n\nPreferred:\n\\n\n\\n\nExposure to ERP systems (SAP, Oracle, NetSuite, etc.).\n\\n\nFamiliarity with SQL or Crystal Reports (not required but helpful).\n\\n\nExperience with inventory or production processes.\n\\n\nDegree in Supply Chain, Industrial Engineering, IT, or related field is a plus—but not required.\n\\n\n\\n\nWhy Join Us?\n\\n\n\\n\nBe part of a core systems implementation team from the ground up.\n\\n\nLearn ERP, inventory control, and production operations in a hands-on environment.\n\\n\nGain exposure to IT, systems integration, and data management.\n\\n\nFlexible, growth-oriented role that evolves with your skills and interests.\n\\n\nCollaborative team culture with real ownership and impact.\n\\n\n\\n\nApply Today!\nWhether you're an early-career analyst with Excel skills or someone looking to shift into a production systems role, we’d love to talk.\n\\n\nJob Type: Full-time\n\\n\nPay: $65,000.00 - $75,000.00 per year\n\\n\nBenefits:\n\\n\n\\n\n401(k)\n\\n\n401(k) matching\n\\n\nDental insurance\n\\n\nHealth insurance\n\\n\nLife insurance\n\\n\nPaid time off\n\\n\nVision insurance\n\\n\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}