{
  "filename": "data_analyst_New_York__NY_page13_job12_Generosity_Strategy___Insights.html",
  "job_title": "Generosity Strategy & Insights Analyst",
  "company": "FanDuel",
  "location": "New York, NY•Hybrid work",
  "salary": "$66,000 - $83,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:28:42.175Z",
  "full_description": "\\n\nTHE POSITION\nOur roster has an opening with your name on it\n\\n\nFanDuel is looking for a Generosity Strategy Analyst to drive long-term strategy on key lifecycle and promotional investment decisions. You will play a key role on the Customer Growth team, driving innovation across the org, collaborating with multiple departments including but not limited to Promotions, Lifecycle, Go To Market, Analytics, Commercial, Data Science, Product, and MarTech. This is an exciting opportunity to help elevate revenue-driving marketing initiatives at a premier gaming company.\n\\n\nIn addition to the specific responsibilities outlined above, employees may be required to perform other such duties as assigned by the Company. This ensures operational flexibility and allows the Company to meet evolving business needs.\n\\n\n\\n\nTHE GAME PLAN\nEveryone on our team has a part to play\n\\n\n\\n\nSupport Generosity Strategy leadership by challenging and exploring how, when and why we deliver generosity to our customers\n\\n\n\\n\n\\n\nRigorously experiment with new generosity mechanics/experiences and optimize them to create a more personalized experience for customers\n\\n\nHelp lead a cross-functional program of work from strategy formation through to day-to-day implementation\n\\n\nDevelop new strategic frameworks including state-level investment strategy, cohort allocation, and customer level allocation, collaborating with performance, insights, and campaigns teams\n\\n\nHelp define and validate new potential propositions for Sportsbook generosity\n\\n\n\\n\n\\n\nParticipate in presentations focused on using analysis to drive new business outcomes\n\\n\nBecome a key business partner to the Customer Growth team, supporting them in key decision making and thought leadership\n\\n\nCollaborate with cross-functional teams, including marketing, strategy, and product, to understand business needs and develop analytics solutions to address them\n\\n\n\\n\n\\n\nTHE STATS\nWhat we're looking for in our next teammate\n\\n\n\\n\nBachelor's Degree is preferred\n\\n\n\\n\n\\n\nMinimum of 1+ years Sportsbook experience in a strategic / commercial / analytical role is required\n\\n\n\\n\n\\n\nStrong analytical skills and proven ability to develop and deploy structured project work\n\\n\nProfessional expertise with SQL and Excel is required, data visualization a plus\n\\n\nAbility to use Tableau, Python, or R preferred, but not required\n\\n\nStrong personal organizational and time management skills\n\\n\nAbility to communicate technical insights to non-technical stakeholders\n\\n\nHas a positive attitude and loves opportunities to collaborate with others\n\\n\nStrong personal organizational and time management skills\n\\n\nAbility to work in a fast-paced environment with a lot of ambiguity\n\\n\nStrong problem-solving skills to identify areas of underperformance and opportunities for growth\n\\n\nInterest in Fantasy Sports/Gaming/Sports a plus\n\\n\n\\n\nABOUT FANDUEL\n\\n\nFanDuel Group is the premier mobile gaming company in the United States and Canada. FanDuel Group consists of a portfolio of leading brands across mobile wagering including: America's #1 Sportsbook, FanDuel Sportsbook; its leading iGaming platform, FanDuel Casino; the industry's unquestioned leader in horse racing and advance-deposit wagering, FanDuel Racing; and its daily fantasy sports product.\n\\n\nIn addition, FanDuel Group operates FanDuel TV, its broadly distributed linear cable television network and FanDuel TV+, its leading direct-to-consumer OTT platform. FanDuel Group has a presence across all 50 states, Canada, and Puerto Rico.\n\\n\nThe company is based in New York with US offices in Los Angeles, Atlanta, and Jersey City, as well as global offices in Canada and Scotland. The company's affiliates have offices worldwide, including in Ireland, Portugal, Romania, and Australia.\n\\n\nFanDuel Group is a subsidiary of Flutter Entertainment, the world's largest sports betting and gaming operator with a portfolio of globally recognized brands and traded on the New York Stock Exchange (NYSE: FLUT).\n\\n\nPLAYER BENEFITS\nWe treat our team right\n\\n\nWe offer amazing benefits above and beyond the basics. We have an array of health plans to choose from (some as low as $0 per paycheck) that include programs for fertility and family planning, mental health support, and fitness benefits. We offer generous paid time off (PTO & sick leave), annual bonus and long-term incentive opportunities (based on performance), 401k with up to a 5% match, commuter benefits, pet insurance, and more - check out all our benefits here:\nFanDuel Total Rewards\n. *Benefits differ across location, role, and level.\n\\n\nFanDuel is an equal opportunities employer and we believe, as one of our principles states, \"We are One Team!\". As such, we are committed to equal employment opportunity regardless of race, color, ethnicity, ancestry, religion, creed, sex, national origin, sexual orientation, age, citizenship status, marital status, disability, gender identity, gender expression, veteran status, or any other characteristic protected by state, local or federal law. We believe FanDuel is strongest and best able to compete if all employees feel valued, respected, and included.\n\\n\nFanDuel is committed to providing reasonable accommodations for qualified individuals with disabilities. If you have a disability and need a workplace accommodation or adjustment during the application and hiring process, including support for the interview or onboarding process, please email Benefits@fanduel.com.\n\\n\nThe applicable salary range for this position is $66,000 - $83,000 USD, which is dependent on a variety of factors including relevant experience, location, business needs and market demand. This role may offer the following benefits: medical, vision, and dental insurance; life insurance; disability insurance; a 401(k) matching program; among other employee benefits. This role may also be eligible for short-term or long-term incentive compensation, including, but not limited to, cash bonuses and stock program participation. This role includes paid personal time off and 14 paid company holidays. FanDuel offers paid sick time in accordance with all applicable state and federal laws.\n\\n\nIt is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.\n\\n\n#LI-Hybrid\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}