{
  "filename": "data_analyst_New_York__NY_page13_job2_Financial_Business_Systems_Ana.html",
  "job_title": "Financial Business Systems Analyst",
  "company": "NEWAGE INDUSTRIES INC",
  "location": "145 James Way, Southampton, PA 18966",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T11:27:22.146Z",
  "full_description": "\\n Description: \\n\nPosition Summary:\n\\n\nWe are seeking a highly skilled and motivated technology enthusiast to join our applications team as a Financial Business Systems Analyst primarily supporting accounting and finance activities. The successful candidate will be responsible for implementing and supporting various financial systems, including ERP, financial planning, accounting close process, AR and AP.\n\\n\nThis role involves working closely with various departments to analyze business processes, identify opportunities for improvement, and ensure the successful deployment and maintenance of the system.\n\\n\nKey Job Responsibilities:\n\\n\n\\n\nERP Implementation\n\\n\nContribute to the re- implementation of the ERP in the US as the IT business partner with the accounting department\n\\n\nOwn the fit/gap analysis to ensure the system design meets the department’s requirements\n\\n\nManage the accounting data migration to meet reconciliation needs\n\\n\nDefine complete reporting specifications to deliver the necessary data sets to the accounting department\n\\n\nEstablish and perform a training plan with the department’s SME\n\\n\nOther Implementation\n\\n\nLead requirement gathering and vendor evaluation of financial projects including but not limited to, financial planning, consolidation, and AR automation\n\\n\nWork with business partners to roll out tools to meet requirements on time and on budget\n\\n\nDevelop and maintain financial dashboards, models, and analytical tools\n\\n\nPartner with Accounting and Finance to understand business needs and deliver effective system solutions\n\\n\nMaintenance, support, evaluation, configuration of core financial systems\n\\n\nOversee and prioritize support issues, including both US and NL locations\n\\n\nIdentify process inefficiencies and recommend system enhancements or automation opportunities\n\\n\nIn conjunction with the process owner, plan out and justify modifications\n\\n\nSupport upgrades, integrations, and testing for financial modules and addons\n\\n\nProvide end-user support and troubleshooting for financial systems and tools\n\\n\nTechnology\n\\n\nStay on top of evolving & emerging technologies that may have a home in NewAge Industries\n\\n\nTest, trial, and explore various technologies as they are identified, such as AI, automation, handhelds, etc.\n\\n\nRequirements: \\n\nEducation, Skills and Experience Requirements:\n\\n\n\\n\nBachelor’s in Accounting, Finance, or related field\n\\n\nWorking knowledge of accounting and costing modules of Business Central in a manufacturing environment\n\\n\nImplementation of add-on systems such as financial planning and\n\\n\nExperience working in an environment requiring consolidation of multiple general ledgers\n\\n\nStrong understanding of accounting process and GAAP\n\\n\nAbility to use time effectively and efficiently while managing multiple priorities\n\\n\nStrong verbal and written communication skills\n\\n\nEffective planning, organization, analytical, problem solving and troubleshooting skills required\n\\n\nDemonstrated dependability, reliability and ability to work well independently with minimal supervision\n\\n\nLanguage Skills:\n\\n\nAbility to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations. Ability to write reports, business correspondence, and work instructions. Ability to effectively present information and respond to questions from groups of administrators and the public.\n\\n\nReasoning Ability:\n\\n\nAbility to solve practical problems and deal with a variety of concrete variables in situations where only limited standardization exists. Ability to interpret a variety of instructions furnished in written, oral, diagram, or schedule form.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}