{
  "filename": "data_analyst_Houston__TX_page2_job6_Business_Systems_Analyst_I.html",
  "job_title": "Business Systems Analyst I",
  "company": "Texas Children's Hospital",
  "location": "Missouri City, TX",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:46:02.640Z",
  "full_description": "\\n\nWe are searching for a Business Systems Analyst – someone who works well in a fast-paced setting. In this position, you will develop clinical and business solutions by investigating processes to understand data and communications flow with individual tasks and transactions and to manage the ongoing maintenance of applications. This role will investigate processes to meet end-user needs within Texas Children's. Additionally, provide financial systems support, coordinate system upgrades, and provide other system support. This position will support the operations of Infusion and Compounding and Repackaging pharmacies.\n\\n\n\\n  Think you’ve got what it takes?\nJob Duties & Responsibilities - Responsibilities Include (but not limited to):\n\\n\n\\n\nCollaborates with internal core stakeholders to identify system issues and process needs, and ensures EMR and other systems are being optimized\n\\n\nOversee and manage shipping logistics to ensure timely and accurate deliveries\n\\n\nMonitor compounding production schedules and promptly address any deviations\n\\n\nCoordinate production requirements for IV compounding robots\n\\n\nTrack compounded product orders and maintain accurate manifest log documentation\n\\n\nGather and analyze data to support projects, quality improvement efforts, and metrics for accreditation compliance\n\\n\nAs part of our commitment to maintaining a safe and healthy workplace, all successful candidates will be required to undergo respiratory fit testing in compliance with occupational health and safety standards.\n\\n\nSkills & Requirements\n\\n\n\\n\nRequired H.S. Diploma or GED\n\\n\nPreferred bachelor's degree in computer science, business administration, healthcare administration, or nursing\n\\n\nPreferred 2 years’ experience in information systems\n\\n\nNote: there may be days the Analyst may have to work outside the regular hours and needs to be flexible.\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=224a97e67b8931cc&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfmissbl03785n&spon=0&xkcb=SoCK67M3pvlEerygL50NbzkdCdPP&xfps=dec2d9b7-e5b5-4a32-8c73-52cd35b60286&vjfrom=vjs&asub=mob&astse=ebd0fdd9c0fd7861&assa=2956"
}