{
  "filename": "data_analyst_New_York__NY_page7_job10_Business_Intelligence_Analyst.html",
  "job_title": "Business Intelligence Analyst",
  "company": "Canary Technologies",
  "location": "New York, NY•Hybrid work",
  "salary": "$80,000 - $130,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:14:37.946Z",
  "full_description": "\\n\n\\n\n\\n\nAbout Us\n\\n\n\\n\n\\n   Canary Technologies is changing the game for hotels with modern software powered by Canary's hospitality-specific AI platform.\\n\n\\n\n\\n\n\\n\nCanary is utilized by 20,000+ hoteliers in 100+ countries to equip hoteliers with the technology they need to work smarter and wow their guests. Major hotel brands such as Wyndham, Marriott, IHG, Four Seasons, Rosewood, and Best Western trust Canary to deliver results.\n\\n\n\\n\n\\n\n\\n   Canary was named a 2024 Deloitte Technology Fast 500™ company, a Most Innovative Company by Fast Company and a HotelTechReport Best Place to Work — and is backed by top Silicon Valley investors like Y Combinator, F-Prime, Brighton Park Capital and Insight Partners.\n\\n\n\\n\n\\n\n\\n\nJoin us in shaping the future of hospitality!\n\\n\n\\n\n\\n\n\\n\nAbout the Role:\n\\n\n\\n\n\\n   As a Business Intelligence Manager at Canary Technologies, you’ll ensure that business and customer decisions are powered by reliable, trusted data. You’ll build the data models, pipelines, and dashboards that turn complex hospitality data into clear insights, enabling teams across Product, Customer Success, and GTM to move faster and smarter. This role is part of Canary’s Product organization and will report directly to the Product Strategy & Operations Lead. This NYC‑based, hybrid role is hands‑on with SQL and BI tools and focuses on making our data consistently analysis‑ready.\\n\n\\n\n\\n\n\\n\n\\n\nResponsibilities\n\\n\n\\n\n\\n\n\\n\nModel & structure:\nDesign clean, performant table structures and semantic layers in our warehouse (e.g.,\nSnowflake\n) that enable consistent, self‑service analysis.\n\\n\nData accuracy & trust:\nEstablish data quality checks (e.g., dbt tests/observability), reconcile sources, and monitor KPIs that signal freshness, completeness, and accuracy across dashboards.\n\\n\nCustomer data feeds:\nOwn automated data feeds (API/SFTP) and scheduled enterprise reports; maintain reliability and documentation for multi‑property hotel groups.\n\\n\nCross‑functional partnership:\nWork closely with\nData Engineering\nto land reliable sources and with\nProduct/CS/GTM\nto translate requirements into BI solutions that drive decisions.\n\\n\nDashboards & portfolio analytics:\nBuild and maintain executive‑ready dashboards and Portfolio Analytics for hospitality customers, aligned to field metrics used by hotel teams.\n\\n\nGovernance & documentation:\nDefine naming conventions, metric definitions, and documentation so teams can self‑serve with confidence.\n\\n\nLaunch enablement:\nLead BI readiness for\nnew products/features\n—from data requirements and instrumentation guidance to launch reporting and training.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nQualifications\n\\n\n\\n\n\\n\n\\n\nBachelor’s degree in\nStatistics, Data Science\n, Engineering or related field (or equivalent experience).\n\\n\nAdvanced SQL skills\nand strong experience building/operating transformations and pipelines in production.\n\\n\nHands‑on with the\nmodern data stack\n:\ndbt\n,\nAirflow/Prefect\n, and cloud data warehouses (\nSnowflake/BigQuery/Redshift\n).\n\\n\nProficiency with BI tools (\nLooker/Tableau/Omni\n) including dashboard development and semantic/data modeling.\n\\n\nFamiliarity with\nGit\nand collaborative development workflows (branching, PRs, code review).\n\\n\nDemonstrated ability to\nensure data accuracy and accessibility\nand to partner with engineering on data design and contracts.\n\\n\nStrong stakeholder and project management skills. Comfortable prioritizing competing requests and meeting deadlines in a fast‑moving environment.\n\\n\nClear communicator who can present complex analyses to non‑technical audiences. High ownership and bias to action.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n   $80,000 - $130,000 a year\\n\n\\n\n\\n\nThe base salary range for this role is $80,000-$130,000 annualized salary. This is subject to standard withholding and applicable taxes. Actual compensation will be commensurate with the candidate’s skill level, experience, and specific work location. This role may also include the opportunity to earn a discretionary bonus and/or equity.\n\\n\n\\n\n\\n\n\\n\n\\n   We also work hard to ensure Canary is a fun and exciting place to work! Here are some of the additional benefits:\\n\n\\n\n\\n\n\\n\nCanary Days:\nAs a company we want to ensure that the team has time to recharge. Each month we provide company wide days off to ensure there is at least one extended weekend or day off.\\n\n\\n\n\\n\n\\n\nSelf Improvement Club:\nWe meet each month and share our personal goals for the month. Each individual is provided a budget towards any purchases that help us achieve these goals.\\n\n\\n\n\\n\n\\n\nProfessional Development Chats:\nWe provide budget to help drive cross functional professional development conversations across the organization.\\n\n\\n\n\\n\n\\n\nTravel Reimbursement:\nTeam members are able to visit our offices across New York, San Francisco or Dallas when they choose, and are provided a travel stipend for doing so. Spend time working with the team in their office, and use the rest of your time exploring a new city!\\n\n\\n\n\\n\n\\n\nPersonal Travel Reimbursement:\nIf you stay at a hotel that Canary works with, we provide a credit towards your stay.\\n\n\\n\n\\n\n\\n\nCanary Technologies is an equal opportunity employer. We recruit, employ, train, compensate and promote talent regardless of race, religion, ethnicity, national origin, citizenship, gender, gender identity, sexual orientation, age, veteran status, disability, genetic information or any other protected characteristic.\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=da0b2331c7613850&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfo1hnsi8qp803&spon=0&xkcb=SoAd67M3pv4J5G2EiJ0BbzkdCdPP&xfps=90bf8737-ff97-4a05-8b2e-b20e213fb8bb&vjfrom=vjs&asub=mob&astse=174dd549423b58ff&assa=8279"
}