{
  "filename": "data_analyst_New_York__NY_page6_job1_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "Edmunds GovTech, Inc.",
  "location": "Northfield, NJ 08225•Hybrid work",
  "salary": "$60,000 - $75,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:00:47.341Z",
  "full_description": "\\n Description: \\n\nThis position is responsible for interacting directly with our clients to discover, acquire, and extract data from their legacy software systems using a wide range of technologies such as SQL, Python, and reporting systems. This role is a fast-paced position that involves working on multiple client engagements at various points within the SDLC. Great communication skills, being detail oriented, and overall organization skills are a must.\n\\n\n$60,000 - $75,000 (Employer est)\n\\n\nROLE AND RESPONSIBILITIES WITH ESSENTIAL FUNCTIONS\n\\n\n\\n\nWork on a team of developers, analysts, and consultants focused on data acquisition and migration\n\\n\nPerform data acquisition techniques for gathering system requirements\n\\n\nExtract data from a wide variety of structured, semi-structured, and unstructured formats\n\\n\nAssist in the development of process automations using scripting languages such as Python and Bash\n\\n\nLeverage technical platforms and SQL database scripts to develop data extraction methods\n\\n\nDeliver high-quality customer service.\n\\n\nRequirements: \\n\nQUALIFICATIONS AND EDUCATION REQUIREMENTS\n\\n\n\\n\nBachelor’s Degree in MIS, Computer Science, Business Administration, Accounting, Finance or equivalent work experience.\n\\n\n1-3 years of experience in professional services, client implementation, and/or data migrations.\n\\n\nExperience with Database Management Systems (MSSQL, Oracle, AS400, MySQL, etc.) is a plus.\n\\n\nKnowledge of generalized business practices, accounting reports, financial reports, and payroll reports is a plus.\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=dbcfe37953c250ce&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnfc72293c07e&spon=0&xkcb=SoAd67M3pvmyVWACJ70KbzkdCdPP&xfps=1bf85791-7cbc-4d8c-b689-ea344dad01a9&vjfrom=vjs&asub=mob&astse=549dd2903606021a&assa=3667"
}