{
  "filename": "data_analyst_New_York__NY_page12_job2_Program_Analyst.html",
  "job_title": "Program Analyst",
  "company": "DEPARTMENT OF TRANSPORTATION",
  "location": "34-02 Queens Boulevard, Queens, NY 11101",
  "salary": "$62,868 - $97,593 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:25:26.395Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nProgram Analyst\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDEPARTMENT OF TRANSPORTATION\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted On: 12/13/2025\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nFull-Time\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Location\\n\n\\n\n\\n          QUEENS\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nNo Exam Required\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n           Department\\n\n\\n\n\\n           Tf. Eng./Elect Shop\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Salary Range:\\n\n\\n\n\\n          $62,868.00 – $97,593.00\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Description\n\\n\n\\n\n\\n\n\\n\nThe Division of Traffic Operations’ Special Projects Unit seeks to hire a motivated candidate who, under direct supervision, will assist in various transportation planning projects related to traffic signals and street lighting initiatives, particularly the Accessible Pedestrian Signals (APS) program. APS are devices that communicate information about pedestrian signal timing in a non-visual format, such as audible tones, speech messages, and/or vibrating surfaces. They assist pedestrians who are blind or have low vision to cross streets safely, confidently, and independently.\nTraffic Operations is seeking a skilled and highly motivated professional to support the planning, coordination, communication, analysis, monitoring, and reporting needs of the APS program. The primary duties of the selected candidate will involve assisting in the management of the APS programs, using spatial data to support reporting needs, and ensuring each project moves through each stage of the process on schedule, including scoping, design, construction, and long-term maintenance. This role will assist in ensuring compliance with Federal guidelines for the construction of traffic control devices. The Program Analyst will work with other internal Traffic Operations units as well as NYCDOT Divisions and NYC agencies to implement the program. They will assist with the communication and reporting of various program elements to internal/external stakeholders and entities. They will provide support in updating, organizing, and maintaining program databases, critical correspondences, and preparing detailed progress reports. Meet with other team members to present, discuss, and formulate solutions to resolve the program’s issues and recommend appropriate policies and procedures.\nWork Location: 34-02 Queens Blvd. LIC, NY 11101\nHours/Shift: 35 Hrs./Shift TBD\nThis position may be eligible for remote work up to 2 days per week, pursuant to the Remote Work Pilot Program agreed to between the City and DC37.\nAll resumes are to be submitted electronically using one of the following methods:\nPlease go to www.nyc.gov/careers/search and search for the JOB ID #: 761470\nCurrent employees please log on into Employee Self Service at https://hrb.nycaps.nycnet and follow the Careers Link and search for JOB ID #: 761470\nNo phone calls, faxes or personal inquiries permitted.\nOnly applicants under consideration will be contacted.\nMost public libraries have computers available for use.\nNote: New hires must reside in NYC for the first two years of employment. Appointments are subject to OMB approval.\nFor more information about DOT, visit us at: www.nyc.gov/dot.\nCOMMUNITY COORDINATOR - 56058\n\\n\nMinimum Qualifications\n\\n\n1. A baccalaureate degree from an accredited college and two years of experience in community work or community centered activities in an area related to the duties described above; or\n2. High school graduation or equivalent and six years of experience in community work or community centered activities in an area related to the duties as described above; or\n3. Education and/or experience which is equivalent to \"1\" or \"2\" above. However, all candidates must have at least one year of experience as described in \"1\" above.\n\\n\nPreferred Skills\n- Professional experience in the field of traffic signal design, construction, inspections, and maintenance. - Detailed orientated, accurate, and have strong written and verbal communication skills. - Experience with MS Office Suite, ArcGIS, and/or other GIS software, and Adobe Creative Suite preferred. - Experience with AutoCAD, programming, and database management is a plus. - Familiarity with MUTCD, PROWAG, and traffic signal best practices desired. - Must have the ability to identify problems, manage against tight timelines, and manage multiple projects at the same time.\n\\n\nPublic Service Loan Forgiveness\nAs a prospective employee of the City of New York, you may be eligible for federal loan forgiveness programs and state repayment assistance programs. For more information, please visit the U.S. Department of Education’s website at https://studentaid.gov/pslf/.\n\\n\nResidency Requirement\nNew York City residency is generally required within 90 days of appointment. However, City Employees in certain titles who have worked for the City for 2 continuous years may also be eligible to reside in Nassau, Suffolk, Putnam, Westchester, Rockland, or Orange County. To determine if the residency requirement applies to you, please discuss with the agency representative at the time of interview.\n\\n\nAdditional Information\n\\n\n\\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n        Job ID\\n\n\\n\n\\n        761470\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted until\\n\n\\n\n\\n         01/02/2026\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title code\\n\n\\n\n\\n         56058\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Civil service title\\n\n\\n\n\\n         COMMUNITY COORDINATOR\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title classification\\n\n\\n\n\\n         Non-Competitive-5\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Business title\\n\n\\n\n\\n         Program Analyst\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Experience Level:\\n\nExperienced (Non-Manager)\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Job level\\n\n\\n\n\\n         00\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Number of positions\\n\n\\n\n\\n         1\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Work location\\n\n\\n\n\\n         34-02 Queens Boulevard Long Is\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Category:\\n\nPolicy, Research & Analysis\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n      Program Analyst\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=fe03e4f28c629f47&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoC367M3pv5_3dy4ax0JbzkdCdPP&xfps=1f567a61-4532-42b7-8302-9db1ed12203d&vjfrom=vjs&asub=mob&astse=422fce1bc4f9f825&assa=6755"
}