{
  "filename": "data_analyst_New_York__NY_page2_job12_Business_Analysts.html",
  "job_title": "Business Analysts",
  "company": "Shastra Business Solutions",
  "location": "Princeton Junction, NJ 08550",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:55:00.900Z",
  "full_description": "\\n Our Business Analysts analyze operations to understand strengths and weaknesses to determine opportunities to automate processes and functions. Develop and organize Test Plans and traceable Test Cases based on business requirements. Administrate User testing and support related Test Phase tasks, including Regression testing. Ensure project methodology and I.S. project processes are appropriately administered, documented, and managed in a timely manner. Perform gap-fit analysis, support and document the evaluation of vendor package software as potential solutions to meet business requirements. May make recommendations for buy vs. Build decisions. Perform and complete assigned project tasks to committed effort and dates. Provide management support of overall project schedule by facilitating work assigned to the extended project team members (as appropriate), including functional and legal reviews, analysis, and approvals required from the business staff. Organize and conduct meetings, briefings and demonstrations. Write and distribute minutes of project meetings, tracking action plan commitments. Configure package or custom applications by modifying table-driven application setups which control system functionality through parameters. Communicate with business regarding the use and setup of these parameters.\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=87c4259a6fef53af&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfn2hp0j73685t&spon=0&xkcb=SoCq67M3pvmFm_Rbpp0HbzkdCdPP&xfps=3d3e5b6f-8349-4d0f-8a3f-d3b84ce53f4b&sjdu=4nldCuK3uXOUCwmHoZVJDePUUGGqOA1i2t8My_2_rs69nN3Sc1PKWVcgPtpQg2LvuIj4yp6boH1eFRf9YmF9qg&vjfrom=vjs&asub=mob&astse=50edf85d73f3ea48&assa=6242"
}