{
  "filename": "data_analyst_New_York__NY_page10_job14_Primary_Research_Data___Insigh.html",
  "job_title": "Primary Research Data & Insights Analyst",
  "company": "Elsevier",
  "location": "New York, NY 10025",
  "salary": "$73,400 - $148,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:22:34.073Z",
  "full_description": "\\n\n\\n\n\\n  Data & Insights Analyst, Primary Research\\n\n\\n\n\\n\n\\n  Are you passionate about transforming data into actionable insights that shape strategic initiatives?\\n\n\\n\n\\n\n\\n  Do you thrive in a fast-paced, collaborative environment where your analysis directly influences go-to-market strategies and revenue growth?\\n\n\\n\n\\n\n\\n  About our Team\\n\n\\n\n\\n  A global leader in information and analytics, we help researchers and healthcare professionals advance science and improve health outcomes for the benefit of society. Building on our publishing heritage, we combine quality information and vast data sets with analytics to support visionary science and research, health education and interactive learning, as well as exceptional healthcare and clinical practice. At Elsevier, your work contributes to the world's grand challenges and a more sustainable future. We harness innovative technologies to support science and healthcare to partner for a better world.\\n\n\\n\n\\n\n\\n  About the Role\\n\n\\n\n\\n  The Data & Insights Analyst, Primary Research will serve as a vital resource for the global Primary Research team. You will provide analytical expertise to inform and accelerate Go-To-Market (GTM) initiatives, optimize business models, and support strategic decision-making. Reporting to the Director of Primary Research – Commercial Propositions, you will deliver timely, impactful analyses that drive action and support the team's growth objectives.\\n\n\\n\n\\n\n\\n  Responsibilities\\n\n\\n\n\\n\n\\n\n\\n    Supporting GTM initiatives by providing data-driven insights to help accelerate growth in primary research revenue.\\n\n\\n\n\\n\n\\n    Conducting analysis related to existing journal packaging options and commercial approaches, including subscription and open access models.\\n\n\\n\n\\n\n\\n    Developing and delivering bespoke analyses to support regional and global commercial projects, ensuring insights are clear and actionable.\\n\n\\n\n\\n\n\\n    Collaborating with cross-functional teams, including Research Sales, Customer Success, Marketing, and STMJ on projects related to Primary Research.\\n\n\\n\n\\n\n\\n\n\\n\nRequirements\\n\n\\n\n\\n\n\\n\n\\n    Have excellent analytical skills with the ability to structure and interpret complex, unstructured data.\\n\n\\n\n\\n\n\\n    Display proven experience in delivering impactful insights from diverse data sources, with a commercial mindset.\\n\n\\n\n\\n\n\\n    Have familiarity with sales and marketing data tools and systems such as Salesforce, Tableau, Snowflake, and Excel.\\n\n\\n\n\\n\n\\n    Able to work in an agile, dynamic environment, managing multiple priorities and tight deadlines.\\n\n\\n\n\\n\n\\n    Display excellent communication skills, capable of presenting insights clearly to non-technical stakeholders.\\n\n\\n\n\\n\n\\n    Have knowledge of publishing, primary research business models, and open access frameworks is highly valued.\\n\n\\n\nPrimary Location Base Pay Range: Home based-New York $85,000 - $141,600.\nIf performed in New York City, the pay range is $88,900 - $148,000. If performed in Rochester, NY, the pay range is $73,400 - $122,300. If performed in Ohio, the pay range is $73,400 - $122,300. U.S. National Pay Range: $77,300 - $128,700. Geographic differentials may apply in some locations to better reflect local market rates.\nThis job is eligible for an annual incentive bonus.\nWe know that your wellbeing and happiness are key to a long and successful career. These are some of the benefits we are delighted to offer to our US full- and part-time employees working at least 20 hours or more per week: Health Benefits: Comprehensive, multi-carrier program for medical, dental and vision benefits Retirement Benefits: 401(k) with match and an Employee Share Purchase Plan Wellbeing: Wellness platform with incentives, Headspace app subscription, Employee Assistance and Time-off Programs Short-and-Long Term Disability, Life and Accidental Death Insurance, Critical Illness, and Hospital Indemnity Family Benefits, including bonding and family care leaves, adoption and surrogacy benefits Health Savings, Health Care, Dependent Care and Commuter Spending Accounts In addition to annual Paid Time Off, we offer up to two days of paid leave each to participate in Employee Resource Groups and to volunteer with your charity of choice\\n\n\\n\nWe are committed to providing a fair and accessible hiring process. If you have a disability or other need that requires accommodation or adjustment, please let us know by completing our \\n\n\\n   Applicant Request Support Form\\n\nor please contact 1-855-833-5120.\\n\n\\n\n\\n\n\\n  Criminals may pose as recruiters asking for money or personal information. We never request money or banking details from job applicants. Learn more about spotting and avoiding scams \\n\n\\n   here\\n\n.\\n\n\\n\n\\n\n\\n  Please read our \\n\n\\n   Candidate Privacy Policy\\n\n.\\n\n\\n\n\\n\n\\n  We are an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law.\\n\n\\n\n\\n\n\\n\nUSA Job Seekers:\n\\n\n\\n\n\\n\n\\n   EEO Know Your Rights\\n\n.\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=1a6bedc6cab9f8f8&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoj3k62dir088&spon=0&xkcb=SoDS67M3pv5DoOyJaB0FbzkdCdPP&xfps=e7f570eb-507e-43aa-9f34-d03634b61b6f&vjfrom=vjs&asub=mob&astse=5bb95f0a88590aae&assa=4591"
}