{
  "filename": "data_analyst_New_York__NY_page9_job10_Business_Analyst___Digital_Exp.html",
  "job_title": "Business Analyst - Digital Experience",
  "company": "Plymouth Rock Assurance Corporation",
  "location": "Woodbridge, NJ 07095",
  "salary": "$60,000 - $87,500 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:19:27.490Z",
  "full_description": "\\n\n\\n\nWe are looking for a highly motivated and detail-oriented Business Analyst to join our Customer Experience team. This role is crucial in helping define the future of our online quoting platform. You will act as the key link between business stakeholders and the IT team, ensuring we deliver features that meet business demands and strategic objectives. This is an excellent opportunity for an entry-level professional with 1-2 years of relevant experience to grow their career in a dynamic, high-impact product, and collaborative environment.\nRESPONSIBILITIES\n\\n\n\\n\nCollaborate with stakeholders to understand their needs, document requirements, and ensure that they are accurately captured and communicated\n\\n\nDevelop clear, concise, and comprehensive business requirements (BRDs, user stories, acceptance criteria, etc.) that clearly articulate the 'what' and 'why' for IT teams\n\\n\nAssist in developing and maintaining product documentation including business requirements, process flows, and user stories\n\\n\nFacilitate meetings, present findings, and communicate requirements and scope changes effectively to technical and non-technical audiences\n\\n\nTrack and evaluate key performance indicators (KPIs) across digital workflows and related platforms to identify trends and support process improvements\n\\n\nAssist in the refinement, testing (UAT), deployment and documentation of new features, ensuring the delivered features meet the defined requirements\n\\n\n\\n\nQUALIFICATIONS\n\\n\n\\n\n1-2 years of professional experience in a business analyst, product support, or similar role.\n\\n\nBachelor's degree in Business Administration, Information Technology, Finance, or a related field.\n\\n\nAbility to analyze complex information, understand business needs, and translate them into actionable requirements.\n\\n\nExcellent verbal and written communication skills, with a strong ability to produce clear and well-structured documentation.\n\\n\nStrong problem-solving skills and is detail oriented\n\\n\nProficiency in data analysis tools and techniques\n\\n\nHas a proactive attitude, willingness to learn, ability to act as a team player\n\\n\nFamiliarity with the auto insurance industry or experience working on e-commerce/online sales platforms is a plus.\n\\n\nExperience with or understanding of the product development process is a plus\n\\n\n\\n\nSALARY RANGE\n\\n\nThe pay range for this position is $60,000 to $87,500 annually. Actual compensation will vary based on multiple factors, including employee knowledge and experience, role scope, business needs, geographical location, and internal equity.\nPERKS & BENEFITS\n\\n\n\\n\n4 weeks accrued paid time off, 8 paid national holidays per year, and 2 floating holidays\n\\n\nLow cost and excellent coverage health insurance options that start on Day 1 (medical, dental, vision)\n\\n\nAnnual 401(k) Employer Contribution\n\\n\nFree onsite gym and health center at our Woodbridge Location\n\\n\nResources to promote Professional Development (LinkedIn Learning and licensure assistance)\n\\n\nRobust health and wellness program and fitness reimbursements\n\\n\nVarious Paid Family leave options including Paid Parental Leave\nTuition Reimbursement\\n\n\\n\nABOUT THE COMPANY\n\\n\nThe Plymouth Rock Company and its affiliated group of companies write and manage over $2 billion in personal and commercial auto and homeowner's insurance throughout the Northeast and mid-Atlantic, where we have built an unparalleled reputation for service. We continuously invest in technology, our employees thrive in our empowering environment, and our customers are among the most loyal in the industry. The Plymouth Rock group of companies employs more than 1,900 people and is headquartered in Boston, Massachusetts. Plymouth Rock Assurance Corporation holds an A.M. Best rating of “A-/Excellent”.\n\\n\n\\n\n#LI-DNI\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}