{
  "filename": "data_analyst_New_York__NY_page5_job5_Data_Processing_Analyst__12_Mo.html",
  "job_title": "Data Processing Analyst (12 Month Fixed Term Contract)",
  "company": "Arch",
  "location": "New York, NY",
  "salary": "$65,000 - $68,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:59:17.912Z",
  "full_description": "\\n\nOur Company\n\\n\nArch is a Series B financial technology company that automates the management of private investments, improving access, understanding, and the human experience of investing across asset classes.\n\\n\nPrivate investments such as venture capital, hedge funds, and private equity, make up roughly 25% of the investment universe. Traditionally, investors, advisors, banks, families, and managers track hundreds of investments in complicated spreadsheets, file folders, and busy inboxes. Not only is this tedious and time-consuming, but it is rife with opportunity for manual data entry errors, inconsistent reporting, and lost information. Enter, Arch.\n\\n\nArch delivers standardized data, documents, and insights in a single platform, avoiding the need to chase information across dozens or hundreds of ‘portals’. Our purpose is to save investors’ time while empowering them to make more informed investment decisions, leading to better financial outcomes.\n\\n\nWe are a fast-growing, dynamic team of 120+, serving over 400 clients, including several of America’s largest banks, families, and financial institutions. We’ve over doubled the size of the company every year since inception and we are looking to hire in all departments as we scale.\n\\n\nData Processing Analyst\n\\n\nAs a\nData Processing Analyst,\nyou’ll be responsible for processing and classifying real-time updates on private investments. Your work will ensure that all data is accurately captured, organized, and consolidated, helping us deliver timely, reliable insights to our clients. This is a unique opportunity to make an impact on how private investment data is processed and used, shaping the future of our clients' decision-making.\n\\n\nKey Responsibilities\n\\n\n\\n\nProcess and monitor account information, including updates from clients and funds.\n\\n\nCoordinate tax season documents and ensure timely and accurate submission.\n\\n\nMonitor inbound data, identify relevant updates, and categorize them appropriately.\n\\n\nMaintain a high level of attention to detail when classifying data.\n\\n\nConduct quality control of data received, identified, categorized, and extracted\n\\n\nAssist with internal audits, system reviews, and data accuracy checks when necessary.\n\\n\nExtract, reconcile, and process data from multiple sources.\n\\n\nCollaborate with internal teams to ensure data integrity, resolve any discrepancies in investment information, and improve internal data processing and oversight processes\n\\n\nEnsure all data processing adheres to internal compliance and security protocols.\n\\n\nWork to improve and optimize our data receiving and processing workflow and systems.\n\\n\nSupport periodic evening & weekend work as part of our operating rhythm to meet client SLAs\n\\n\n\\n\nReach out to us if you have:\n\\n\n\\n\n1+ years of experience in data processing, management, or operations—ideally in a tech or services company that thrives on data\n\\n\nA sharp eye for detail, ensuring accuracy in data classification and processing every step of the way\n\\n\nExperience handling sensitive financial data with utmost security and confidentiality\n\\n\nStrong interpersonal skills with the ability to engage and communicate effectively with internal teams, clients, and external partners.\n\\n\nThe ability to thrive in a fast-paced, ever-changing environment, adapting quickly to new workflows and technologies\n\\n\n\\n\nBonus points if you:\n\\n\n\\n\nHave worked with financial or private investment data.\n\\n\nHave taken finance or accounting courses.\n\\n\nProficiency with Excel\n\\n\n\\n\nA Note about us:\n\\n\nAll of our full-time roles are\nbased onsite at our New York City office\n, where our team thrives on in-person collaboration and dynamic teamwork. Being onsite daily enables us to build strong connections, collaborate effectively to solve challenges, and foster an engaging environment focused on shipping product and delivering exceptional service to our clients.\n\\n\nWe encourage applicants currently located in or willing to relocate to the NYC area to join us in this exciting, hands-on workspace.\n\\n\n\\n\nSome perks of working for Arch include:\n\\n\n\\n\nStrong Team\n- You’ll be backed by a strong team that consistently exceeds client expectations and ships new products quickly.\n\\n\nYour work is high impact\n- Being part of a small team means you have real responsibility and impact from day one. You'll be involved in discussions that drive the growth and direction of our platform from the very beginning.\n\\n\nProduct Market Fit\n- We have strong product market fit, exceptionally low churn, and have grown mostly organically through word of mouth.\n\\n\nTeam community and camaraderie\n- We have enormous trust in each other and always do what we can do to support one another. We're always ready to step in to help.\n\\n\nGreat office\n- we’ve invested in a great space for the Arch team to come together, at 18th and Park in Manhattan (the old Buzzfeed / NYT headquarters).\n\\n\nLunch is on Us\n- Grab lunch on us while you’re in the office and take a break to laugh, brainstorm, or just hang out with your teammates over a meal.\n\\n\n\\n\nCompensation Range: $65K - $68K\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=045f3946f8c270bd&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnbj48jn1a803&spon=0&xkcb=SoB667M3pvmhsM20BR0ObzkdCdPP&xfps=e9e631fa-9dbd-4d7e-9f0a-4e2ff471f3f0&vjfrom=vjs&asub=mob&astse=f458334649c15169&assa=8219"
}