{
  "filename": "data_analyst_New_York__NY_page12_job4_Asthma_Data_Analyst__Bureau_of.html",
  "job_title": "Asthma Data Analyst, Bureau of Bronx Neighborhood Health",
  "company": "DEPT OF HEALTH/MENTAL HYGIENE",
  "location": "1826 Arthur Avenue, Bronx, NY 10457",
  "salary": "$74,536 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:25:46.878Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nAsthma Data Analyst, Bureau of Bronx Neighborhood Health\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDEPT OF HEALTH/MENTAL HYGIENE\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted On: 12/10/2025\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nFull-Time\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Location\\n\n\\n\n\\n          BRONX\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nNo Exam Required\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n           Department\\n\n\\n\n\\n           CHECW - BX. NEIGHBORHOOD HLTH.\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Salary Range:\\n\n\\n\n\\n          $74,536.00 – $74,536.00\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Description\n\\n\n\\n\n\\n\n\\n\n\\n      The Center for Health Equity & Community Wellness (CHECW) seeks to eliminate inequities resulting in premature mortality. With an unwavering grounding in history and structural analysis, CHECW works to increase visibility of socially unjust policy while pushing towards redress for the most impacted NYC communities. CHECW addresses inequity across community and healthcare systems in partnership with community, faith-based, and health care organizations. CHECW's work focuses on social determinants of health, including environmental and commercial determinants, and addresses both upstream and downstream factors to improve health and well-being of New Yorkers. CHECW is comprised of the Bureau of Bronx Neighborhood Health, the Bureau of Brooklyn Neighborhood Health, the Bureau of Harlem Neighborhood Health, the Bureau of Chronic Disease Prevention, the Bureau of Health Equity Capacity Building, the Bureau of Equitable Health Systems and the Bureau of Finance, Administration and Services.\nThe Division's Deputy Commissioner also serves as the Agency's Chief Equity Officer and oversees Race to Justice, the Agency's internal reform effort to help our staff learn what they can do to better address racial health gaps and improve health outcomes for all New Yorkers. The division's Deputy Commissioner also serves as the Agency's Chief Medical Officer. The Bureau of Bronx Neighborhood works with clinical and community partners to expand access to high-quality, culturally responsive programs that prevent and manage chronic diseases, especially for residents facing the greatest health challenges. The Bureau provides public health and social services, coordinates community events, builds collaborative partnerships, and leads research and evaluation initiatives that drive evidence-based action, close health gaps and advance equity across the Bronx. From diabetes and asthma education to nutrition, food security, newborn safety, and childbirth-classes, the Bureau empowers New Yorkers with the knowledge and tools to live healthier lives.\nThe Bureau of Bronx Neighborhood Health seeks to hire a Asthma Program Analyst who will be responsible for the day-to-day management of data collection and analysis.\nDUTIES WILL INCLUDE BUT NOT BE LIMITED TO:\n\\n\n\\n\nEnsure the accuracy and quality of data collection processes.\n\\n\nAnalyze program data.\n\\n\nRespond to data requests and conduct literature reviews.\n\\n\nPrepare routine and special reports on neighborhood and program data analyses.\n\\n\nSupervise data entry.\n\\n\nCoordinate with other Bronx Asthma Program staff on asthma program evaluation activities.\n\\n\nRepresent the program at departmental, local, statewide, and national meetings.\n\\n\nContribute to the dissemination of findings through peer-reviewed manuscripts, technical reports, presentations, and other formats to promote.\n\\n\nKnowledge sharing and program visibility.\n\\n\nPREFERRED SKILLS:\n\\n\n\\n\nCommitment to anti-racism, social justice and equity\n\\n\nExcellent skills in presentation, organization, and written and oral communication.\n\\n\nExcellent organizational skills with the ability to manage and prioritize multiple projects, tasks, and timelines.\n\\n\nProven track record of applying an equity lens to processes, planning and policies\n\\n\nExperience working in applied public health programs.\n\\n\nPrior program evaluation experience.\n\\n\nExcellent quantitative and qualitative analytical skills and familiarity with appropriate. analytical software required.\n\\n\nExperience in program evaluation and/or epidemiologic research. Expertise in SAS or other statistical software.\n\\n\nWhy you should work for us:\n\\n\n\\n\nBenefits: City employees are entitled to unmatched benefits such as:\n\\n\no a premium-free health insurance plan that saves employees over $10K annually, per a 2024 assessment.\no additional health, fitness, and financial benefits may be available based on the position’s associated union/benefit fund.\no a public sector defined benefit pension plan with steady monthly payments in retirement.\no a tax-deferred savings program and\no a robust Worksite Wellness Program that offers resources and opportunities to keep you healthy while serving New Yorkers.\n\\n\n\\n\nWork From Home Policy: Depending on your position, you may be able to work up to two days during the week from home.\n\\n\n- Job Security - you could enjoy more job security compared to private sector employment and be able to contribute to making NYC a healthy place to live and work.\nEstablished in 1805, the New York City Department of Health and Mental Hygiene (NYC Health Department) is the oldest and largest health department in the U.S., dedicated to protecting and improving the health of NYC. Our mission is to safeguard the health of every resident and cultivate a city where everyone, regardless of age, background, or location, can achieve their optimal health. We provide a wide array of programs and services focused on food and nutrition, anti-tobacco support, chronic disease prevention, HIV/AIDS treatment, family and child health, environmental health, mental health, and social justice initiatives. As the primary population health strategist and policy authority for NYC, with a rich history of public health initiatives and scientific advancements, from addressing the 1822 yellow fever outbreak to the COVID-19 pandemic, we serve as a global leader in public health innovation and expertise.\nCome join us and help to continue our efforts in making a difference in the lives of all New Yorkers!\nThe NYC Health Department is an inclusive equal opportunity employer committed to providing access and reasonable accommodation to all individuals. To request reasonable accommodation to participate in the job application or interview process, contact Sye-Eun Ahn, Director of the Office of Equal Employment Opportunity, at sahn1@health.nyc.gov or 347-396-6549.\nCITY RESEARCH SCIENTIST - 21744\\n\n\\n\nMinimum Qualifications\n\\n\n1. For Assignment Level I (only physical, biological and environmental sciences and public health) A master's degree from an accredited college or university with a specialization in an appropriate field of physical, biological or environmental science or in public health.\nTo be appointed to Assignment Level II and above, candidates must have:\n1. A doctorate degree from an accredited college or university with specialization in an appropriate field of physical, biological, environmental or social science and one year of full-time experience in a responsible supervisory, administrative or research capacity in the appropriate field of specialization; or\n2. A master's degree from an accredited college or university with specialization in an appropriate field of physical, biological, environmental or social science and three years of responsible full-time research experience in the appropriate field of specialization; or\n3. Education and/or experience which is equivalent to \"1\" or \"2\" above. However, all candidates must have at least a master's degree in an appropriate field of specialization and at least two years of experience described in \"2\" above. Two years as a City Research Scientist Level I can be substituted for the experience required in \"1\" and \"2\" above.\nNOTE:\nProbationary Period\nAppointments to this position are subject to a minimum probationary period of one year.\n\\n\nPublic Service Loan Forgiveness\nAs a prospective employee of the City of New York, you may be eligible for federal loan forgiveness programs and state repayment assistance programs. For more information, please visit the U.S. Department of Education’s website at https://studentaid.gov/pslf/.\n\\n\nResidency Requirement\nNew York City residency is generally required within 90 days of appointment. However, City Employees in certain titles who have worked for the City for 2 continuous years may also be eligible to reside in Nassau, Suffolk, Putnam, Westchester, Rockland, or Orange County. To determine if the residency requirement applies to you, please discuss with the agency representative at the time of interview.\n\\n\nAdditional Information\n\\n\n\\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n        Job ID\\n\n\\n\n\\n        760945\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted until\\n\n\\n\n\\n         02/07/2026\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title code\\n\n\\n\n\\n         21744\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Civil service title\\n\n\\n\n\\n         CITY RESEARCH SCIENTIST\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title classification\\n\n\\n\n\\n         Non-Competitive-5\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Business title\\n\n\\n\n\\n         Asthma Data Analyst, Bureau Of Bronx Neighborhood Health\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Experience Level:\\n\nExperienced (Non-Manager)\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Job level\\n\n\\n\n\\n         01\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Number of positions\\n\n\\n\n\\n         1\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Work location\\n\n\\n\n\\n         1826 Arthur Ave., Bronx\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Category:\\n\nPolicy, Research & Analysis\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n      Asthma Data Analyst, Bureau of Bronx Neighborhood Health\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=88daff46b70bd3e7&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdforvv1kgq082u&spon=0&xkcb=SoCN67M3pv5_3dy4ax0PbzkdCdPP&xfps=ec4b843f-af19-444b-bdf3-9098d13fc7c3&vjfrom=vjs&asub=mob&astse=421aa9cacecbba9e&assa=7251"
}