{
  "filename": "data_analyst_New_York__NY_page8_job10_Clinical_Business_Analyst_Leve.html",
  "job_title": "Clinical Business Analyst Level I",
  "company": "NYC Health + Hospitals",
  "location": "New York, NY",
  "salary": "$62,861 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:17:04.398Z",
  "full_description": "\\n\n\\n\n\\n\nAbout NYC Health + Hospitals\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nLincoln Medical and Mental Health Center is one of New York City’s premier acute care hospitals. Located in Downtown Bronx, Lincoln is a teaching hospital renowned for its Centers of Excellence, and a recognized industry leader in the implementation of state-of-the art medical technology and best practices. Our team of highly trained and caring medical professionals is dedicated to providing the highest quality health care that is safe, compassionate, culturally competent and patient-centered. Comprehensive services are offered in three major primary care areas: Medicine, Pediatrics, and Women’s Health in addition to more than eighty (80) specialty services. At Lincoln, the safety and comfort of our patients is our number one priority.\n\\n\nAt NYC Health + Hospitals, our mission is to deliver high quality care health services, without exception. Every employee takes a person-centered approach that exemplifies the ICARE values (Integrity, Compassion, Accountability, Respect, and Excellence) through empathic communication and partnerships between all persons.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDuties & Responsibilities\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPurpose of Position\n:\nUnder varying levels of direction and expertise, is responsible for the on-going assessment, design, development and implementation of system-wide clinical systems. Specifically, collect and transform large quantities of information into meaningful business requirements; develop and modify requirements documentation for the design and implementation of clinical information systems; critically evaluate information from various sources; distinguish user needs from actual business needs and partner with business users, project managers, programmers, consultants and IT leadership in optimizing the scope, benefits and risks of actual and proposed projects as well as assist in managing stakeholder expectations.\nExamples of Typical Tasks\n:\n1. Analyze and document business requirements and processes; communicate requirements to technical personnel through the construction of basic conceptual data, process models and flowcharts, and technical specifications.\n2. Interview end users, stakeholders, and project sponsors in order to assess business and clinical needs; create business, functional, and technical requirements document based on captured data and, in accordance with departmental protocol/standards.\n3. Convert information gathered into specific details including data sources, data and user types, interface components, interface navigation needs, reporting needs and administrative system needs.\n4. Define external interfaces, constraints, quality issues and other non-functional requirements.\n5. Provide project management team with identified risks, concerns, and ambiguities discovered during the gathering of requirements; assist team in developing solutions.\n6. Partner with project managers to complete requirements documentation, in accordance with project schedule.\n7. Plan, organize, facilitate, and lead meetings and workgroups as well as oversee and execute follow-up activities.\n8. Ensure software development team accounts for all defined technical requirements, in coordination with quality assurance team. Ensure that all quality standards comply with internal policies and industry standards.\n9. Document changes to baseline requirements through standard change control process. Document software test plans, technical requirements, release notes, user and training guidelines and other materials.\n10. Plan, coordinate, and support unit acceptance testing and subsequent deployments, in coordination with other team leaders.\n11. Perform end user and application support functions including problem solving and resolution of application function defects. Provide systems and application training.\n12. Develop and execute project presentations.\n13. Participate in special projects, as required.\n14. Provide training to and serve as a mentor for junior clinical business analysts and/or other appropriate project team members; manage and evaluate work products for assigned team members.\n15. Participate in the development of various departmental training initiatives.\n16. Interview junior clinical business analysts and/or other appropriate project team members.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nMinimum Qualifications\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n1. A Masters degree or advanced clinical degree from an accredited college or university; or\n2. A Baccalaureate degree from an accredited college or university and one (1) year of experience gathering and documenting business, clinical, and/or functional requirements for software applications development and implementation in a clinical, allied health, non-allied health, behavioral health, information technology, information services, business, analytics or related area; or, one (1) year of experience in a relevant clinical and/or healthcare administration role/function; or\n3. A satisfactory combination of education, training, and experience.\n4. Specialty certification(s) issued by a national commercially available program, state, professional society, academic or technical institution in an area(s) listed above, may be credited on a month-to-month basis toward the required work experience for a total of one (1) year.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nBenefits\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nNYC Health and Hospitals offers a competitive benefits package that includes:\n\\n\n\\n\nComprehensive Health Benefits for employees hired to work 20+ hrs. per week\n\\n\nRetirement Savings and Pension Plans\n\\n\nPaid Holidays and Vacation in accordance with employees' Collectively bargained contracts\n\\n\nLoan Forgiveness Programs for eligible employees\n\\n\nCollege tuition discounts and professional development opportunities\n\\n\nCollege Savings Program\n\\n\nUnion Benefits for eligible titles\n\\n\nMultiple employee discounts programs\n\\n\nCommuter Benefits Programs\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nHow To Apply\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nIf you wish to apply for this position, please apply online by clicking the \"Apply for Job\" button.\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=1550faf22e7a5d43&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoa4c0i8qp87r&spon=0&xkcb=SoAX67M3pv4nSMACJ70AbzkdCdPP&xfps=2a176429-4924-4524-8e09-445d59f287a5&vjfrom=vjs&asub=mob&astse=0b5271de5f4ab569&assa=3610"
}