{
  "filename": "data_analyst_Houston__TX_page2_job11_IT_Business_Analyst___Enterpri.html",
  "job_title": "IT Business Analyst - Enterprise Applications & Business Solutions",
  "company": "Flowserve Corporation",
  "location": "Houston, TX 77007",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:46:55.146Z",
  "full_description": "\\n\nRole Summary:\n\\n\nThe IT Business Analyst – Enterprise Applications & Business Solutions role will support data process leads with data acquisition, normalization and publishing activities Provide data reporting services to the enterprise.\n\\n\nResponsibilities:\n\\n\n\\n\nExtracts required data from ERP or other IT systems.\n\\n\nEnsure high level accuracy of acquired data.\n\\n\nProvide high quality data reporting services.\n\\n\nPerform data testing, cleaning, and normalization activities.\n\\n\nSupport data process leads in KPI maturity roadmaps.\n\\n\nExclusively work with standardized design format files and mapping templates.\n\\n\nSupport the setting up of a ticket system to take in and manage data processing service requests.\n\\n\nComplete data processing service requests within target lead-times.\n\\n\nTeam player with excellent communication and collaborative skills.\n\\n\nOther duties as assigned.\n\\n\n\\n\nRequirements:\n\\n\n\\n\nBS or BA Degree in relevant field and 8-10 years relevant experience\n\\n\nAble to influence stakeholders to achieve the desired results.\n\\n\nShould possess high level of affinity with ERP and other IT systems (Oracle, SAP, BPC, Power BI, MS Office).\n\\n\nShould be highly responsive and possess extremely strong work ethics.\n\\n\n\\n\nPreferred:\n\\n\n\\n\nIndustrial manufacturing experience in data analysis activities.\n\\n\nSkills in SQL DB, Data Engineering & Data Analytics; python programming is added advantage.\n\\n\n\\n\nBenefits Starting on Day 1:\n\\n\n\\n\nMedical, Dental & Vision Insurance (including FSA and HSA options)\n\\n\nLife Insurance + Supplemental Life, Child, Spousal, and AD&D Insurance\n\\n\nShort- and Long-Term Disability\n\\n\nRetirement Planning, 401(k) plan, & Financial Wellness Resources\n\\n\nEducational Assistance Program\n\\n\nTime off Policies (including sick leave, parental leave, and paid vacation)\n\\n\nEligibility requirements apply to some benefits and may depend on job classification and length of employment\n\\n\n\\n\nFlowserve is a world-leading manufacturer and aftermarket service provider of comprehensive flow control systems. Join a company whose people are committed to building a more sustainable future to make the world better for everyone. With 16,000+ employees in 50+ countries, we combine our global reach with local presence. Our team challenges themselves to approach each situation with ingenuity and creativity to help provide our customers with the most innovative flow control products and services. We support 10,000+ customers worldwide, creating products to meet the needs of our customers who are supplying energy, fresh water, pharmaceuticals and other essentials to consumers, businesses and governments globally. We invite you to put your talents and career in motion at Flowserve.\n\\n\nReq ID\n: R-17460\n\\n\nJob Family Group\n: Information Technology\n\\n\nJob Family\n: IT Business Analysis\n\\n\nEOE including Disability/Protected Veterans. Flowserve will also not discriminate against an applicant or employee for inquiring about, discussing or disclosing their pay or, in certain circumstances, the pay of their co-workers. Pay Transparency Nondiscrimination Provision\n\\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request a reasonable accommodation if you are unable or limited in your ability to use or access flowservecareers.com as result of your disability. You can request a reasonable accommodation by sending an email to employment@flowserve.com. In order to quickly respond to your request, please use the words \"Accommodation Request\" as your subject line of your email. For more information, read the Accessibility Process.\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=c85a10d6e7a0cf00&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfmissbl03785n&spon=0&xkcb=SoBK67M3pvlEerygL50AbzkdCdPP&xfps=39d45104-4150-4db0-a401-6b3da7dc546c&vjfrom=vjs&asub=mob&astse=b26f5e8c443313fd&assa=5411"
}