{
  "filename": "data_analyst_New_York__NY_page2_job2_Data_Quality_Analyst__Workers_.html",
  "job_title": "Data Quality Analyst (Workers Comp Insurance)",
  "company": "PA Compensation Rating Bureau.",
  "location": "30 South 17th Street, Philadelphia, PA 19103",
  "salary": "$52,000 - $63,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:53:59.780Z",
  "full_description": "\\n\n\\n  The Data Quality Analyst reports to the Supervisor, Financial Data Reporting. In this role, they will analyze and edit Annual Financial Data Calls for Experience reported by carriers who write workers’ compensation insurance in Pennsylvania and Delaware. The financial data calls include historical reporting of various levels of premium, loss information and expense reporting by policy and calendar year for individual insurance carriers. The Data Quality Analyst will be responsible for identifying data outliers and anomalies and contacting carriers both orally and in writing regarding data submissions. They must have the ability to communicate data reporting issues and make sound decisions regarding their explanations. Duties of the role include; implementing the Financial Data Incentive Program; recommending, implementing, and testing modifications to the Financial Data Reporting Application and producing reports to assist in data verification. The Data Quality Analyst should possess strong problem solving, communication and organizational skills.\\n\nEssential Responsibilities\n:\n\\n\n\\n\nEdit all carrier FDM submissions. Analyze and evaluate premium, loss and expense reporting patterns and critically review carrier data submissions and comments for reasonability and accuracy. Make recommendations regarding the acceptance, use and/or modification of carrier data within summary reports.\n\\n\nIdentify data outliers and anomalies thru FDM edits and data comparisons to prior submissions and in relation to statewide data\n\\n\nMake recommendations regarding the acceptance, use and/or modification of carrier data within summary reports\n\\n\nContact carriers for data, corrections and/or clarification, diary follow-up contacts regarding data submission, produce status reports of carrier submissions\n\\n\nIdentify, analyze and interpret trends or patterns in various data sets such as Financial data, Unit Statistical data, Medical data and Indemnity data\n\\n\nParticipate in FDM user acceptance testing\n\\n\nTimely and consistent attendance\n\\n\n\\n\nRequirements\n:\n\\n\nEducation:\nBachelor’s Degree – B.A. / B.S. Mathematics or Sciences strongly preferred.\n\\n\nExperience:\nNone required. Successful completion of one actuarial exam or other insurance industry certification preferred.\n\\n\nSkills Required:\nStrong organizational, communication, written and analytical skills with the ability to work independently and adapt to various situations. Employee must possess the ability to manage multiple assignments and prioritize tasks accordingly. PC proficient in Microsoft Office Suite;\nadvanced\nknowledge of Excel is required (use of pivot tables, v-lookups, macros, create tables, formulas, charts, and graphs) and experience in Microsoft Word. Communicate effectively with all levels of personnel and outside contacts.\n\\n\nWork Hours\n:\n\\n\nNormal PCRB hybrid Flex time is available. Employee must be flexible when needed as projects or deadlines may sometimes necessitate extended hours.\n\\n\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}