{
  "filename": "data_analyst_New_York__NY_page9_job9_Warehouse_Mgmt__Systems__WMS__.html",
  "job_title": "Warehouse Mgmt. Systems (WMS) Analyst II",
  "company": "DHL",
  "location": "1 Commerce Dr, Cranbury, NJ 08512",
  "salary": "$55,000 - $90,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:19:17.182Z",
  "full_description": "\\n\nWMS Analyst II\n\\n\n\\n\nThe Operations Systems Analyst II role has a national salary range of $55,000 - $90,000.\n\\n\nFor roles within California the range is $68,640 - $90,000 and Washington is $77,969 - $90,000.\n\\n\nDHL Supply Chain offers multiple benefits including Medical, Dental, Vision, Prescription, Discounted Stock Purchase, and a generous PTO policy.\n\\n\n\\n\nAre you a tech-savvy problem solver with a passion for optimizing warehouse management systems? Do you love analyzing data and collaborating with cross-functional teams to deliver top-notch results? If you're nodding your head \"yes\" to these questions, then we want YOU!\n\\n\n\\n\nAs our WMS Analyst II, you'll be our go-to guru for implementing and maintaining warehouse management systems. You'll work with a dynamic team to analyze data, identify operational inefficiencies, and develop solutions to optimize our systems. You will have the opportunity to work with cutting-edge technology and contribute to the ongoing growth and success of our organization that will allow DHL Supply Chain to continue delivering excellence to our customers.\n\\n\n\\n\nRole Responsibilities\n\\n\n\\n\n\\n\nImplement and maintain warehouse management systems\n\\n\nCollaborate with cross-functional teams to ensure systems are optimized and meet the needs of the business\n\\n\nAnalyze and interpret data to increase system functionality and efficiency\n\\n\nTrain team members on the use of warehouse management systems\n\\n\nEnsure compliance with established policies and procedures\n\\n\nDevelop and maintain system documentation and reports\n\\n\nIdentify and address potential issues and risks\n\\n\nCreate and maintain dashboards using SQL\n\\n\n\\n\n\\n\nRequired Education and Experience\n\\n\n\\n\n\\n\nBachelors degree in IT similar field or equivalent experience, required\n\\n\n0-2 years analytics experience, required\n\\n\n\\n\n\\n\nOur organization has a business casual environment and focuses on teamwork, associate development, training, and continuous improvement. We offer competitive wages, excellent affordable insurance benefits (including health, dental, vision and life), 401K plan, paid vacation and holidays.\n\\n\n\\n\nOur organization is an equal opportunity employer.\n\\n\n#LI-Onsite\nBrand: DHL\nAddress: 1 Commerce Dr Cranbury, NJ - 08512\nProperty Description: 1267 - Cranbury NJ NERC\nProperty Number: 1267\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}