{
  "filename": "data_analyst_New_York__NY_page4_job11_Product_Analyst__Digital_Adver.html",
  "job_title": "Product Analyst (Digital Advertising)",
  "company": "Sensor Tower",
  "location": "New York, NY•Hybrid work",
  "salary": "$79,000 - $105,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:58:10.477Z",
  "full_description": "\\n\n\\n\nFraud warning:\n\\n\n\\n\n\\n  It's common for scammers to create positions that look legitimate on other sites. To ensure your submission is considered, only apply for positions at Sensor Tower through our company website or through posts directly associated with Sensor Tower company profiles on sites such as LinkedIn, Indeed, BuiltIn or Hackajob. At no point will Sensor Tower ever ask for money, credit card, or bank account information to complete a job application. Communications received from Sensor Tower are only sent by e-mail addresses ending in sensortower.com. All Sensor Tower interviews will be conducted via phone or Zoom. At no time will a conversation be moved to an alternative email outside of sensortower.com or text. Should an issue arise that you feel we should be aware of, please contact us. Please provide your resume when applying.\\n\n\\n\n\\n\n\\n\nTo all recruitment agencies:\n\\n\n\\n\n\\n  Sensor Tower does not accept third party resumes. Please do not send resumes to our jobs alias, Sensor Tower employees or any other organization location. Sensor Tower is not responsible for any fees related to unsolicited resumes. Sensor Tower will not pay any third-party agency or company that does not have a signed agreement with Sensor Tower.\\n\n\\n\n\\n\n\\n\nAbout this role:\n\\n\n\\n\n\\n\n\\n\nAs an Analyst dedicated to Sensor Tower’s Digital Advertising Products, you are responsible for representing the quality of our data and the underlying methodology both internally and externally. You will need to understand how our panel data is extrapolated to represent the population, address inquiries, identify opportunities to improve our projections, and estimate the impact of these improvements.\\n\n\\n\n\\n\n\\n\nSalary range: $79,000 - 105,000 USD\\n\n\\n\nWhat You Will Do\n\\n\n\\n\nIn this role, you’ll step into a highly impactful position where your insights will shape how clients and internal teams understand our industry-leading advertising data.\n\\n\nYou will become an expert in our advertising product data with a focus on Social Media and Mobile App advertising.\n\\n\nYou will support the organization by answering questions about our advertising product methodology and maintaining relevant internal documentation.\n\\n\nYou will support the Account Management team by investigating and internally responding to customer inquiries focused on the quality of our proprietary advertising dataset.\n\\n\nYou will continuously analyze our advertising data, looking for ways to improve the accuracy of our ad spend projections.\n\\n\nYou will collaborate closely with the Product team to influence improvements to our ad spend projection methodology.\n\\n\n\\n\nExperience We Would Like to See\n\\n\n\\n\nYou’ll thrive in this position if you bring curiosity, analytical rigor, and a passion for digital advertising innovation.\n\\n\nYou have a proven track record in analytics with a focus on digital advertising.\n\\n\nYou have experience working with advertising on mobile app ad networks.\n\\n\nYou have an entrepreneurial mindset with the ability to succeed in a fast-paced environment.\n\\n\nProficiency with SQL or Python.\n\\n\n\\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}