{
  "filename": "data_analyst_New_York__NY_page7_job2_PGIM_Fixed_Income___Analyst__D.html",
  "job_title": "PGIM Fixed Income - Analyst, Data Integrity",
  "company": "PGIM",
  "location": "Newark, NJ",
  "salary": "$90,000 - $105,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:12:06.082Z",
  "full_description": "\\n\n\\n  Job Classification:\\n\nTechnology - Risk & Governance\\n\n\\n\n\\n  PGIM Fixed Income - Analyst, Data Integrity\\n\n\\n\n\\n  The Data Quality analyst ensures the accurate, complete, consistent, and timely modeling of indicative and reference data, and analytic values for all products. The Data Quality focus specializes in supporting improvement and performance activities by providing measurement, data quality metrics, evaluation, and assessment services relating to data quality and data production. The analyst provides solutions and advice in process evaluations, performance monitoring, statistics, and the management and execution of data processing activities. Accountable for the completion of assigned tasks and projects. Fundamental understanding of specialized discipline.\\n\n\\n\n\\n  A GLOBAL FIRM WITH A DIVERSE & INCLUSIVE CULTURE\\n\n\\n\n\\n  As the Global Asset Management business of Prudential, we’re always looking for ways to improve financial services. We’re passionate about making a meaningful impact - touching the lives of millions and solving financial challenges in an ever-changing world.\\n\n\\n\n\\n  We also believe talent is key to achieving our vision and are intentional about building a culture on respect and collaboration. When you join PGIM, you’ll unlock a motivating and impactful career – all while growing your skills and advancing your profession at one of the world’s leading global asset managers!\\n\n\\n\n\\n\n\\n  If you’re not afraid to think differently and challenge the status quo, come and be a part of a dedicated team that’s investing in your future by shaping tomorrow today.\\n\n\\n\n\\n\n\\n  At PGIM, You Can!\\n\n\\n\n\\n\n\\n  What you will do\\n\n\\n\n\\n  The primary responsibility of the Analyst is to maintain the highest quality of indicative data, market pricing, and analytical values for fixed income securities in order to ensure a first-class risk management process. Analysts will develop expertise in a wide range of fixed income securities including, Treasury, Agency, MBS, CMBS, CMOs, ABS, Investment Grade Corporates, High Yield Corporates, Bank Loans, Emerging Markets Debt, Global Non-Dollar Securities, Derivatives, Municipals, and Money Market Instruments. The successful Analyst will effectively balance daily functions with numerous ad-hoc requests. These requests generally include portfolio, benchmark, peer, market, and economic data collection and analysis.\\n\n\\n\n\\n\n\\n  What you can expect\\n\n\\n\n\\n\nLearning and understanding in detail many different product types within the fixed income market as well as the different risk characteristics associated with each product\n\\n\nReviewing and verifying that fixed income securities are set up properly for trading and ongoing maintenance\n\\n\nInteracting closely with Portfolio Analysts in performing analysis on a security and portfolio level.\n\\n\nMonitoring and reviewing security updates that arrive from various data sources for accuracy\n\\n\nReviewing new sources of security master data, as well as collecting and reviewing manual sources of data, including prospectuses, private placement memorandums, offering memorandums, remittance reports and the broker dealer community\n\\n\nReviewing data integrity reports for missing data components and monitoring security master changes for accuracy\n\\n\nReview relevant Fixed Income indices for data and modeling accuracy.\n\\n\nResearching the impact of data and changes on the risk attributes of a security or portfolio\n\\n\nContributing as part of a team that will often consist of all levels of the Firm. Innovative ideas and input are expected and sought from everyone involved\n\\n\nStrong organizational skills, and ability to effectively communicate and collaborate with business, operations and technology teams\n\\n\nCollaborate with data governance related activities, including data quality focus, data dictionary maintenance, understanding data lineage, issue tracking and reporting, and data quality metrics\n\\n\n\\n\n\\n\n\\n  What you will bring\\n\n\\n\n\\n\nUndergraduate degree in Finance, Mathematics, Economics or related field of study\n\\n\n2+ years or more of fixed income experience, with proven knowledge of a product area and its processes\n\\n\nStrong ability to independently identify and resolve workflow issues or complex data problems\n\\n\nHigh attention to detail\n\\n\nUnderstands complex data structures and the implication of processes on other groups and downstream systems\n\\n\nWorks well as part of a team\n\\n\nEnjoys a fast-paced, high-intensity environment\n\\n\nPossesses excellent communication skills\n\\n\nPossesses excellent analytical and technical skills. Intermediate - Advanced Microsoft Excel skills are required. Familiarity with data visualization tools (Tableau, Power BI) is preferred.\n\\n\nProgramming experience in Visual Basic, SQL, and Python are a plus\n\\n\nExperience working with one or more of the following platforms Blackrock Aladdin, Bloomberg or Refinitiv Eikon\n\\n\nHas a passion for financial markets, products, and the investment management process\n\\n\nHas an entrepreneurial spirit that is willing to take on additional responsibility quickly\n\\n\n\\n\n\\n\n\\n\nPGIM welcomes all applicants, even if you don't meet every requirement. If your skills align with the role, we encourage you to apply.\n\\n\n\\n\n\\n\n\\n  Note: Prudential is required by state specific laws to include the salary range for this role when hiring a resident in applicable locations. The annual base salary range for this role is from $90,000 to $105,000. Specific pricing for the role may vary within the above range based on many factors including geographic location, candidate experience, and skills.\\n\n\\n\n\\n\n\\n  About PGIM Fixed Income\\n\n\\n\n\\n  PGIM Fixed Income is a global asset manager offering active solutions across all fixed income markets. With 1000+ employees and $862Bn assets under management as of March 2025, the company has offices in Newark, London, Letterkenny, Amsterdam, Munich, Paris, Sydney, Zurich, Tokyo, Hong Kong, and Singapore. Our business climate is a safe inclusive environment, centered around mutual respect, intellectual honesty, transparency, and teamwork. Our leaders are focused on talent & culture; dedicated to fostering growth & development at all levels to develop the industry leaders of tomorrow.\\n\n\\n\n\\n\n\\n  What we offer you:\\n\n\\n\n\\n\n\\n\n\\n\n\\n    Market competitive base salaries, with a yearly bonus potential at every level.\\n\n\\n\n\\n\n\\n    Medical, dental, vision, life insurance, disability insurance, Paid Time Off (PTO), and leave of absences, such as parental and military leave.\\n\n\\n\n\\n\n\\n    401(k) plan with company match (up to 4%).\\n\n\\n\n\\n\n\\n    Company-funded pension plan.\\n\n\\n\n\\n\n\\n    Wellness Programs including up to $1,600 a year for reimbursement of items purchased to support personal wellbeing needs.\\n\n\\n\n\\n\n\\n    Work/Life Resources to help support topics such as parenting, housing, senior care, finances, pets, legal matters, education, emotional and mental health, and career development.\\n\n\\n\n\\n\n\\n    Education Benefit to help finance traditional college enrollment toward obtaining an approved degree and many accredited certificate programs.\\n\n\\n\n\\n\n\\n    Employee Stock Purchase Plan: Shares can be purchased at 85% of the lower of two prices (Beginning or End of the purchase period), after one year of service.\\n\n\\n\n\\n\n\\n\n\\n  Eligibility to participate in a discretionary annual incentive program is subject to the rules governing the program, whereby an award, if any, depends on various factors including, without limitation, individual and organizational performance. To find out more about our Total Rewards package, visit \\n\n\\n   Work Life Balance | Prudential Careers.\\n\nSome of the above benefits may not apply to part-time employees scheduled to work less than 20 hours per week.\\n\n\\n\n\\n\n\\n\n\\n   Prudential Financial, Inc. of the United States is not affiliated with Prudential plc. which is headquartered in the United Kingdom.\\n\n\\n\n\\n\n\\n\n\\n\n\\n   Prudential is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, ancestry, sex, sexual orientation, gender identity, national origin, genetics, disability, marital status, age, veteran status, domestic partner status, medical condition or any other characteristic protected by law.\\n\n\\n\n\\n\n\\n\n\\n\n\\n   If you need an accommodation to complete the application process, please email \\n\n\\n    accommodations.hw@prudential.com\\n\n.\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nIf you are experiencing a technical issue with your application or an assessment, please email \\n\n\\n    careers.technicalsupport@prudential.com\\n\nto request assistance.\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=a898ae5b9c8210d0&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfo1hnsi8qp803&spon=0&xkcb=SoB667M3pv4J5G2EiJ0JbzkdCdPP&xfps=67ad18d8-24f1-472a-afeb-3ca60ef607ef&vjfrom=vjs&asub=mob&astse=0b623fdfc6ef3b82&assa=6428"
}