{
  "filename": "data_analyst_New_York__NY_page10_job9_EPMO_DATA_ANALYST.html",
  "job_title": "EPMO DATA ANALYST",
  "company": "HRA/DEPT OF SOCIAL SERVICES",
  "location": "4 World Trade Center, Manhattan, NY 10048",
  "salary": "$95,070 - $109,330 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:21:42.941Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nEPMO DATA ANALYST\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nHRA/DEPT OF SOCIAL SERVICES\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted On: 03/12/2025\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nFull-Time\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Location\\n\n\\n\n\\n          MANHATTAN\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nNo Exam Required\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n           Department\\n\n\\n\n\\n           Administrator/Commissioner-NM\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Salary Range:\\n\n\\n\n\\n          $95,070.00 – $109,330.00\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Description\n\\n\n\\n\n\\n\n\\n\n\\n      The Department of Social Services (DSS) is comprised of the administrative units of the New York City Human Resources Administration (HRA) and the Department of Homeless Services (DHS). HRA is dedicated to fighting poverty and income inequality by providing New Yorkers in need with essential benefits such as Food Assistance and Emergency Rental Assistance. DHS is committed to preventing and addressing homelessness in New York City by employing a variety of innovative strategies to help families and individuals successfully exit shelter and return to self-sufficiency as quickly as possible.\nThe Human Resources Administration (HRA) is the nation’s largest local government social services agency. HRA fights poverty and income inequality by administering more than 15 major public assistance programs, including Cash Assistance, the Supplemental Nutrition Assistance Program (SNAP), Medicaid, Domestic Violence Services, Home Care Services, Child Support Services, and numerous other critical support benefit programs and services. In administering these benefit programs, HRA assists over three million New Yorkers annually.\nThe Executive Project Management Office (EPMO) executes and implements the HRA Administrator’s and EPM’s agenda. This entails launching and managing new programs (e.g., the Emergency Rental Assistance Program or ERAP); supporting Information Technology (IT) initiatives through various services, including business analysis, project management, relationship management; prioritizing IT financial resources for HRA; securing Governance approval for new IT projects; coordinating business process improvement initiatives and overseeing the implementation of corrective actions; providing relationship management and escalation services on behalf of HRA clients and service providers with other city as well as state government entities; and coordinating cross-agency initiatives.\nThe Office of the Administrator / Executive Project Management Office (EPMO) is recruiting one (1) City Research Scientist III, to function as a EPMO Data Analysis, who will:\n\\n\n\\n\nCreate and implement data research program designed to monitor and enhance the integrity of the\n\\n\nagency’s landlord payment, and client records to facilitate timely shelter moveouts and housing\nstability for agency’s clients. Determine, develop, and maintain econometric models for the\nanalysis of the agency’s client and landlord populations in order to appraise the agency of\nchanging population characteristics to facilitate appropriate responses, maintain the integrity of\nagency and public records, improve the accuracy of payments, and minimize costs.\n\\n\n\\n\nPlan and develop statistical and research methodology for the studies related to the City’s\n\\n\necosystem of landlords, their agents, and building addresses, in conjunction with the study and\nanalysis of the agency’s client population, in order to assess the impact on relationships to the\nagency’s cash assistance and rental subsidy populations to facilitate and improve how landlords\nand clients interact with DSS/DHS/HRA. Review findings and determines the preparation of policy\noptions, including developing and implementing relevant corrective actions.\n\\n\n\\n\nDevelop data mining, research, statistical, analytic, and programming techniques to enhance\n\\n\ndata and payment accuracy. Leverage findings and best practices to optimize the design of the\nmajor systems used by DSS/DHS/HRA, including CurRent and POS.\n\\n\n\\n\nProvide leadership, general direction, and technical guidance to agency personnel, including the\n\\n\nLandlord Management Unit and design teams, in the utilization of large and complicated data sets\nand systems for addressing complex and high-profile cases as well as enhancing systems design.\nUse ad-hoc queries to achieve objectives.\n\\n\n\\n\nIdentify and secure access to internal and external systems relevant to the integrity of landlord,\n\\n\npayee, and client data. Develop a repository for the relevant data sets and analyses results. Design\nappropriate scripts and mining methods necessary to leverage this data effectively in furtherance of\nagency and City objectives.\n\\n\n\\n\nTrack, document, research, and address systematic issues affecting data integrity. In collaboration\n\\n\nwith DSS ITS, develops and proposes enhancements to the back-end design of the relevant agency\nsystems of record to address and minimize the recurrence of these issues. Provide landlord data\nexpertise and guidance to other programs and partners.\n\\n\n\\n\nConduct literature reviews and determines research priorities for studies and special projects\n\\n\nrequested by the Commissioner and executive staff. Applies advanced econometric techniques\nand computer simulation models to perform highly quantitative and qualitative assessment and\nanalysis of key agency-related service populations.\nWork Location: 4 World Trade Center, 42nd Floor, NYC\nHours/Schedule: Normal Business Hours\nCITY RESEARCH SCIENTIST - 21744\\n\n\\n\nMinimum Qualifications\n\\n\n1. For Assignment Level I (only physical, biological and environmental sciences and public health) A master's degree from an accredited college or university with a specialization in an appropriate field of physical, biological or environmental science or in public health.\nTo be appointed to Assignment Level II and above, candidates must have:\n1. A doctorate degree from an accredited college or university with specialization in an appropriate field of physical, biological, environmental or social science and one year of full-time experience in a responsible supervisory, administrative or research capacity in the appropriate field of specialization; or\n2. A master's degree from an accredited college or university with specialization in an appropriate field of physical, biological, environmental or social science and three years of responsible full-time research experience in the appropriate field of specialization; or\n3. Education and/or experience which is equivalent to \"1\" or \"2\" above. However, all candidates must have at least a master's degree in an appropriate field of specialization and at least two years of experience described in \"2\" above. Two years as a City Research Scientist Level I can be substituted for the experience required in \"1\" and \"2\" above.\nNOTE:\nProbationary Period\nAppointments to this position are subject to a minimum probationary period of one year.\n\\n\nPreferred Skills\n- Excellent organizational skills with the ability to work independently, follow through, and manage multiple projects simultaneously. - Excellent verbal, written, interpretive, analytical, and interpersonal communication skills. - Experience extracting, manipulating, and analyzing data from various data bases and in large datasets. - Experience with Business Intelligence applications, including Cognos and Oracle OBIEE. - Advanced knowledge of Microsoft Excel, Project, Visio, SharePoint, and Access. - Knowledge of modern statistical methods. - Experience in implementing and supporting change management practices and the systems development life cycle.\n\\n\nPublic Service Loan Forgiveness\nAs a prospective employee of the City of New York, you may be eligible for federal loan forgiveness programs and state repayment assistance programs. For more information, please visit the U.S. Department of Education’s website at https://studentaid.gov/pslf/.\n\\n\nResidency Requirement\nNew York City residency is generally required within 90 days of appointment. However, City Employees in certain titles who have worked for the City for 2 continuous years may also be eligible to reside in Nassau, Suffolk, Putnam, Westchester, Rockland, or Orange County. To determine if the residency requirement applies to you, please discuss with the agency representative at the time of interview.\n\\n\nAdditional Information\n\\n\n\\n\nThe City of New York is an inclusive equal opportunity employer committed to recruiting and retaining a diverse workforce and providing a work environment that is free from discrimination and harassment based upon any legally protected status or protected characteristic, including but not limited to an individual's sex, race, color, ethnicity, national origin, age, religion, disability, sexual orientation, veteran status, gender identity, or pregnancy.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSave\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n        Job ID\\n\n\\n\n\\n        706558\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Posted until\\n\n\\n\n\\n         02/17/2026\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title code\\n\n\\n\n\\n         21744\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Civil service title\\n\n\\n\n\\n         CITY RESEARCH SCIENTIST\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Title classification\\n\n\\n\n\\n         Non-Competitive-5\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Business title\\n\n\\n\n\\n         EPMO DATA ANALYST\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Experience Level:\\n\nExperienced (Non-Manager)\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Job level\\n\n\\n\n\\n         03\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Number of positions\\n\n\\n\n\\n         1\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Work location\\n\n\\n\n\\n         4 World Trade Center\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n          Category:\\n\nPolicy, Research & Analysis\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n      EPMO DATA ANALYST\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=028154bbc2621f92&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoj3k62dir088&spon=0&xkcb=SoBc67M3pv5DoOyJaB0CbzkdCdPP&xfps=1c5203bb-d9c5-4b11-a98d-69d73fe549fd&vjfrom=vjs&asub=mob&astse=56addc5012fc201c&assa=3368"
}