{
  "filename": "data_analyst_Houston__TX_page1_job13_Frac_Data_Analyst.html",
  "job_title": "Frac Data Analyst",
  "company": "Corva",
  "location": "Houston, TX 77043",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:44:54.441Z",
  "full_description": "\\n\n\\n\nAbout Corva\n\\n\n\\n\n\\n  Corva has built a first-of-its-kind energy app store on a bedrock of best-in-class technologies, data pipelines, and a secure and scalable architecture. Our energy solutions solve today's toughest well delivery challenges, from well design through drillout. The ever-evolving platform is not only future-proof for digitizing operations but is your toolkit to accelerate sustainability and energy transition goals. Our platform is built for speed and reliability and delivers unmatched features and capabilities.\\n\n\\n\n\\n\n\\n\nCorva is powering worldwide innovation by driving efficiency, productivity, and profitability with our innovative energy solutions.\\n\n\\n\n\\n\n\\n\nMission\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nCorva’s mission is to accelerate the future of energy.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nValues\n\\n\n\\n\n\\n\n\\n\nBoldness\n:\nCorvanauts have the confidence and courage to question status quo for the products we make and the relationships we cultivate.\n\\n\n\\n\n\\n\nOwn End-to-End\n:\nWe take ownership of what we start and see it through to completion through trust and dependability.\n\\n\n\\n\n\\n\nTransparency\n:\nIt's crucial to be open and honest and consistent with updates and data flow with customers and colleagues. We value the free-flowing of information and data to make better decisions.\n\\n\n\\n\n\\n\nBias Action\n:\nCorvanauts don't sit still - our default mode is taking action! We make progress through high-quality iterations. Failure is built into the process and success is defined by the number of shots on goal.\n\\n\n\\n\nAbout the role\n\\n\n\\n\nWe are seeking Completions Analysts located in Houston to provide part of the 24/7 operational support for the Corva system. The Analyst ensures that each well on Corva is ready for our customers to make real-time completions decisions has a laser focus on accuracy and timeliness. The Analyst supports customers via phone and email support and proactively QCs all data and visuals on Corva.\n\\n\n\\n\nWhat you'll do\n\\n\n\\n\nEnter data of various types into the web-based system in a timely manner\n\\n\nIdentify various types of data quality issues through regular QAQC checks and follow procedures to correct issues\n\\n\nCommunicate with customers to resolve issues as needed\n\\n\nBuild customer dashboards and support customers building their own dashboards\n\\n\nAbility to work remotely as needed\n\\n\nReview data and trends to ensure accuracy and completeness\n\\n\nEnsure all work is prioritized and completed correctly\n\\n\nIdentify anomalies and problematic data\n\\n\nFollow communication protocols for various customers to resolve issues\n\\n\nPrepare written reports daily regarding operations and QAQC status\n\\n\nEnsure proper operation of the web-based system through continuous checks\n\\n\nProvide testing of staged systems prior to deployment onto production\n\\n\nIdentify and communicate opportunities to improve efficiencies in operations\n\\n\nDevelop operational procedures as needed\n\\n\nOther duties as required\n\\n\n\\n\nQualifications\n\\n\n\\n\nKnowledge of completions systems data, including interpretation of frac and wireline data\n\\n\nAbility to work nights and weekends in a rotation (Schedule is 7 days on/7 days off, 12 hour shifts, alternate nights/days)\n\\n\nAbility to enter accurate data and prioritize workload\n\\n\nExcellent written and verbal communication skills\n\\n\nAbility to work well with teams\n\\n\nThorough knowledge of navigating modern web sites\n\\n\nAnalytical thinking skills\n\\n\nAbility to identify anomalies and problem data\n\\n\nAbility to train others and collaborate with others in a positive and effective manner\n\\n\nField/RTO experience\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}