{
  "filename": "data_analyst_New_York__NY_page1_job2_Entry_Level__Quality_Analyst__.html",
  "job_title": "Entry Level: Quality Analyst/ Business Analyst",
  "company": "NS IT Solutions LLC",
  "location": "Jersey City, NJ 07305",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:51:07.016Z",
  "full_description": "\\n\nCompany Description\n\\n\nNSIT Solutions is a premier technology savvy company providing onsite, offsite, offshore services to our clients. NS IT Solutions is the link between business and technology, offering a wide range of software services to clients. We provide objective business advice of uncommon clarity that helps clients achieve market-leading results by channeling knowledge and value, coupled with our commitment to quality software services.\nJob Description\n\\n\nThis position is responsible for the following functions:\n\\n\n\\n\nCreate ETL Testing and Performance Test Scenarios\n\\n\nImplement test data scenarios/scripts for integration and regression testing\n\\n\nBuild/customize test automation scripts\n\\n\nExecute Test Scenarios and Document Issues & Defects\n\\n\nSet up test scripts and test data\n\\n\nExecute ETL Testing and transformation processes\n\\n\nIdentify the defect and trouble shoot issues\n\\n\nSupport application Test Development and Execution\n\\n\nWork with business owner to identify application test cases\n\\n\nSupport Application test development and execution\n\\n\n\\n\n\\n\nMinimum Requirements:\n\\n\n\\n\nExperience participating in a significant QA effort preferably specific to data integration testing.\n\\n\nData warehouse concepts and querying including the ability to understand SQL and write moderately complex SQL queries.\n\\n\nAbility to optimize data, taking complex sets of data and managing them via filters, calculations, and visually compelling graphical user interface.\n\\n\nAbility to effectively troubleshoot reporting and data issues across the multi-tier environment such as user interface, semantic layer and database.\n\\n\nAbility to work in a self-directed environment and clearly communicate tasks to team members and the ability to follow up and oversee other associates\n\\n\n\\n\n\\n\nThe primary duties of the Business Analyst will include:-\n\\n\n\\n\nThe main responsibility of the role is to review, interpret, analyse and clarify client requirements.\n\\n\nGenerate various types of Business and Technical document(s) to satisfy client requirements.\n\\n\nRun test cases and report issues to the test manager.\n\\n\nGather findings and provide relevant supporting documentation.\n\\n\nWork closely with internal stakeholders to build and maintain strong relationships.\n\\n\nTest preparation, including design of test cases.\n\\n\nUnderstand current and desired state business processes.\n\\n\nAnalytical thinking and project issue resolution.\n\\n\nBuild structured approaches for decision making.\n\\n\nProvide innovative technology solutions to support the business.\n\\n\nQualifications\n\\n\n\\n\n\\n\nCollege degree( Bachelor's/ Master's)\n\\n\nExcellent writing/documentation, communication, analysis and organizational skills required\n\\n\nStrong aptitude in both business and technology\n\\n\nSelf-starter with excellent organizational and time management skills\n\\n\n\\n\nAdditional Information\n\\n\n\\n\nAll your information will be kept confidential according to EEO guidelines.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}