{
  "filename": "data_analyst_New_York__NY_page4_job1_Data_Analyst_Jr_Data_Scientist.html",
  "job_title": "Data Analyst/Jr Data Scientist",
  "company": "TechLine",
  "location": "Huntington, NY 11743",
  "salary": "$110,000 - $150,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:57:08.969Z",
  "full_description": "Job Overview\nWe are seeking a highly motivated Data Analyst / Jr Data Scientist to join our innovative analytics team. This role offers an exciting opportunity to work with large-scale data sets, develop machine learning models, and contribute to impactful data-driven solutions. The ideal candidate will have a strong foundation in data analysis, machine learning frameworks, and cloud-based platforms such as AWS. You will collaborate across departments to extract insights, optimize processes, and support strategic decision-making through advanced analytics and AI techniques.\n\\n\nResponsibilities\n\\n\n\\n\nDevelop and implement machine learning models using frameworks such as TensorFlow, Spark MLlib, and other relevant tools.\n\\n\nPerform data mining, cleaning, and transformation using ETL tools like Talend and scripting languages such as Python, Bash (Unix shell), and VBA.\n\\n\nDesign and optimize database schemas for efficient data storage and retrieval; utilize SQL for querying large datasets.\n\\n\nConduct exploratory data analysis and visualize insights using tools like Looker or similar BI platforms.\n\\n\nApply unsupervised learning techniques and natural language processing (NLP) to extract meaningful patterns from unstructured data sources.\n\\n\nCollaborate on model training, validation, deployment, and monitoring in cloud environments such as AWS.\n\\n\nWork with big data technologies including Hadoop, Spark, and Kafka to manage high-volume datasets.\n\\n\nIntegrate linked data sources for comprehensive analysis and support database design initiatives.\n\\n\nUtilize statistical tools such as SAS or R for advanced analytics and predictive modeling.\n\\n\nContribute to the development of AI solutions leveraging quantum engineering principles where applicable.\n\\n\nSupport the deployment of models into production environments ensuring scalability and robustness.\n\\n\n\\n\nQualifications\n\\n\n\\n\nBachelor’s degree in Computer Science, Data Science, Engineering, or a related field; advanced degrees preferred.\n\\n\nProven experience with Python, R, SQL, Java, C, or similar programming languages.\n\\n\nStrong understanding of machine learning algorithms including supervised and unsupervised learning techniques.\n\\n\nHands-on experience with machine learning frameworks such as TensorFlow or similar platforms.\n\\n\nFamiliarity with big data ecosystems including Hadoop, Spark, Kafka, and related tools.\n\\n\nKnowledge of cloud services like AWS for model deployment and scalable data processing.\n\\n\nExperience with ETL processes using Talend or equivalent tools.\n\\n\nProficiency in database design principles and query optimization.\n\\n\nKnowledge of natural language processing (NLP), AI concepts, and linked data integration is a plus.\n\\n\nAbility to analyze complex datasets to derive actionable insights through analytics tools like Looker or comparable BI software.\n\\n\nStrong problem-solving skills with an emphasis on innovative thinking in quantum engineering applications is advantageous. This position provides an excellent platform for individuals passionate about leveraging cutting-edge technologies to solve real-world problems through data science and analytics innovations.\n\\n\n\\n\nJob Type: Full-time\n\\n\nPay: $110,000.00 - $150,000.00 per year\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}