{
  "filename": "data_analyst_New_York__NY_page1_job11_Administrative_Data_Analyst.html",
  "job_title": "Administrative Data Analyst",
  "company": "State of New York",
  "location": "New York, NY 10004•Hybrid work",
  "salary": "$40 - $55 an hour",
  "job_type": null,
  "scraped_at": "2025-12-27T10:53:06.478Z",
  "full_description": "Duration:\n24 Months contract with possible extension\n\\n\nJob Description and Required Services:\n\\n\n\\n\nThe position of Administrative Assistant in the Community Development Unit of Consumer Examinations Unit, Consumer Protection and Financial Enforcement Division, will support the work of CDU by assisting with the following: • Review and analysis of branch opening, closing, and relocation applications• Review and analysis of bank mergers, conversions, field of membership expansions, and change of control• Review and analysis of Banking Development District (BDD) Program requests for renewal of deposit applications• Review and analysis of BDD Progress Report forms• Assistance with data analysis, mainly socioeconomic data, and data analysis for geocoding purposes• Other related duties as needed\n\\n\n\\n\nMinimum Candidate Qualifications:\n\\n\n\\n\nBachelor’s Degree\nin business administration, economics, geography, political science, public administration, sociology, urban planning, or related discipline.\n\\n\n\\n\nAt least one year of experience\nin\ncommunity development, economic development, or constituent services, in either the public or nonprofit sectors.\nAt least one year of experience in report writing, and review and analysis of reports, applications, etc., measuring public impact.\n\\n\nSkill Requirements:\n\\n\n\\n\nHighly organized and careful worker, highly self-motivated and capable of prioritizing and managing multiple tasks.\n\\n\nStrong writing skills.\n\\n\nStrong working knowledge of Microsoft Office suite products.\n\\n\n\\n\nJob Type: Contract\n\\n\nPay: $40.00 - $55.00 per hour\n\\n\nWork Location: Hybrid remote in New York, NY 10004",
  "apply_method": "indeed_apply",
  "apply_url": null
}