{
  "filename": "data_analyst_New_York__NY_page10_job12_Business_Manager__Analyst_Asso.html",
  "job_title": "Business Manager, Analyst/Associate",
  "company": "Sumitomo Mitsui Banking Corporation",
  "location": "New York, NY 10172•Hybrid work",
  "salary": "$68,000 - $130,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:22:13.633Z",
  "full_description": "\\n\nSMBC Group is a top-tier global financial group. Headquartered in Tokyo and with a 400-year history, SMBC Group offers a diverse range of financial services, including banking, leasing, securities, credit cards, and consumer finance. The Group has more than 130 offices and 80,000 employees worldwide in nearly 40 countries. Sumitomo Mitsui Financial Group, Inc. (SMFG) is the holding company of SMBC Group, which is one of the three largest banking groups in Japan. SMFG’s shares trade on the Tokyo, Nagoya, and New York (NYSE: SMFG) stock exchanges.\n\\n\n\\n\nIn the Americas, SMBC Group has a presence in the US, Canada, Mexico, Brazil, Chile, Colombia, and Peru. Backed by the capital strength of SMBC Group and the value of its relationships in Asia, the Group offers a range of commercial and investment banking services to its corporate, institutional, and municipal clients. It connects a diverse client base to local markets and the organization’s extensive global network. The Group’s operating companies in the Americas include Sumitomo Mitsui Banking Corp. (SMBC), SMBC Nikko Securities America, Inc., SMBC Capital Markets, Inc., SMBC MANUBANK, JRI America, Inc., SMBC Leasing and Finance, Inc., Banco Sumitomo Mitsui Brasileiro S.A., and Sumitomo Mitsui Finance and Leasing Co., Ltd.\n\\n\n\\n\nThe anticipated salary range for this role is between $68,000.00 and $130,000.00. The specific salary offered to an applicant will be based on their individual qualifications, experiences, and an analysis of the current compensation paid in their geography and the market for similar roles at the time of hire. The role may also be eligible for an annual discretionary incentive award. In addition to cash compensation, SMBC offers a competitive portfolio of benefits to its employees.\n\\n\n\\n\n\\n\n\\n\nRole Description\n\\n\n\\n\n\\n\nThe Front Office Business Management team supports the Coverage Capital Markets and Structured Debt Businesses (Corporate & Investment Banking). We are looking to hire a new Front Office Business Manager. A successful hire will:\n\\n\n\\n\nSupport and oversee Front Office projects and strategic initiatives to drive change and implement business priorities\n\\n\nSupport Front Office management by producing management presentations detailing business performance and strategic initiatives\n\\n\nDrive strategic analytics and client analytics to support business decision making. Develop timely, accurate, and insightful analyses, metrics, and forecasts to support strategic decision making\n\\n\nPrepare materials to deliver business unit message to Front Office management and Sales and Trading Leadership supporting growth initiatives\n\\n\nLead the preparation of detailed budgets and forecasts\n\\n\nContribute to driving front office banker productivity through driving operational efficiencies, driving technology changes, implementing tools or through process efficiencies\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nRole Objectives\n\\n\n\\n\n\\n\n\\n\nProvide recommendations to management to drive business results and achieve financial goals\n\\n\nLead work streams, and contribute to projects, that deliver front office efficiencies\n\\n\nPrepare and deliver compelling and visually effective financial presentations\n\\n\nTrack and analyze the business unit’s competitive position in deal volumes, market share and fees using industry standard tools and internal / external data\n\\n\nPerform ad hoc analysis and presentation based on current trends and initiatives for each department of the Front Office\n\\n\nInteract directly with bankers on performance metrics and pipeline\n\\n\nAnalyze client and industry profitability and competitor analyses\n\\n\nDeliver weekly, monthly, and quarterly performance metrics to business unit leadership\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nQualifications and Skills\n\\n\n\\n\n\\n\n\\n\nUndergraduate degree in Finance, Business Administration, or related fields\n\\n\nPreferably 1-2 years in Investment Banking or management consulting\n\\n\nStrong excel skills and experience in data analysis, production of reporting materials, and strong presentation and PowerPoint skills\n\\n\nStrong organizational, oral, and written communication skills, with ability to communicate effectively with all levels of risk, support, and business partners\n\\n\nProficiency with Word, Excel, and PowerPoint, along with ability to quickly learn new programs and applications\n\\n\n\\n\n\\n\n\\n\n\\n\nSMBC’s employees participate in a Hybrid workforce model that provides employees with an opportunity to work from home, as well as, from an SMBC office. SMBC requires that employees live within a reasonable commuting distance of their office location. Prospective candidates will learn more about their specific hybrid work schedule during their interview process. Hybrid work may not be permitted for certain roles, including, for example, certain FINRA-registered roles for which in-office attendance for the entire workweek is required.\n\\n\n\\n\nSMBC provides reasonable accommodations during candidacy for applicants with disabilities consistent with applicable federal, state, and local law. If you need a reasonable accommodation during the application process, please let us know at accommodations@smbcgroup.com.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=c07713ea0365e5a0&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoj3k62dir088&spon=0&xkcb=SoD767M3pv5DoOyJaB0HbzkdCdPP&xfps=e2f36b24-00a7-4e62-81b1-227b59e80913&vjfrom=vjs&asub=mob&astse=2d04616ba1ca44ee&assa=4063"
}