{
  "filename": "data_analyst_Houston__TX_page2_job3_IT_Business_Analyst.html",
  "job_title": "IT Business Analyst",
  "company": "MHK Tech Inc.",
  "location": "Houston, TX•Hybrid work",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:45:36.694Z",
  "full_description": "\\n\nIT Business Analyst\n\\n\nLocations:- Charlotte, NC and Addison, TX ( Not more than 45 miles)\n\\n\nVisa : W2 Candidates only\n\\n\nHybrid/ Onsite: Hybrid\n\\n\n\\n\nNote: Hiring manager is looking for some Business analyst with Cybersecurity and banking experience\n\\n\n\\n\n\\n  The Technical BA will work with business partners to elicit requirements that will enable the development team to design capabilities and functions to meet business needs. This includes refinement of requirement artifacts including Process flows, Capability requirements, etc. The Technical BA will facilitate discussions between the business partners and the development team to help address requirement questions, and will document Requirements, use cases, assumptions, Process flows and any other notes that come out of these discussions.\nResponsibilities:\n\\n\n\\n\nWork closely with business partners to elicit requirements, document process flows, identify risks and mitigation; and with System Engineers/Developers to create functional requirement documents and to participate in the definition of strategies for the technical solution.\n\\n\nGather and catalog functional, non-functional, and technical requirements of stakeholder requests.\n\\n\nProvide subject matter expertise within the business/technical domain to support scope and requirement decisions.\n\\n\nAssist users and development teams in application testing and troubleshooting and may help with test planning and configuring test solutions to validate functional and system needs.\n\\n\nProvide Level 1 2 support to end users as needed.\n\\n\nCreate, maintain and present training materials for end-users.\n\\n\nRole Based Competencies:\n\\n\n\\n\nExcellent communication skills, both oral and written, and ability to facilitate discussions\n\\n\nExcellent documentation skills and experience with creating business process flows, Use case diagrams, functional requirements\n\\n\nAbility to analyze existing capabilities and identify gaps and opportunities\n\\n\nSelf-motivated and requires minimal supervision\n\\n\nGood problem solving and conflict resolution skills\n\\n\nProficient in designing, developing and executing test cases; Knowledge of test automation and tools.\n\\n\nAgile experience\n\\n\nExperience in Cybersecurity a plus\n\\n\nTechnical skills are a plus\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=7ee00b779e06818f&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfmissbl03785n&spon=0&xkcb=SoAt67M3pvlEerygL50IbzkdCdPP&xfps=023fea79-6859-407b-8b3e-fde54f5c45ea&vjfrom=vjs&asub=mob&astse=1bda0881fe22bbd4&assa=6933"
}