{
  "filename": "data_analyst_New_York__NY_page8_job8_Mental_Health_Data_Analyst__Co.html",
  "job_title": "Mental Health Data Analyst, Correctional Health Services",
  "company": "NYC Health + Hospitals",
  "location": "New York, NY",
  "salary": "$65,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:16:42.656Z",
  "full_description": "\\n\n\\n\n\\n\nAbout NYC Health + Hospitals\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nNYC Health + Hospitals is the largest public health care system in the nation. We are a network of 11 hospitals, trauma centers, neighborhood health centers, nursing homes, post-acute care centers, and correctional health services. We are a home care agency and a health plan, MetroPlus. Our health system provides essential services to 1.4 million New Yorkers every year in more than 70 locations across the city's five boroughs. Our diverse workforce of more than 42,000 employees are uniquely focused on empowering New Yorkers.\n\\n\nNYC Health + Hospitals/Correctional Health Services is one of the nation’s leading correctional health care systems in quality of and innovations to care, and access from pre-arraignment through compassionate release. In-jail services include medical, nursing, mental health, substance use treatment, social work, dental and vision care, discharge planning, and reentry support. In addition to providing direct patient care in the jails, CHS leverages the resources of the nation’s largest municipal health care system to help discharged patients successfully return to their communities. CHS is also a pivotal partner in New York City’s criminal justice reform efforts.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nWork Shifts\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nTime: 9a-5p\n\\n\nDays: Mon-Fri\n\\n\nFacility: Trailer 1 on Rikers Island\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDuties & Responsibilities\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nThis full-time position reports to the Director of Mental Health Data Management or designee. The Mental Health Data Analyst will function as a part of the Correctional Health Service (CHS) Mental Health Data and Quality Improvement team in the mental health service. Under supervision, the analyst will collect and analyze data for mental health programs, quality improvement projects, and outcomes in the CHS mental health service.\n\\n\n\\n\nResponsibilities include:\n\\n\n\\n\nCollaborate in implementing new, and revising existing, quality improvement projects.\n\\n\nAssist with data projects related to specialized Mental Health programs, interventions, and housing areas.\n\\n\nMaintain tracking systems to monitor patient outcomes.\n\\n\nCollaborate and disseminate mental health service dashboards (e.g., census and level of care-related, self-injury, mental health intake, missed mental health encounters, etc.)\n\\n\nProduce and disseminate regular reports on clinical Mental Health encounters related to volume, productivity, timeliness, and other metrics.\n\\n\nCoordinate with CHS IT to build reports that query CHS and DOC data sources to meet operational and quality improvement needs of the Mental Health service.\n\\n\nLiaise between Mental Health service and CHS IT, Health Informatics, and other CHS departments to meet internal and external reporting obligations\n\\n\nAdditional data tasks and projects as requested by Mental Health or other CHS leadership.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nMinimum Qualifications\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n1. A Baccalaureate Degree from an accredited college or university in Business Administration, Engineering, Social Sciences, Health Care Specialization, Physical Sciences or related programs; and,\nA minimum of two years responsible experience directly related to health care program planning, research, design, operation, evaluation and analysis; or,\n2. A Masters Degree from an accredited college or university in Public Health, Public or Hospital Administration, Health Care Specialization, Business Administration or related disciplines; and,\nA minimum of one year experience directly related to health care program planning, research, design, operation, evaluation and analysis; or,\n3. A satisfactory equivalent combination of training, education and experience; and,\n4. Demonstrated skills in written or oral communication.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nDepartment Preferences\n\\n\n\\n\n\\n\n\\n\n\\n\nMaster’s Degree in Public Health, or related degree with a concentration on quantitative analysis\n\\n\nStrong data/statistical analysis and data management skills;\n\\n\nAdvanced knowledge of Windows and Microsoft Office Suite and familiarity with standard statistical software packages (e.g., SAS);\n\\n\nInterest in public health, mental health, and/or correctional healthcare;\n\\n\nExcellent interpersonal communication skills and ability to work collaboratively with other disciplines;\n\\n\nStrong organizational and multitasking abilities.\n\\n\n\\n\n\\n\nQualification Preferences:\n\\n\n\\n\nEducation\n\\n\nA Master's Degree from an accredited college or university in Public Health, or an approved related program and seven years of progressively responsible experience in planning, inter-organizational relationships, or related administrative or managerial functions; or,\n\\n\nA Baccalaureate Degree from an accredited college or university and eight years of progressively responsible experience in health and medical service administration, public administration, personnel and labor relations, finance or appropriate functional discipline with an emphasis on planning, liaison and inter-organizational relationships, or related administrative or managerial functions; or,\n\\n\nA satisfactory equivalent combination of education, training and experience.\n\\n\nExperience\n\\n\nAt least two years of experience working in a data management capacity\n\\n\nExperience successfully managing data projects in a healthcare setting\n\\n\nStrong interpersonal, management, analytical, and organizational skills\n\\n\n\\n\n3. An equivalent and satisfactory combination of education and experience may be considered\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nBenefits\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nNYC Health and Hospitals offers a competitive benefits package that includes:\n\\n\n\\n\nComprehensive Health Benefits for employees hired to work 20+ hrs. per week\n\\n\nRetirement Savings and Pension Plans\n\\n\nPaid Holidays and Vacation in accordance with employees' Collectively bargained contracts\n\\n\nLoan Forgiveness Programs for eligible employees\n\\n\nCollege tuition discounts and professional development opportunities\n\\n\nCollege Savings Program\n\\n\nUnion Benefits for eligible titles\n\\n\nMultiple employee discounts programs\n\\n\nCommuter Benefits Programs\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nHow To Apply\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nIf you wish to apply for this position, please apply online by clicking the \"Apply for Job\" button.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=fc14c8892b9229d9&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoa4c0i8qp87r&spon=0&xkcb=SoA-67M3pv4nSMACJ70CbzkdCdPP&xfps=a142f9b2-7f66-45f6-9f95-50885d754f29&vjfrom=vjs&asub=mob&astse=e23576b81928f823&assa=3045"
}