{
  "filename": "data_analyst_New_York__NY_page6_job10_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "Rutgers University",
  "location": "Piscataway, NJ",
  "salary": "$30 - $40 an hour",
  "job_type": null,
  "scraped_at": "2025-12-27T11:02:11.137Z",
  "full_description": "\\n\n\\n\nPosition Details\n\\n\n\\n\n\\n\n\\n     Position Information\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nRecruitment/Posting Title\n\\n\n\\n\n\\n        Data Analyst\\n\n\\n\n\\n\n\\n\n\\n\nPosting Number\n\\n\n\\n\n\\n        25TM0202\\n\n\\n\n\\n\n\\n\n\\n\nDepartment\n\\n\n\\n\n\\n        Engn- Ctr Adv Infrastructure\\n\n\\n\n\\n\n\\n\n\\n\nOverview\n\\n\n\\n\n\\n\n\\n         Rutgers, The State University of New Jersey, is a leading national research university and the State of New Jersey’s preeminent, comprehensive public institution of higher education. As one of the largest employers in the State of New Jersey, Rutgers University is committed not only to the students and the State that we serve, but also to the faculty and staff who work on our campuses.\n\\n\n\\n\n\\n         For two consecutive years, Rutgers is ranked on Forbes’ list of America’s Best Large Employers. Rutgers holds #64 of 500 employers and is the #1 New Jersey employer on the publication’s 2023 list. Rutgers’ commitment to its employees includes maintaining and fostering a safe, diverse, and respectful workplace environment, creating employment opportunities for our nation’s military veterans, and ensuring accessibility and accommodation for individuals with disabilities.\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPosting Summary\n\\n\n\\n\n\\n\n\\n         Rutgers, The State University of New Jersey is seeking a Data Analyst for the School of Engineering.\nAmong the key duties of the position are the following:\\n\n\\n\n\\n\nFacility modeling with 3D imaging data and building information modeling tools.\n\\n\nGeospatial data processing.\n\\n\nLidar data collection and processing.\n\\n\nWorks on developing, building information models from laser scan data, writing model specifications, and collaborates with other researchers on tasks related to crowd simulation and exploration of what-if scenarios.\n\\n\nWrites progress reports, makes presentations, and sometimes travels to collect data.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nFLSA\n\\n\n\\n\n\\n        Nonexempt\\n\n\\n\n\\n\n\\n\n\\n\nSalary Details\n\\n\n\\n\n\\n        $30 - $40/hourly\\n\n\\n\n\\n\n\\n\n\\n\nOffer Information\n\\n\n\\n\n\\n        The final salary offer may be determined by several factors, including, but not limited to, the candidate’s qualifications, experience, and expertise, and availability of department or grant funds to support the position. We also take into consideration market benchmarks, if and when appropriate, and internal equity to ensure fair compensation relative to the university’s broader compensation structure. We are committed to offering competitive and flexible compensation packages to attract and retain top talent.\\n\n\\n\n\\n\n\\n\n\\n\nBenefits\n\\n\n\\n\n\\n\n\\n         Rutgers offers a comprehensive benefits package to eligible employees, based on position, which includes:\\n\n\\n\n\\n\nMedical, prescription drug, and dental coverage\n\\n\nPaid vacation, holidays, and various leave programs\n\\n\nCompetitive retirement benefits, including defined contribution plans and voluntary tax-deferred savings options\n\\n\nEmployee and dependent educational benefits\n\\n\nLife insurance coverage\n\\n\nEmployee discounts programs\n\\n\n\\n\n\\n\n\\n\n\\n         For detailed information on benefits and eligibility, please visit:\nhttp://uhr.rutgers.edu/benefits/benefits-overview\n.\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPosition Status\n\\n\n\\n\n\\n        Part Time\\n\n\\n\n\\n\n\\n\n\\n\nWorking Hours\n\\n\n\\n\n\\n        19.5\\n\n\\n\n\\n\n\\n\n\\n\nDaily Work Shift\n\\n\n\\n\n\\n        Day\\n\n\\n\n\\n\n\\n\n\\n\nWork Arrangement\n\\n\n\\n\n\\n        Consistent with the current application of Rutgers Policy 60.3.22 or the applicable provisions of relevant collective negotiations agreements, this position may be eligible for a hybrid work arrangement. Flexible work arrangements are not permanent, are subject to change or discontinuation, and contingent on the employee receiving approval in the FlexWork@RU Application System.\\n\n\\n\n\\n\n\\n\n\\n\nPayroll Designation\n\\n\n\\n\n\\n        PeopleSoft\\n\n\\n\n\\n\n\\n\n\\n\nTerms of Appointment\n\\n\n\\n\n\\n        Temporary Staff Appointment - Hourly\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Qualifications\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nMinimum Education and Experience\n\\n\n\\n\n\\n\nBachelor’s degree in civil engineering, architecture, architectural engineering or related field, or an equivalent combination of education and/or experience.\n\\n\nFive years experience and/or increasing functional responsibility in a leadership/managerial role.\n\\n\n\\n\n\\n\n\\n\n\\n\nCertifications/Licenses\n\\n\n\\n\n\\n\nValid driver’s license.\n\\n\n\\n\n\\n\n\\n\n\\n\nRequired Knowledge, Skills, and Abilities\n\\n\n\\n\n\\n\nGood skills with modeling programs such as Revit, Rhino, and/or Unity 3D.\n\\n\n\\n\n\\n\n\\n\n\\n\nPreferred Qualifications\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nEquipment Utilized\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPhysical Demands and Work Environment\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nSpecial Conditions\n\\n\n\\n\n\\n\nTwo vacancies.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Posting Details\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPosting Open Date\n\\n\n\\n\n\\n        05/20/2025\\n\n\\n\n\\n\n\\n\n\\n\nPosting Close Date\n\\n\n\\n\n\\n        01/06/2026\\n\n\\n\n\\n\n\\n\n\\n\nOpen Until Filled\n\\n\n\\n\n\\n        No\\n\n\\n\n\\n\n\\n\n\\n\nSpecial Instructions to Applicants\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nRegional Campus\n\\n\n\\n\n\\n        Rutgers University-New Brunswick\\n\n\\n\n\\n\n\\n\n\\n\nHome Location Campus\n\\n\n\\n\n\\n        Busch (RU-New Brunswick)\\n\n\\n\n\\n\n\\n\n\\n\nCity\n\\n\n\\n\n\\n        Piscataway\\n\n\\n\n\\n\n\\n\n\\n\nState\n\\n\n\\n\n\\n        NJ\\n\n\\n\n\\n\n\\n\n\\n\nLocation Details\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Pre-employment Screenings \\n\n\\n\n\\n      All offers of employment are contingent upon successful completion of all pre-employment screenings.\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Immunization Requirements \\n\nUnder Policy 100.3.1 Immunization Policy for Covered Individuals, if employment will commence during Flu Season, Rutgers University may require certain prospective employees to provide proof that they are vaccinated against Seasonal Influenza for the current Flu Season, unless the University has granted the individual a medical or religious exemption. Additional infection control and safety policies may apply. Prospective employees should speak with their hiring manager to determine which policies apply to the role or position for which they are applying. Failure to provide proof of vaccination for any required vaccines or obtain a medical or religious exemption from the University will result in rescission of a candidate’s offer of employment or disciplinary action up to and including termination.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Equal Employment Opportunity Statement \\n\n\\n\n\\n      It is university policy to provide equal employment opportunity to all its employees and applicants for employment regardless of their race, creed, color, national origin, age, ancestry, nationality, marital or domestic partnership or civil union status, sex, pregnancy, gender identity or expression, disability status, liability for military service, protected veteran status, affectional or sexual orientation, atypical cellular or blood trait, genetic information (including the refusal to submit to genetic testing), or any other category protected by law. As an institution, we encourage all qualified applicants to apply. For additional information please see the Non-Discrimination Statement at the following web address: http://uhr.rutgers.edu/non-discrimination-statement\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nPosting Specific Questions\n\\n\n\\n\nRequired fields are indicated with an asterisk (*).\n\\n\n\\n\n\\n\n* Do you have a bachelor’s degree in civil engineering, architecture, architectural engineering or related field, or an equivalent combination of education and/or experience? \\n\n\\n\nYes\n\\n\nNo\n\\n\n\\n\n\\n\n\\n\n* Do you have five years experience and/or increasing functional responsibility in a leadership/managerial role? \\n\n\\n\nYes\n\\n\nNo\n\\n\n\\n\n\\n\n\\n\n\\n\nApplicant Documents\n\\n\n\\n\nRequired Documents\n\\n\n\\n\n\\n\nResume/CV\n\\n\n\\n\nOptional Documents\n\\n\n\\n\n\\n\nCover Letter/Letter of Application\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=7266a580295f1b95&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfnfc72293c07e&spon=0&xkcb=SoDn67M3pvmyVWACJ70BbzkdCdPP&xfps=d4cc8562-47c9-437b-8b9f-561481353193&vjfrom=vjs&asub=mob&astse=3aa76e132feaabbb&assa=1451"
}