{
  "filename": "data_analyst_New_York__NY_page9_job8_Customer_Service_Data_Analyst.html",
  "job_title": "Customer Service Data Analyst",
  "company": "Plymouth Rock Assurance Corporation",
  "location": "Woodbridge, NJ 07095",
  "salary": "$61,500 - $81,500 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T11:19:06.981Z",
  "full_description": "\\n\n\\n\nIn this position the\nCustomer Service Data Analyst\nis crucial in supporting the Customer Service Center, Underwriting, and Sales teams by providing actionable insights through data analysis and comprehensive reporting. This role requires expertise in Tableau for creating reports and dashboards, proficiency in SQL Server for data extraction and query management, and the ability to support various databases and systems. The successful candidate will work closely with the Customer Service Center, Underwriting, and Sales management teams, while also interacting with Product, Finance, and IT departments. Additionally, this role includes responsibilities as a backup programmer for our Client Letter system.\n\\n\n\\n\nRESPONSIBILITIES\n\\n\n\\n\nCollect, analyze, and interpret data from various sources to generate reports and dashboards.\n\\n\nDevelop and maintain regular and ad-hoc reports for Service, Underwriting, Sales.\n\\n\nIdentify trends, patterns, and anomalies in data to provide actionable insights.\n\\n\nPull data from the Data Warehouse and other sources using SQL Server, running complex queries and building datasets for analysis.\n\\n\nAnalyze call center metrics such as call volume, average handle time, and customer satisfaction scores.\n\\n\nProvide insights to improve call center efficiency and customer experience.\n\\n\nDevelop reports to monitor agent performance and call center KPIs.\n\\n\nMonitor and report on service levels, turnaround times, and customer feedback\n\\n\nAnalyze underwriting metrics and workflows to identify areas for process improvement.\n\\n\nCreate reports to track underwriting performance and efficiency.\n\\n\nCreate reports to track sales performance and efficiency.\n\\n\nDevelop dashboards and visualizations to track performance and identify opportunities for enhancement.\n\\n\nAnalyze existing processes and automate manual functions through technology\n\\n\nWork closely with department heads and team members to understand data needs and reporting requirements.\n\\n\nPresent findings and recommendations to stakeholders in a clear and actionable manner.\n\\n\nCollaborate with IT and data management teams, including Product and Finance, to ensure data integrity and accuracy.\n\\n\nIdentify and implement best practices for data collection, analysis, and reporting.\n\\n\nContinuously evaluate and improve reporting processes to enhance efficiency and effectiveness.\n\\n\nServe as a backup programmer for the Client Letter system.\n\\n\nProgram and debug client letters, run batch jobs, and resolve any related issues.\n\\n\n\\n\n\\n\nQUALIFICATIONS\n\\n\n\\n\nBachelor's degree in Data Science, Statistics, Computer Science, Business Analytics, or a related field.\n\\n\nProven experience as a Data Analyst, Business Analyst, or similar role, preferably within a customer service or financial services environment.\n\\n\nProficiency in data analysis tools and software (e.g., Excel, SQL, Tableau, Power BI).\n\\n\nStrong analytical skills with the ability to interpret complex data and present findings clearly.\n\\n\nExperience with call center metrics and underwriting processes is a plus.\n\\n\nExcellent communication skills, both written and verbal.\n\\n\nStrong attention to detail and ability to work independently with minimal supervision.\n\\n\nAbility to manage multiple projects and deadlines effectively.\n\\n\n\\n\nSALARY RANGE\n\\n\nThe pay range for this position is $61,500 to $81,500 annually. Actual compensation will vary based on multiple factors, including employee knowledge and experience, role scope, business needs, geographical location, and internal equity.\n\\n\n\\n\nPERKS & BENEFITS\n\\n\n\\n\n4 weeks accrued paid time off + 8 paid national holidays per year, and 2 floating holidays\n\\n\nLow cost and excellent coverage health insurance options that start on Day 1 (medical, dental, vision)\n\\n\nAnnual 401(k) Employer Contribution\n\\n\nFree onsite gym at our Woodbridge Location\n\\n\nResources to promote Professional Development (LinkedIn Learning and licensure assistance)\n\\n\nRobust health and wellness program and fitness reimbursements\n\\n\nVarious Paid Family leave options including Paid Parental Leave\n\\n\nTuition Reimbursement\n\\n\n\\n\n\\n\nABOUT THE COMPANY\n\\n\nThe Plymouth Rock Company and its affiliated group of companies write and manage over $2 billion in personal and commercial auto and homeowner's insurance throughout the Northeast and mid-Atlantic, where we have built an unparalleled reputation for service. We continuously invest in technology, our employees thrive in our empowering environment, and our customers are among the most loyal in the industry. The Plymouth Rock group of companies employs more than 1,900 people and is headquartered in Boston, Massachusetts. Plymouth Rock Assurance Corporation holds an A.M. Best rating of “A-/Excellent”.\n\\n\n\\n\n#LI-DNI\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}