{
  "filename": "data_analyst_New_York__NY_page7_job5_Business_Analyst_III__Group_Be.html",
  "job_title": "Business Analyst III, Group Benefits Underwriting",
  "company": "Guardian Life Insurance Company",
  "location": "Bethlehem, PA•Hybrid work",
  "salary": "$68,970 - $113,310 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:13:59.406Z",
  "full_description": "\\n\n\\n  Do you have the desire to be part of a high performing team in the Technology & Systems field? Is a culture where “People Count” and “We do the Right Thing” important to you? Guardian Life Insurance Company is actively seeking a passionate, driven, and self-motivated individual to join its Underwriting Process & Technology team. The ideal Business Analyst III candidate is someone with a strategic, innovative background, who has previous knowledge in Renewal Underwriting job responsibilities.\\n\n\\n\n\\n\n\\n  The Business Analyst III will have a growth mindset and be responsible for participating in planning sessions with key stakeholders while working to enhance our Underwriting technology platforms. In addition, they will partner with Agile Product Owners to define business requirements and test plans, expected business outcomes and key results, as well as high level feature decomposition to ensure user stories have the appropriate acceptance criteria for success. The Business Analyst III will collaborate with various stakeholders to understand all areas impacted and maintain alignment.\\n\n\\n\n\\n\n\\n  You are\\n\n\\n\n\\n\nA self-starter who seeks to understand customer needs, business demands, and aligns their business analyst capacity and skills to implement the best solutions\n\\n\nAble to solve problems and function highly in both an independent and team environment\n\\n\nDetermined to find the best approach to the work, identifying the highest value techniques to achieve business objectives\n\\n\nFocused on developing and maintaining relationships with all key stakeholders to gather information, understand interests, and enhance personal and departmental productivity\n\\n\n\\n\n\\n\n\\n  You have\\n\n\\n\n\\n\nBachelor’s degree preferred or equivalent work experience in similar role\n\\n\nA broad understanding of group insurance strategies, products, and processes\n\\n\nElevated level of proficiency in Microsoft Office 365 (advanced in Excel), JIRA, Tableau, and/or Confluence tool sets\n\\n\nExceptional written skills; ability to tailor messaging to audience\n\\n\nPreferred: Experience with our Renewal Underwriting Platform (GCRS)/Renewal and Pricing logic\n\\n\nPreferred: Experience using AI tools such as M365 Copilot\n\\n\n\\n\n\\n\n\\n  You will\\n\n\\n\n\\n\nPerform analysis in support of decisions on organizational design required to achieve a business objective or key result\n\\n\nBecome a go-to resource for our business partners when it comes to technical assistance for our Underwriting systems\n\\n\nParticipate in, as well as lead, workshops, brainstorming sessions and large group meetings that cut across multiple business and functional areas\n\\n\nPerform process analysis as compliment to lean business case analysis\n\\n\nDevelop strong relationships with key business, technical, and project management functions\n\\n\nMaintain strong relationships with all stakeholders to gather information and understand stakeholder interests\n\\n\nWork closely with product managers, product owners, project managers, and operational excellence teams during the preparation and maintenance of epic statements, lean business cases, and where appropriate, feature and story development\n\\n\nBuild and execute business test plans\n\\n\nPossess excellent communication skills, to include the ability to interact professionally with all levels of the organization in written, verbal, and visual formats\n\\n\n\\n\n\\n\n\\n  Location and Work Arrangement\\n\n\\n\n\\n  This is a hybrid position requiring 3 days a week in a Guardian office. The preferred locations for this position are Bethlehem, PA and Boston, MA. May consider other U.S. locations for qualified applicants.\\n\n\\n\n\\n\nTravel\\n\n\\n\n\\n  Approximately 10% travel required for this position.\\n\n\\n\n\\n\n\\n  VISA SPONSORSHIP\\n\n\\n\n\\n  Guardian Life is not currently or in the foreseeable future sponsoring employment visas. In order to be a successful applicant, you must be legally authorized to work in the United States, without the need for employer sponsorship.\\n\n\\n\n\\n\n\\n  Salary Range:\\n\n\\n\n$68,970.00 - $113,310.00\\n\n\\n\n\\n  The salary range reflected above is a good faith estimate of base pay for the primary location of the position. The salary for this position ultimately will be determined based on the education, experience, knowledge, and abilities of the successful candidate. In addition to salary, this role may also be eligible for annual, sales, or other incentive compensation.\\n\n\\n\n\\n\n\\n  Our Promise\\n\n\\n\n\\n\n\\n  At Guardian, you’ll have the support and flexibility to achieve your professional and personal goals. Through skill-building, leadership development and philanthropic opportunities, we provide opportunities to build communities and grow your career, surrounded by diverse colleagues with high ethical standards.\\n\n\\n\n\\n\n\\n  Inspire Well-Being\\n\n\\n\n\\n\n\\n  As part of Guardian’s Purpose – to inspire well-being – we are committed to offering contemporary, supportive, flexible, and inclusive benefits and resources to our colleagues. Explore our company benefits at \\n\n\\n   www.guardianlife.com/careers/corporate/benefits\\n\n.\nBenefits apply to full-time eligible employees. Interns are not eligible for most Company benefits.\n\\n\n\\n\n\\n\n\\n  Equal Employment Opportunity\\n\n\\n\n\\n\n\\n  Guardian is an equal opportunity employer. All qualified applicants will be considered for employment without regard to age, race, color, creed, religion, sex, affectional or sexual orientation, national origin, ancestry, marital status, disability, military or veteran status, or any other classification protected by applicable law.\\n\n\\n\n\\n\n\\n  Accommodations\\n\n\\n\n\\n\n\\n  Guardian is committed to providing access, equal opportunity and reasonable accommodation for individuals with disabilities in employment, its services, programs, and activities. Guardian also provides reasonable accommodations to qualified job applicants (and employees) to accommodate the individual's known limitations related to pregnancy, childbirth, or related medical conditions, unless doing so would create an undue hardship. If reasonable accommodation is needed to participate in the job application or interview process, to perform essential job functions, and/or to receive other benefits and privileges of employment, please contact \\n\n\\n   applicant_accommodation@glic.com\\n\n.\\n\n\\n\n\\n\n\\n  Current Guardian Colleagues: Please apply through the internal Jobs Hub in Workday.\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=287434f0ed88344f&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfo1hnsi8qp803&spon=0&xkcb=SoD067M3pv4J5G2EiJ0ObzkdCdPP&xfps=0bf13911-3ca9-41a7-82d4-0cf129685c0a&vjfrom=vjs&asub=mob&astse=bf0ab2dbd44b2c77&assa=9861"
}