{
  "filename": "data_analyst_New_York__NY_page8_job5_Technical_Business_Analyst__Hy.html",
  "job_title": "Technical Business Analyst (Hyphen)",
  "company": "Healthfirst",
  "location": "Hartford, CT",
  "salary": "$68,900 - $112,540 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:16:11.964Z",
  "full_description": "\\n The Senior Process Specialist is a highly experienced member of the Hyphen product delivery team responsible for preparing documentation used for data ingestion and transformation, UX//UI development, API integration to back end services, logging and KPI reporting and testing for Hyphen capabilities that connect-care using interoperability standards. The Senior Process Specialist is a self-starter with a keen interest in understanding the underlying technology that supports our product capabilities who contributes individually as well as alongside integrated delivery teams consisting of Product Owners, Developers and QA team members. The Senior Process Specialist produces high quality work with a strong impact on high client satisfaction. The Senior Process Specialist proactively assists others, both client and Hyphen team members.\\n\nDuties//Responsibilities:\n\\n\n\\n\nIndependently perform, analyze and document data profiling, source to target mapping, transformation logic specifications and process design for Hyphen product capabilities\n\\n\nDevelop test cases and perform user and system testing\n\\n\nWork with business stakeholders to understand their needs and translate them into technology requirements\n\\n\nGather, analyze and document product requirements within the agile framework\n\\n\nCollaborate with development team to ensure that solutions align with business requirements\n\\n\nCommunicate findings and recommendations to both technical and non-technical audiences\n\\n\nDevelop business process flows and detailed design documentation\n\\n\nAssist in reporting and presenting requirements and possible approaches to client\n\\n\nDocument and manage issues\n\\n\nManage multiple priorities simultaneously\n\\n\nProvide progress and acceptance criteria for agile stories\n\\n\n\\n\nAssist Process Specialists through training, coaching and function as first-level of support\n\\n\nAdditional duties as assigned\nMinimum Qualifications:\n\\n\n\\n\nAssociates degree from an accredited institution or equivalent work experience\n\\n\nBusiness Analyst, Process Specialist, Process Analyst, or similar work experience\n\\n\nDemonstrate ability to remain organized, self-motivated and able to meet project deadlines with minimal supervision\n\\n\nEmpathetic listener, effective in interpersonal communications\n\\n\nRigorous attention to detail, demonstrate ability to write clear, concise communications and documentation demonstrating proper grammar, correct spelling and punctuation\nPreferred Qualifications:\n\\n\n\\n\nBachelor’s degree from an accredited institution\n\\n\nProficient in Microsoft Office suite; working knowledge of Visio or other diagramming//design software\n\\n\nAble to work independently and as part of a team\n\\n\nAbility to work in a matrix-management environment within an agile framework\n\\n\nExcellent time management, organizational, and prioritization skills\n\\n\nAbility to balance multiple priorities\n\\n\nWorking knowledge of SQL\n\\n\nHealthcare experience\na plus\n\\n\nAdditional duties as assigned\nHiring Range*:\n\\n\n\\n\nGreater New York City Area (NY, NJ, CT residents): $77,900 - $112,540\n\\n\nAll Other Locations (within approved locations): $68,900 - $102,510\nAs a candidate for this position, your salary and related elements of compensation will be contingent upon your work experience, education, licenses and certifications, and any other factors Healthfirst deems pertinent to the hiring decision.\nIn addition to your salary, Healthfirst offers employees a full range of benefits such as, medical, dental and vision coverage, incentive and recognition programs, life insurance, and 401k contributions (all benefits are subject to eligibility requirements). Healthfirst believes in providing a competitive compensation and benefits package wherever its employees work and live.\n\\n\n\\n\nThe hiring range is defined as the lowest and highest salaries that Healthfirst in “good faith” would pay to a new hire, or for a job promotion, or transfer into this role.\n\\n\n68900-102510\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=b63328bfe3affd6a&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfoa4c0i8qp87r&spon=0&xkcb=SoDX67M3pv4nSMACJ70NbzkdCdPP&xfps=59d92622-2b42-4593-840c-3c2b8403cf6f&vjfrom=vjs&asub=mob&astse=cf16b104f94f9d1a&assa=2286"
}