{
  "filename": "data_analyst_New_York__NY_page9_job1_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "Maimonides Medical Center",
  "location": "4802 10th Avenue, Brooklyn, NY 11219",
  "salary": "$67,647 - $84,558 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T11:17:55.392Z",
  "full_description": "\\n About Us: We’re Maimonides Health, Brooklyn’s largest healthcare system, serving over 250,000 patients each year through the system’s 3 hospitals, 1800 physicians and healthcare professionals, more than 80 community-based practices and outpatient centers. At Maimonides Health, our core values H.E.A.R.T drives everything we do. We uphold and maintain Honesty, Empathy, Accountability, Respect, and Teamwork to empower our talented team, engage our respective communities and adhere to Planetree's philosophy of patient-centered care. The system is anchored by Maimonides Medical Center, one of the nation’s largest independent teaching hospitals and home to centers of excellence in numerous specialties; Maimonides Midwood Community Hospital (formerly New York Community Hospital), a 130-bed adult medical-surgical hospital; and Maimonides Children's Hospital, Brooklyn's only children's hospital and only pediatric trauma center. Maimonides' clincal progams rank among the best in the country for patient outcomes, including its Heart and Vascular Institute, Neuroscience Institute, Boneand Joint Center, and Cancer Center. Maimonides is an affiliate of Northwell Health and a major clinical training site for SUNY Downstate College of Medicine. Overview: \\n\nThe Business Analyst will be responsible for contract management. Working with vendors and end users negotiating and executing supply chain agreements. Supporting analytics and business requirements of the Contract Analyst, Purchasing Application Manager, and Supply Chain Operations Team including but not limited to report creation, presentation preparation, training, system maintenance and documentation. Collects and analyzes data to help improve supply chain operations. Conducting in depth cost analysis for decision support. The Business Analyst will collaborate with vendors and suppliers to ensure all operations meet quality and safety standards.\nResponsibilities: \\n\n\\n\nOversight of contract management software and the full lifecycle of all supply chain agreements.\n\\n\nNegotiation and execution of supply chain agreements.\n\\n\nConducts in-depth cost analyses to identify cost-saving opportunities and improve patient outcomes.\n\\n\nIntegrates data from multiple sources and systems to ensure consistency, accuracy, and alignment with business needs.\n\\n\nDemonstrates strong teamwork and collaboration skills with cross-functional partners, including IT, administrators, end-users, and vendors.\n\\n\nProvides technical support to end-users, addressing business system inquiries and issues with a focus on pricing integrity.\n\\n\nInvestigates and resolves system-related issues, identifies root causes, implements timely solutions, and escalates to management when appropriate.\n\\n\nQualifications: \\n\n\\n\nBachelor’s Degree required.\n\\n\n6+ months of relevant IT/systems (or related) experience.\n\\n\nExperience using various applications/programs including, C++, SQL, Microsoft Tools, Tableau, Business Objects, Dashboards, PeopleSoft and/or comparable ERP/MMIS System.\n\\n\nExcellent critical thinking abilities with strong communication and analytic skills.\n\\n\nStrong working knowledge of Microsoft Office Suite; mid to advance Excel and PowerPoint knowledge is required.\n\\n\nPresentation and preparation experience using PowerPoint required.\n\\n\nSpeaks, reads and writes English to the extent required by the position.\n\\n\nPay Range: USD $67,647.00 - USD $84,558.00 /Yr. Equal Employment Opportunity Employer: Maimonides Medical Center (MMC) is an equal opportunity employer.\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}