{
  "filename": "data_analyst_New_York__NY_page2_job7_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "Sustainable Engineering Services",
  "location": "2125 Center Ave, Fort Lee, NJ 07024",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:54:30.569Z",
  "full_description": "\\n\nSustainable Engineering Services values work life balance and employee safety. We provide a flexible working environment and believe that our team is our greatest asset. Currently our team is working on a hybrid schedule, with multiple layers of COVID-19 safety precautions in place at the office.\n\\n\nThe first assignment for this position requires full-time in office presence supporting one of our clients in their digital transformation efforts.\n\\n\n\\n\nResponsibilities:\n\\n\n\\n\nStructure large data sets to find usable information\n\\n\nCollect, review and maintain data to monitor pre-established KPIs\n\\n\nCreate reports for internal teams and/or external clients\n\\n\nCollaborate with team members to collect and analyze data\n\\n\nUse graphs, infographics and other methods to visualize data\n\\n\nWork with a team of analysts and other associates to process information\n\\n\nCreate presentations and reports based on recommendations and findings\n\\n\n\\n\nRequirements:\n\\n\n\\n\nBachelors Degree in Information Management, Computer Science, Mathematics, Economics or Finance\n\\n\nKnowledge of data gathering, cleaning and transforming techniques\n\\n\nAbility to develop front end and back end solutions\n\\n\nReporting and data visualization skills using Power BI\n\\n\nAbility to reverse-engineer and modify existing spreadsheets and dashboards\n\\n\nUnderstanding of data warehousing and ETL techniques\n\\n\n\\n\n\\n\nCoding skills in languages such as SQL, Python and/or R\n\\n\nAnalytical and problem-solving skills\n\\n\nHigh proficiency in Microsoft Excel\n\\n\nHigh proficiency in Microsoft Sharepoint\n\\n\nAbility to set and meet deadlines\n\\n\nTechnical writing skills\n\\n\nExcellent attention to detail\n\\n\nStrong written/verbal communication skills\n\\n\nAbility to QA and troubleshoot data\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=d233a59b077bf56c&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfn2hp0j73685t&spon=0&xkcb=SoBQ67M3pvmFm_Rbpp0MbzkdCdPP&xfps=b88de1d8-b3f2-413e-86f5-df2f94c53540&sjdu=P1I77cdwYcTaldFfTlwva2UAQC7NkCx9kdPdsZycd3A&vjfrom=vjs&asub=mob&astse=2d02360f67a0a951&assa=4929"
}