{
  "filename": "page1_job5_Marketing_Data_Analyst.html",
  "job_title": "Marketing Data Analyst",
  "company": "Fusion92",
  "location": "Chicago, IL 60654",
  "salary": "$50,000 - $70,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:27:21.039Z",
  "full_description": "\\n\nABOUT US:\n\\n\nFusion92 is building the future of marketing through an unparalleled, data-driven approach to solving our clients' toughest problems. We call ourselves a Marketing Transformation Partner for clients, as through a culture of curiosity, fearlessness, teamwork and leadership, we turn our expertise toward creating new paths forward where our services and technology together unlock unprecedented growth.\n\\n\nWe’re an independent, national enterprise based in Chicago with hubs in Detroit, Austin and Denver. Fusion92 is committed to a diverse, equitable, inclusive workplace that drives a positive impact in our global community.\n\\n\nWe are experts across every field and discipline in marketing.\n\\n\nFusion92 is for those who are obsessed with curiosity and innovation. We unite data scientists, media buyers, copywriters, technologists, developers, consultants, coders, UX/UI specialists, designers, strategists, producers, operations pros and more to deliver real results and to give answers to the unanswerable.\n\\n\nWe launch products, we have patented innovations, we create award-winning ideas — we transform businesses. We are dreamers and doers, and we are ready for you to join us.\n\\n\nOur difference is our people. That's where you come in.\n\\n\nIf you're curious and looking for a remote-flexible, integrated team where you can fearlessly collaborate and deliver best-in-class work, join us!\n\\n\nJOB SUMMARY:\n\\n\nAs a\nMarketing Data Analyst\nwithin our Data & Analytics team, you will play a pivotal role in shaping our marketing and advertising strategies through data-driven insights. You will be responsible for collecting, analyzing, and interpreting data related to our media campaigns across various channels. By providing actionable recommendations, you will contribute to optimizing our marketing efforts and achieving our business objectives.\n\\n\nBringing our core values — Curiosity, Fearlessness, Teamwork and Leadership — to life will be critical to the success of this individual.\n\\n\nThis role can be remote or a part of our Chicago or Detroit office. * While our offices are currently open, daily in-office attendance is not required.\n\\n\nGENERAL RESPONSIBILITIES:\n\\n\n\\n\nGather data from multiple sources, including but not limited to digital advertising platforms, social media, client systems and platforms, and web analytics tools\n\\n\nDetermine campaign data and tracking requirements; manage measurement systems for data capture and reporting\n\\n\nServe as technical resource for configuring and adding new data to reporting systems and dashboards\n\\n\nAnalyze campaign performance data to assess the effectiveness of various media channels and campaigns\n\\n\nDevelop and maintain key performance indicators (KPIs) to track media campaign success\n\\n\nMonitor and report on KPIs regularly, identifying trends and opportunities for improvement\n\\n\nConduct analysis to benchmark our performance against client and industry standards\n\\n\nCreate visualizations and reports to communicate data findings effectively to cross-functional teams\n\\n\nUtilize data visualization tools to present data in a clear and actionable manner\n\\n\nCollaborate with marketing and advertising teams to provide actionable insights for optimizing media campaigns\n\\n\nMake data-driven recommendations for budget allocation and targeting adjustments\n\\n\nPlan and execute A/B tests and experiments to refine media strategies\n\\n\nInterpret test results to implement improvements in future campaigns\n\\n\nProvide ad-hoc analysis and support for various data-related inquiries\n\\n\nBe ready to address urgent requests and deliver insights promptly\n\\n\nMaintain organized documentation of data sources, methodologies, and results\n\\n\nCreate and deliver regular reports to internal stakeholders\n\\n\nRequirements:\n\\n\nKNOWLEDGE/SKILLS/ATTRIBUTES REQUIRED:\n\\n\n\\n\nBachelor's degree in a related field, such as Marketing, Data Science, or Statistics\n\\n\nProven experience in data analysis and interpretation, preferably in the marketing or advertising industry\n\\n\nProficiency with data analysis tools and software, including Alteryx, Excel, Google Analytics, and data visualization tools such as Tableau and Salesforce Marketing Cloud Intelligence\n\\n\nKnowledge of digital advertising platforms (e.g., Google Ads, Facebook Ads) and web analytics is preferred\n\\n\nExperience with building data tables and querying in SQL is a plus\n\\n\nStrong analytical and problem-solving skills\n\\n\nExcellent communication and presentation skills\n\\n\nDetail-oriented with the ability to manage multiple tasks and meet deadlines\n\\n\n\\n\nThe hiring range for this discipline within our industry is $50,000 to $70,000. Where an employee is paid within this range will depend on multiple factors including, but not limited to location, years of experience, education, internal pay structure, and other contributing factors.\n\\n\nDisclaimer: All qualified candidates will receive consideration for employment without regard to age, race, creed, color, national origin, ancestry, marital status affectional or sexual orientation, gender identity or expression, disability, nationality, or sex\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}