{
  "filename": "page2_job9_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "Chicago Bulls",
  "location": "1901 West Madison Street, Chicago, IL 60612",
  "salary": "$60,000 - $70,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:31:13.954Z",
  "full_description": "\\n\nData Analyst\n\\n\nPosition Overview:\n\\n\nThe Chicago Bulls Business Strategy and Analytics Department is a team of strategic critical problem solvers who champion a continuous improvement mentality across the organization. Our mission is to collaborate with key decision makers across the business and empower them with data and insights to better serve our fans.\n\\n\nThe Data Analyst will serve as a strategic partner to business stakeholders, driving data quality, system optimization, and actionable insights that enable data-driven decision-making across the organization.\n\\n\nResponsibilities:\n\\n\n\\n\nManage the day-to-day operations of our CRM system (Microsoft Dynamics) and key integrations\n\\n\nPartner closely with Ticket Sales & Service teams and other departments to design and implement strategic solutions, including data models and BI dashboards, that drive business performance and inform critical decisions\n\\n\nBuild and standardize SQL queries, data models, and reporting templates that enable team members to quickly extract insights and maintain consistent metrics across departments\n\\n\nContinuously optimize CRM configuration based on evolving business requirements and end-user feedback, implementing enhancements that improve system usability and adoption\n\\n\nIdentify, research, and implement new tools, workflow automations, and system integration opportunities to eliminate manual processes and increase operational efficiency\n\\n\nEstablish and enforce data governance standards, including validation rules, naming conventions, and data entry protocols to ensure accuracy, integrity, and completeness across all systems\n\\n\nChampion CRM and analytics adoption across the organization by providing training, documentation, and ongoing support to strengthen data-driven culture\n\\n\n\\n\nQualifications:\n\\n\n\\n\nBachelor's degree (or equivalent experience) with a consistent track record of professional and personal achievement\n\\n\n1-2 years of professional experience, preferably in a data or CRM focused role\n\\n\nStrong proficiency in SQL with experience querying and managing data in cloud data warehouses (Snowflake experience preferred)\n\\n\nDemonstrated ability to create effective data visualizations using BI tools (Tableau preferred)\n\\n\nHands-on experience with CRM platforms, ideally Microsoft Dynamics 365\n\\n\nAdvanced Microsoft Excel skills including pivot tables, complex formulas, and data analysis functions\n\\n\nProficiency in Microsoft PowerPoint for presenting findings and recommendations to stakeholders\n\\n\n\\n\nSkills:\n\\n\nThe ideal candidate has a strong mix of the following:\n\\n\n\\n\nGreat interpersonal and communication skills with the ability to establish relationships and share findings with both technical and non-technical team members\n\\n\nAn eye for the details because data quality is paramount\n\\n\nAnalytical and problem-solving expertise that will help uncover and address inefficiencies\n\\n\nHigh tolerance for nuance with the ability to adapt quickly to changes in the business\n\\n\nBusiness literacy driven by the application of data and insights to drive strategy and results\n\\n\nEntrepreneurial spirit that thrives in a high profile, small business, balancing multiple projects across different functions\n\\n\n\\n\nCompensation & Benefits:\n\\n\nThe base salary range for this role is $60,000 – 70,000 annually + annual discretionary bonus. This salary range is an estimate, and the actual salary will vary based on applicant’s education, experience, skills, and abilities, as well as internal equity and alignment with market data.\n\\n\nThe Chicago Bulls offer competitive benefits and perks. Our full-time offerings include, but are not limited to:\n\\n\n\\n\nLow premiums for healthcare, dental, and vision coverage\n\\n\n100% paid premium for basic employee life insurance and disability coverage\n\\n\n401(k) with employer match plus annual discretionary contribution\n\\n\nFlexible spending account for healthcare and dependent care as well as commuter benefits\n\\n\nPaid time-off including vacation, sick, holiday, days of significance, and parental leave\n\\n\nComplimentary home game tickets, parking, and gym access\n\\n\nComplimentary snacks, lunch and dinner (if working games / events)\n\\n\nPet Insurance\n\\n\n\\n\nThe Chicago Bulls offer workplace flexibility. Full-time remote work is not an option for this role and interested applicants should be currently located in or prepared to move to the Chicagoland area. This role will require a flexible schedule with the ability to work evenings and weekends as required.\n\\n\nWe are an Equal Opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability, or any other status or characteristic protected by applicable federal, state, or local law.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=0b817fed5b7b753e&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflmfhii8qp835&spon=0&xkcb=SoAa67M3pvjWLbWEiJ0CbzkdCdPP&xfps=4aa5f0e6-9184-42e6-8788-9ba2510db7d8&vjfrom=vjs&asub=mob&astse=7c4e3d02e2378027&assa=3060"
}