{
  "filename": "page4_job8_Digital_Rotational_Analyst___May_2026_Grads.html",
  "job_title": "Digital Rotational Analyst - May 2026 Grads",
  "company": "Charter Manufacturing",
  "location": "Mequon, WI•Hybrid work",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:36:37.626Z",
  "full_description": "\\n\nCharter Manufacturing is a fourth-generation family-owned business where our will to grow drives us to do it better. Join the team and become part of our family!\n\\n\n\\n\nCharter Manufacturing is now hiring a May 2026 graduate for our Digital Rotational Program!\n\\n\n\\n\nThe Digital Rotational Analyst is targeted at recent college graduates to build IT talent and organizational bench strength through a two to three-year rotational program. The program offers an excellent opportunity for individuals early in their careers to learn the many facets of both Information Technology and Charter Manufacturing.\n\\n\n\\n\nProspective Concentrated Rotational Areas:\n\\n\n\\n\nCustomer Experience / Help Desk\n\\n\nBusiness Intelligence & Analytics\n\\n\nProject Management\n\\n\nBusiness Analyst\n\\n\nArchitecture\n\\n\nSoftware Automation\n\\n\n\\n\n\\n\nRotational Program Structure:\n\\n\n\\n\n5 rotations are based out of the corporate office in Mequon, WI\n\\n\n\\n\n\\n\nRotational Program Perks:\n\\n\n\\n\nCoaching & Mentorship\n\\n\nBalance of day-to-day responsibilities and project work\n\\n\nProfessional Development, Coaching, and Mentorship\n\\n\nGuaranteed placement upon program completion\n\\n\nEligible for Full-Time Employee Benefits\n\\n\nHybrid flexibility: 3 days a week in the office\n\\n\n\\n\n\\n\nWhat we're looking for:\n\\n\n\\n\nBachelor’s Degree in Computer Science, Information Technology, Information Systems or related field\n\\n\nExcellent academic record with a minimum cumulative GPA of 3.0\n\\n\nInformation Technology or general business internship or related experience\n\\n\nPrior experience participating in a team environment\n\\n\nDemonstrated communication, analytical, and problem-solving skills\n\\n\nHigh level of initiative for excellence, results, and process improvement\n\\n\nStrong interpersonal skills to work with individuals at all levels within the business\n\\n\nAbility to be on-call to support a global manufacturing environment that operates 24 X 7\n\\n\nCapability to travel in the greater Milwaukee area, as project load requires\n\\n\n\\n\n\\n\nWhat you'll focus on:\n\\n\n\\n\nSupport IT professionals in executing project work and day-to-day responsibilities within each rotation to build foundational skills.\n\\n\nParticipate in and complete projects both individually as well as with cross functional teams within the business. These assignments provide the IT Rotational Analyst with opportunities to develop core IT skills, business acumen, systems & process familiarity, and organizational relationships.\n\\n\nFlexibility to work with different direct managers for each rotation, as well as a mentor that will remain the same for the 2-3-year period.\n\\n\nLearn and grow foundational business skills, including those offered through Charter when available: Professional Presence, Teams and Teamwork, Presentation Skills, Project Management, Conflict Management, Emotional Intelligence, and Safety Training.\n\\n\n\\n\n\\n\n#LI-Hybrid\n\\n\n#LI-AF1\n\\n\n\\n\nWe offer comprehensive health, dental, and vision benefits, along with a 401(k) plan that includes employer matching and profit sharing. Additionally, we offer company-paid life insurance, disability coverage, and paid time off (PTO).\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=5bcd3f229443898e&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfm0ebsjn1a8cm&spon=0&xkcb=SoD067M3pvkOCiyJaB0DbzkdCdPP&xfps=36d59a37-f7ef-4409-aa1c-1f564868247e&vjfrom=vjs&asub=mob&astse=38438e80efe0a9a1&assa=7861"
}