{
  "filename": "page2_job12_Analyst__Data_Integration.html",
  "job_title": "Analyst, Data Integration",
  "company": "Strata Decision Technology",
  "location": "Chicago, IL",
  "salary": "$60,000 - $75,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T10:31:44.710Z",
  "full_description": "\\n\nHow you'll make an impact:\n\\n\nAs a Analyst on our Data Integration (DI) team, you will be implementing our software, StrataJazz and will partner directly with key team members at health systems and financial & higher education institutions. The responsibilities of this role include:\n\\n\n\\n\nUnderstand and communicate integration specifications and plans for implementation with clients.\n\\n\nUse technologies including SQL and Microsoft Excel to solve complex problems.\n\\n\nDemonstrate proficiency with data integration & configuration / ETL.\n\\n\nGain a deeper understanding of common data types and source systems including General Ledger, Payroll, Patient Accounting, Patient Billing, etc.\n\\n\nPartner with clients as a trusted advisor to implement best practices within financial and clinical data.\n\\n\nCollaborate with Strata's Technical and Engineering Teams to ensure the product is aligned with customer needs.\n\\n\nLead customer training to ensure customers understand specific features and functions related to Axiom®\n\\n\nCommunicate proactively with Strata team members, managers, and project managers on issues and risks that may arise during the project life cycle. Develop and execute action plans to mitigate risks proactively.\n\\n\nMeaningfully contribute to operational improvement and strategic growth projects to enable Strata to continue to scale operations and continually improve our level of service to customers.\n\\n\nWork in an Agile environment and learn one of the most widely used and effective methodologies for building and implementing high quality, feature-rich software.\n\\n\n\\n\nWhat we're looking for:\n\\n\n\\n\n0-3 years of full time experience\n\\n\nProfessional and/or academic background in SQL and relational database concepts\n\\n\nExperience leading clients through complex projects\n\\n\nYou'd really wow us if you have:\n\\n\n\\n\nProfessional experience implementing cloud-based technology\n\\n\nExperience working with Electronic Medical Records, General Ledgers, Patient Billing, or Payroll data\n\\n\n\\n\n\\n\nEstimated Salary Range: $60,000- 75,000\n\\n\nActual salary will be determined based on factors including, but not limited to, skill set and level of experience. This salary range is a good faith estimate of base pay. Strata also provides discretionary variable pay programs based on role. In addition, Strata provides a comprehensive benefits package including retirement benefits, health and welfare benefits, paid time off, parental leave, life and accident insurance, and other voluntary and well-being benefits.\n\\n\n\\n\nFind out more about Strata benefits here.\n\\n\nHow we work:\nThe preferred location for this role is in Chicago, IL or St. Louis, MO. We value our people spending time together and have campuses hosting in-person events located in both cities. We are truly a hybrid environment with all team members experiencing the flexibility to work from home.\n\\n\nThinking about applying?\nResearch shows that women and underrepresented groups tend to apply to jobs only when they check every box on a job posting. If you're currently reading this and hesitating to click \"Apply\" for that reason, we encourage you to go for it! A true passion and excitement for making an impact is just as important as work experience.\nShould you require a reasonable accommodation in completing this application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please reach out to careers@stratadecision.com.\n\\n\nHere @ Strata…\nOur culture is driven by our people solving problems together. We embrace learning, collaboration, and continuous career growth. Together, we lift our customers, our products, our company, and our community.\n\\n\nWe believe that each of our team member's unique perspectives and experiences is what drives innovation and positive change. Our individual differences are what make us a more forward-thinking organization. We foster a culture of inclusion, equity and belonging, regardless of race, religion, disability, sex, sexual orientation, gender identity or national origin.\nOur Core Values:\nWhile we celebrate what makes each member of our team unique, our core values are what connect us. They set clear expectations for how we approach our work and how each of us can positively influence the experience of our team and our customers.\n\\n\n\\n\nWe connect with positive intent.\n\\n\nWe are helpful.\n\\n\nWe own it.\n\\n\nWe get better every day.\n\\n\nWe are humble.\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=f347a4240a71658c&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflmfhii8qp835&spon=0&xkcb=SoC967M3pvjWLbWEiJ0HbzkdCdPP&xfps=48961312-ef69-4758-9b6d-1f80da14d243&vjfrom=vjs&asub=mob&astse=e825a30872cb39c6&assa=5020"
}