{
  "filename": "page1_job6_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "Brillio Inc",
  "location": "Rosemont, IL",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:27:31.349Z",
  "full_description": "\\n\nCompany Description\n\\n\nBased out of Silicon Valley, Brillio leverages disruptive technology in data and digital to give clients competitive advantage. Our service model caters to clients in a slew of domains such as consulting, ideating, the art of the possible, rapid prototyping. Big Data Analytics and Digital Experiences such as IoT, Wearables, UX, Mobile,IP-led solutions and engineered software solutions. Our 2,500 odd employees serve more than 350 global clients, a significant number of whom are Fortune 500\nJob Description\n\\n\n\\n\nA day in the Life of Data and Visualization Practitioner at Brillio\n\\n\nYou will partner closely with the Engagement Portfolio Leaders and Customers to deliver state of the art solutions engineered by Visualization Architects for easy insights consumption\n\\n\nYou will manage various modules in the project from a Quality, Timeline and Innovation perspective\n\\n\nIn your area of expertise mentor support practitioners and peer specialist.\n\\n\nYou’ll bring this to the table Customer Centricity o Understand your clients requirements and translate them into quality solutions\n\\n\nYou will work towards becoming a trusted partner with all your clients by regularly engaging with them, proactively evaluate and recommend technology innovation\n\\n\nTimely delivery of projects Technical Domain Knowledge\n\\n\nUse your technical knowledge in Visualization to deliver world class solutions\n\\n\nExperience with Tableau is must Expertise in RDBMS concepts, PLSQLTSQL, Joins, Stored Procedures, Schema, etc.\n\\n\nExperience in databased SQL Server, Oracle, Teradata etc.\n\\n\nInvest time to continually upgrade self and teams technical and functional skills.\n\\n\nStrong business acumen and ability to translate business problem into actionable insights by problem definition, structured problem solving, storytelling and application of design thinking principles Execution and Delivery Excellence\n\\n\nBuilds and ensures self team follow best practices, adhering to the processes and proactively identify and manage risks.\n\\n\nQualifications\n\\n\n\\n\nExperience with Tableau is must Expertise in RDBMS concepts, PLSQLTSQL, Joins, Stored Procedures, Schema, etc.\n\\n\nExperience in databased SQL Server, Oracle, Teradata etc.\n\\n\nInvest time to continually upgrade self and teams technical and functional skills.\n\\n\nAdditional Information\n\\n\nAll your information will be kept confidential according to EEO guidelines.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}