{
  "filename": "page3_job11_Corporate_Practice_Analyst.html",
  "job_title": "Corporate Practice Analyst",
  "company": "Perkins Coie",
  "location": "Chicago, IL 60603",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:33:50.685Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n         Job Description:\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n   POSITION DESCRIPTION\\n\n\\n\n\\n\n\\n\n\\n  GENERAL PURPOSE\\n\n\\n\n\\n  The Corporate Practice Analyst provides comprehensive support to legal teams and business professionals by managing transactional logistics, supporting business development initiatives, and streamlining document and data processes.\\n\n\\n\n\\n\n\\n  ESSENTIAL FUNCTIONS\\n\n\\n\n\\n\n\\n  These essential functions are primary job duties that incumbents must be able to perform unassisted or with some reasonable accommodation.\\n\n\\n\n\\n\n\\n\nTransactional Support: Draft status reports and presentations; prepare standard client and transaction documents; manage signature logistics, including document distribution, collection, and checklist management; assist with annual corporate filings.\n\\n\nBusiness Development: Prepare and format pitch materials (PowerPoint, video, Canva); coordinate client and business development events, including webinars, speaking engagements, and CLE workshops; track business development activities and client engagement in CRM systems.\n\\n\nResearch and Reporting: Conduct industry and company research to support prospecting; compile data for RFP responses; generate automated reports for business development tracking.\n\\n\nCommunications and Marketing Support: Update lawyer biographies; draft and coordinate firm-approved social media content; support documentation of attorney experience for proposals and Foundation updates.\n\\n\nProcess Automation and Data Management: Create document and correspondence templates; implement data entry automation; support CRM integration with document management systems.\n\\n\nMaintain timely and accurate time records.\n\\n\nMaintain positive contact with clients, lawyers, and business professionals and observe confidentiality of client matters.\n\\n\nBe present at work during regularly scheduled working hours and as required by the position, consistent with the firm’s attendance expectations.\n\\n\nWork additional hours beyond the normal schedule if required to meet firm and/or client demands.\n\\n\n\\n\n\\n\n\\n  SPECIFIC SKILLS REQUIRED\\n\n\\n\n\\n\n\\n\nProficiency in MS Office applications, including Word, Outlook, PowerPoint, and Excel.\n\\n\nDemonstrated skills in document and information management.\n\\n\nAbility to express self effectively, both verbally and in writing.\n\\n\nAbility to establish effective working relationships with firm lawyers, business professionals, client personnel, and other professionals.\n\\n\nPossess strong organizational skills and attention to detail.\n\\n\nAbility to handle multiple tasks and multiple concurrent deadlines.\n\\n\nAbility to work well under pressure and independently.\n\\n\n\\n\n\\n\n\\n  SPECIFIC SKILLS PREFERRED\\n\n\\n\n\\n\n\\n\nExperience in legal, business development, or professional services environment.\n\\n\nAbility to manage multiple priorities and work collaboratively across teams.\n\\n\n\\n\n\\n\n\\n  EDUCATION AND EXPERIENCE\\n\n\\n\n\\n\n\\n\nFour-year degree and two-plus years of relevant professional experience.\n\\n\nMBA candidate preferred.\n\\n\n\\n\n\\n\n\\n\nAt Perkins Coie, we look for self-motivated individuals dedicated to providing value and superior service and who have a high degree of integrity and enthusiasm for their work. We have created a company culture based on collaboration, devotion\nto serving our clients, and mutual respect. Perkins Coie is committed to advancing\n\\n\n\\n\ndiversity and inclusion\n\\n\nboth within the firm and throughout our collective communities. Work with one of the\n\\n\n\\n\n100 Best Companies to Work For\n\\n\nand receive great health insurance, tuition reimbursement, and paid sabbaticals.\n\\n\n\\n\n\\n\n\\n\nThis position is eligible for an annual discretionary bonus, 401(k) plan, medical, dental, and vision insurance, accrued paid time off plan starting at 20 days annually, personal medical and parental leave, up to 10 paid holidays, and family care benefits. More information regarding benefits and programs may be found\n\\n\n\\n\nhere\n\\n\n.\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=5c8363843ccfc004&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflr5mlj72i8c2&spon=0&xkcb=SoDt67M3pvjjZ8QpQ50BbzkdCdPP&xfps=f6e1f0d9-c069-43b8-8ef5-65455113e1ce&vjfrom=vjs&asub=mob&astse=d8ffa93da1af663b&assa=5786"
}