{
  "filename": "page1_job4_CPC_Data_Specialist___Pricing_Analyst.html",
  "job_title": "CPC Data Specialist / Pricing Analyst",
  "company": "PROFESSIONAL MEDICAL INC",
  "location": "1917 Garnet Ct, New Lenox, IL 60451",
  "salary": "$25 - $28 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:27:09.801Z",
  "full_description": "\\n\n\\n\nProfessional Medical, Inc.\n(ProMed) is a family-owned and operated medical supply distributor, in business for over 55 years. Join the ProMed Team and become part of the family!\n\\n\nJOB PURPOSE:\n\\n\nThe\nPricing Analyst\nis responsible for performing day-to-day duties related to loading pricing, cost and contract analysis and issue resolution within our Special Sales department.\n\\n\nRESPONSIBILITIES:\n\\n\n\\n\n\\n\nInterpret data, analyze results using statistical techniques and provide ongoing reports.\n\\n\nPerform competitor analysis on similar products and services.\n\\n\nAcquire data from primary or secondary data sources and maintain databases/data systems.\n\\n\nIdentify, analyze, and interpret trends or patterns in complex data sets.\n\\n\nAbility to filter and “clean” data by utilizing reports.\n\\n\nAddress issues and concerns raised by team members relating to pricing.\n\\n\nWork with management to prioritize business and information needs.\n\\n\nLocate and define new process improvement opportunities.\n\\n\n\\n\n\\n\nREQUIREMENTS AND SKILLS:\n\\n\n\\n\nStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts\nof information with attention to detail and accuracy.\n\\n\n\\n\nPerform daily, weekly, and monthly pricing, reporting and contract analysis.\n\\n\nResearch pricing discrepancies, provide accurate resolutions and load pricing accurately.\n\\n\nRun cost analysis reporting.\n\\n\nAble to reset/adjust priorities as the business demands.\n\\n\nManaging day-to-day tasks while carrying projects to successful completion.\n\\n\nWork independently in a deadline driven environment.\n\\n\n\\n\nMINIMUM QUALIFICATIONS:\n\\n\n\\n\nAssociate degree or equivalent combination of education and experience.\n\\n\n\\n\n\\n\n\\n\nEnthusiastic and proactive team player\n\\n\n\\n\n\\n\n\\n\nExcellent written and verbal communication skills.\n\\n\n\\n\n\\n\n\\n\nStrong independent analytic and critical thinking skills\n\\n\n\\n\n\\n\n\\n\nProficient in the basic features of all Microsoft Office products.\n\\n\n\\n\n\\n\n\\n\nProficient in the advanced features of Microsoft Excel: lookup formulas and pivot tables (a plus).\n\\n\nAbility to multitask, meet deadlines and deliver on expectations.\n\\n\n\\n\n\\n\n\\n\nSomeone who can handle criticism and constructive feedback and provide it when needed.\n\\n\n\\n\n\\n\n\\n\nBENEFITS AND COMPENSATION:\n\\n\nMedical, Dental and Vision Insurance, PTO and Paid Holidays, 401(k) with company match, Group Term Life Insurance (company paid), Long and short-term disability. Salary, commensurate with experience.\n\\n\n40 Hours Per Week\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}