{
  "filename": "page3_job4_Marketing_Insights_Analyst__SEO__Data_and_Analysis.html",
  "job_title": "Marketing Insights Analyst (SEO, Data and Analysis) ON SITE",
  "company": "Anodyne, LLC",
  "location": "5050 South 2nd Street, Milwaukee, WI 53207",
  "salary": "$25 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:32:45.062Z",
  "full_description": "Company Overview\n\\n\nAnodyne is a rapidly growing company in the diabetic footwear category, dedicated to providing high-quality products and exceptional customer service. We believe that great service is just as important as the products we offer, and we strive to create meaningful interactions that reflect our commitment to the Anodyne brand.\n\\n\nSummary\n\\n\nAs a Marketing Associate at Anodyne, you will play a vital role in promoting our unique diabetic footwear products. This position is based in the United States and offers an opportunity to contribute to our mission of delivering personal and diligent service while enhancing our brand presence in the market.\n\\n\nResponsibilities\n\\n\n\\n\nDevelop and implement marketing strategies to promote Anodyne's products.\n\\n\nConduct market research to identify trends and customer needs.\n\\n\nManage social media accounts and create engaging content to drive brand awareness.\n\\n\nOptimize website content for SEO to improve online visibility.\n\\n\nAssist in budgeting for marketing campaigns and track performance metrics.\n\\n\nCollaborate with internal stakeholders to understand business requirements, target audiences, and marketing objectives, and translate them into effective digital marketing initiatives.\n\\n\nContinuously monitor website performance, analyze user behavior, and identify opportunities for website optimization and conversion rate improvement.\n\\n\nCreate compelling copy for advertisements, brochures, and other promotional materials.\n\\n\nProactively suggest improvements and enhancements to reporting that can aid in sales performance\n\\n\nServe as a consultant to the sales team, actively engaging with them to understand their reporting needs and preferences\n\\n\nStay up-to-date with industry trends, emerging technologies, and digital marketing best practices, and recommend innovative strategies to drive growth and enhance the company's online presence\n\\n\nProject manage and collaborate with external agencies, freelancers, and vendors to ensure seamless execution of digital marketing initiatives\n\\n\n\\n\nRequirements\n\\n\n\\n\nBachelor's degree in Marketing, Communications, or a related field preferred.\n\\n\nProven experience in digital marketing, including SEO and social media strategies.\n\\n\nStrong research skills with the ability to analyze data effectively.\n\\n\nExcellent copywriting skills with attention to detail.\n\\n\nExperience in managing digital advertising campaigns across platforms such as Google Ads, Facebook Ads, LinkedIn Ads, etc.\n\\n\nExperience with marketing automation and CRM tools.\n\\n\nExperience working with HTML, content management systems and design software.\n\\n\nFamiliarity with Google Analytics and other marketing tools is a plus.\n\\n\nAbility to work collaboratively in a team-oriented environment.\n\\n\n\\n\nIf you are passionate about marketing and eager to make a difference in the diabetic footwear industry, we invite you to apply today and join our dedicated team at Anodyne!\n\\n\nJob Type: Full-time\n\\n\nPay: $25.00 per hour\n\\n\nExpected hours: 40 per week\n\\n\nBenefits:\n\\n\n\\n\n401(k)\n\\n\n401(k) matching\n\\n\nDental insurance\n\\n\nEmployee discount\n\\n\nHealth insurance\n\\n\nLife insurance\n\\n\nPaid time off\n\\n\nReferral program\n\\n\nVision insurance\n\\n\n\\n\nEducation:\n\\n\n\\n\nBachelor's (Required)\n\\n\n\\n\nExperience:\n\\n\n\\n\nData analytics: 1 year (Required)\n\\n\nSEO: 1 year (Required)\n\\n\nGoogle Analytics: 1 year (Preferred)\n\\n\n\\n\nWork Location: In person",
  "apply_method": "indeed_apply",
  "apply_url": null
}