{
  "filename": "page1_job3_Stipend_Data_Analyst.html",
  "job_title": "Stipend Data Analyst",
  "company": "Chicago CRED",
  "location": "Chicago, IL 60601•Hybrid work",
  "salary": "$25 an hour",
  "job_type": "Part-time, Contract",
  "scraped_at": "2025-12-27T10:26:59.583Z",
  "full_description": "Job Title:\nStipend Data Analyst\n\\n\nContractor:\nHourly Non-Exempt 1099 Contractor\n\\n\nReports to:\nData Manager\n\\n\nBackground:\n\\n\nChicago CRED is a mission driven organization working to achieve transformational\n\\n\nreduction in violence in Chicago. CRED does its work by offering direct services to those\n\\n\nwho are at the highest risk of violence, advocating for policy reform to increase public\n\\n\ninvestment into community violence interventions, and promoting cross-sector\n\\n\ncoordination to achieve maximum impact.\n\\n\nDepartment Function:\n\\n\nThe Data Team collects and presents data and information to support day-to-day program\n\\n\noperations, measure program outcomes and impact, resource allocation, and program\n\\n\nstrategies. The team also supports data needs for a variety of CRED and non-CRED Teams,\n\\n\nincluding CRED’s Program, Development, and Finance Teams, community partners,\n\\n\nfunders and researchers.\n\\n\nPosition Summary:\n\\n\nChicago CRED is seeking an Independent Contractor (part-time, 1099) to manage and\n\\n\nimprove the participant stipend distribution process. This contractor will ensure accurate\n\\n\ndata, timely payments, and clear communication with staff and participants regarding\n\\n\ncalculation and expectations of stipends. The contractor will also analyze stipend data and\n\\n\ncollaborate with Program Leadership to support alignment across programming sites.\n\\n\nThis is currently a six-month position, with the potential to expand in scope and hours to\n\\n\nsupport the development and refinement of technical processes to allow Chicago CRED to\n\\n\nmanage the stipend distribution from end-to-end.\n\\n\nThe work primarily follows a two-week schedule, the first week calculating stipends and\n\\n\nthen the second week distributing stipends. The stipend distribution week will have more\n\\n\ntasks and require more time than the stipend calculation week.\n\\n\nEssential Duties and Responsibilities:\n\\n\nStipend Operations:\n\\n\n\\n\nManage stipend payment process for CRED participants on a bi-weekly basis\n\\n\nVerify accuracy and completeness of participant data in Salesforce\n\\n\nCommunicate with staff regarding outstanding payments\n\\n\nTroubleshoot and resolve payment issues with staff and payment processor\n\\n\nCoordinate cancellation and resubmission of failed or expired payments; document activity in Salesforce\n\\n\n\\n\nData Quality & Reporting:\n\\n\n\\n\nImport and export payment data into/out of Salesforce to meet reporting and operational needs\n\\n\nAudit attendance entries for accuracy, identifying duplicates, omissions, or incorrect service types and coordinate corrections with sites and data team\n\\n\nPrepare bi-weekly summary updates for Program Leadership on stipend trends and site-level patterns or issues to resolve\n\\n\n\\n\nTraining & Support:\n\\n\nProvide training sessions for staff to ensure:\n\\n\n\\n\nClear communication to participants regarding the stipend process\n\\n\nStipend calculation methods align with Program Leadership expectations\n\\n\nAccurate and timely group attendance entries\n\\n\nEffective onboarding for new staff involved in the stipend process\n\\n\nMaintain and update training materials, documentation, and protocols\n\\n\n\\n\nProcess Improvement:\n\\n\n\\n\nIdentify and implement process improvements related to stipend calculation, documentation and workflows\n\\n\nSupport the development of scalable technical solutions for managing stipends as program needs evolve\n\\n\nCollaborate with the Data Team and Program Leadership to improve automation, accuracy, and reliability of stipend-related processes\n\\n\n\\n\nExperience and Qualifications:\n\\n\nRequired:\n\\n\n\\n\nStrong attention to detail and excellent organizational, time management and problem-solving skills\n\\n\nIntermediate to advanced proficiency with Google Sheets and Excel\n\\n\nStrong written and verbal communication skills, with the ability to explain processes to audiences with varied technical backgrounds\n\\n\nPrior administrative, operations, or program management experience\n\\n\nStrong relationship-building and customer service skills\n\\n\nAbility to work effectively independently and in a team, both virtually and in-person\n\\n\nDeveloping, delivering, or maintaining training materials\n\\n\nFlexibility to adapt to changing needs in order to best support CRED’s mission\n\\n\nAbility to work with program participants who may be unstably housed or at risk of street violence\n\\n\n\\n\nPreferred:\n\\n\n\\n\nExperience with workflow development, process mapping, or operational systems improvement\n\\n\nExperience managing data within Salesforce or comparable CRM tool\n\\n\nFamiliarity with automation tools, advanced Excel/Sheets functions, Google Apps Scripts, or Salesforce\n\\n\nExperience with data integrity or quality assurance practices\n\\n\n\\n\nHours:\n\\n\n\\n\nPart-time, estimated 10-15 hours a week: approximately 4 hours on Monday and Thursdays; rest of hours flexible\n\\n\nScope may expand based on performance and organizational needs\n\\n\n\\n\nLocation:\n\\n\nHybrid\n\\n\n\\n\nPrimarily remote, with the ability to travel to sites on the west side and south side occasionally\n\\n\n\\n\nPhysical Requirements and Working Environment:\n\\n\n\\n\nAbility to sit or stand for extended periods of time\n\\n\nAbility to work with a computer for extended periods of time-up to 70%\n\\n\nAbility to work independently\n\\n\n\\n\nCompensation:\n\\n\n\\n\n$25 per hour; this position is not benefits eligible\n\\n\n\\n\nJob Types: Part-time, Contract\n\\n\nPay: $25.00 per hour\n\\n\nExpected hours: 10 – 15 per week\n\\n\nPeople with a criminal record are encouraged to apply\n\\n\nLocation:\n\\n\n\\n\nChicago, IL 60601 (Required)\n\\n\n\\n\nAbility to Commute:\n\\n\n\\n\nChicago, IL 60601 (Required)\n\\n\n\\n\nWork Location: Hybrid remote in Chicago, IL 60601",
  "apply_method": "indeed_apply",
  "apply_url": null
}