{
  "filename": "page3_job2_Associate_Analyst_Business_Analytics.html",
  "job_title": "Associate Analyst Business Analytics",
  "company": "Medline Industries",
  "location": "Chicago, IL",
  "salary": "$56,160 - $78,520 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:32:31.044Z",
  "full_description": "\\n\nJob Summary\nMedline Industries has an immediate opening for an Associate Analyst Business Analytics with our Dynacor division. This role will be based out of our Chicago Merchandise Mart location and will work a hybrid model. Performs intermediate-level data research and financial analysis to support business objectives. The role involves planning and preparing business, financial, and data analyses, as well as presenting findings to managers or project leaders.\nThe Associate Business Analytics Analyst develops recommendations to address business problems and issues, contributing to informed decision-making and process improvement initiatives. \\n\n\\n\nJob Description\n\\n\nMAJOR RESPONSIBILITIES\n\\n\nParticipate in the proposal pricing process to include development of pricing strategies, analyzing and compiling cost data, preparing price submissions.\n\\n\n\\n\nWork directly with internal teams (such as Sales, Inventory Management, Finance) to provide intermediate level analysis and reporting as necessary.\n\\n\n\\n\nMonitor for data accuracy, timeliness and integrity in data used in analysis and reporting. Communicate to appropriate personnel if data inaccuracies exist.\n\\n\n\\n\nEnsure follow-up so that analysis and reporting outcomes are reviewed and implemented.\n\\n\n\\n\nMINIMUM JOB REQUIREMENTS\n\\n\nEducation\n\\n\nBachelor’s degree in Business, Finance, Accounting, Information Systems, Mathematics, Applied Statistics, or Business Analytics.\n\\n\n\\n\nCertification / Licensure\n\\n\n\\n\nWork Experience\n\\n\n\\n\nKnowledge / Skills / Abilities\n\\n\nIntermediate level skill in Microsoft Excel (for example: using basic functions, inserting charts, Pivot Tables, nested formulas).\n\\n\nExperience using time management skills such as prioritizing/organizing and tracking details and meeting deadlines of multiple projects with varying completion dates.\n\\n\nExperience analyzing and reporting data in order to identify issues, trends, or exceptions to drive improvement of results and find solutions.\n\\n\n\\n\nPREFERRED JOB REQUIREMENTS\n\\n\nEducation\n\\n\n\\n\nCertification / Licensure\n\\n\n\\n\nWork Experience\n\\n\n\\n\nKnowledge / Skills / Abilities\n\\n\nExperience with SAP\n\\n\nExperience with SQL, Tableau\n\\n\n\\n\nMedline Industries, LP, and its subsidiaries, offer a competitive total rewards package, continuing education & training, and tremendous potential with a growing worldwide organization.\n\\n\n\\n\nThe anticipated salary range for this position:\n$56,160.00 - $78,520.00 Annual \\n\n\\n\nThe actual salary will vary based on applicant’s location, education, experience, skills, and abilities. This role is bonus and/or incentive eligible. Medline will not pay less than the applicable minimum wage or salary threshold.\n\\n\n\\n\nOur benefit package includes health insurance, life and disability, 401(k) contributions, paid time off, etc., for employees working 30 or more hours per week on average. For roles where employees work less than 30 hours per week, benefits include 401(k) contributions as well as access to the Employee Assistance Program, Employee Resource Groups and the Employee Service Corp.\n\\n\n\\n\nWe’re dedicated to creating a Medline where everyone feels they belong and can grow their career. We strive to do this by seeking diversity in all forms, acting inclusively, and ensuring that people have tools and resources to perform at their best. Explore our Belonging page here .\n\\n\n\\n\nMedline Industries, LP is an equal opportunity employer. Medline evaluates qualified individuals without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, age, disability, neurodivergence, protected veteran status, marital or family status, caregiver responsibilities, genetic information, or any other characteristic protected by applicable federal, state, or local laws.\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=07d9362d1c4b8c6a&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflr5mlj72i8c2&spon=0&xkcb=SoAX67M3pvjjZ8QpQ50KbzkdCdPP&xfps=72202934-11a7-4ada-b8ef-ad6eeb42e9b9&vjfrom=vjs&asub=mob&astse=1f98e64b50e373d7&assa=5953"
}