{
  "filename": "page4_job6_Tech_Lead___Customer_Journey_Analytics.html",
  "job_title": "Tech Lead - Customer Journey Analytics",
  "company": "Ulta Beauty, Inc.",
  "location": "Bolingbrook, IL 60440",
  "salary": "$102,900 - $160,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:36:15.164Z",
  "full_description": "\\n Overview: \\n\n\\n  Live the\nexperience\n. From professional empowerment to continual learning opportunities. From ongoing investment in new and emerging technologies to a career of self-determination. At Ulta Beauty, our tech team is critical to our scalability—and is recognized that way. We’ve been defined as a “mature start-up.” A place where interdepartmental exposure, open doors, and genuine collaboration is ubiquitous. Where challenges come fast and furious, requiring agility, mental dexterity, and creativity. Where\nour passion for better solutions\ndrives us and is core to who we are.\\n\n\\n\n\\n\n\\n\n\\n\n\\n  We’re engineering for the future of retail, and it’s no-holds-barred. But for those motivated by continual change and ambiguity, by superior leadership, by whip smart colleagues who will press you daily for your very best, you’ll find that virtually nothing’s impossible at Ulta Beauty.\\n\n: \\n\nTHE IMPACT YOU CAN HAVE:\n\\n\nThe Technical Lead – Customer Journey Analytics will play a critical role in shaping how we capture, analyze, and act on customer data across the enterprise. This role will lead the transition from Adobe Analytics to Adobe Customer Journey Analytics (CJA), ensuring a unified, real-time view of customer interactions across digital and offline channels. As a hands-on technical leader, you will design scalable data integrations, champion best practices in analytics, and partner with Marketing, Product, and IT teams to enable advanced insights that drive business growth and customer experience innovation.\n\\n\n\\n\nYOU'LL ACHIEVE THESE GOALS BY:\n\\n\nStrategy & Architecture\n\\n\n\\n\nDefine the vision and roadmap for transitioning from Adobe Analytics to Customer Journey Analytics (CJA), aligning with business objectives and customer data strategy.\n\\n\nServe as the subject matter expert for CJA, designing scalable data models, schemas, and pipelines that deliver a comprehensive customer view.\n\\n\nPartner with Enterprise Data, MarTech, and Business Intelligence teams to ensure CJA integrates seamlessly with Adobe Experience Cloud, Real-Time CDP, and other enterprise platforms.\n\\n\n\\n\nExecution & Delivery\n\\n\n\\n\nLead the design, implementation, and optimization of CJA workspaces, datasets, and connections, enabling multi-channel and cross-device analysis.\n\\n\nOversee data migration efforts from Adobe Analytics to CJA, ensuring data accuracy, continuity, and governance standards are met.\n\\n\nBuild and operationalize dashboards, reports, and advanced analytics capabilities that provide actionable insights to business stakeholders.\n\\n\n\\n\nMeasurement & Optimization\n\\n\n\\n\nDefine KPIs and success criteria for customer analytics initiatives, with a focus on data quality, completeness, and business impact.\n\\n\nTranslate analytical findings into recommendations that guide marketing campaigns, personalization strategies, and product experiences.\n\\n\nFoster a culture of data-driven decision making by enabling self-service analytics and embedding CJA capabilities into day-to-day operations.\n\\n\n\\n\nLeadership & Enablement\n\\n\n\\n\nMentor and guide analysts, engineers, and business partners in leveraging CJA effectively.\n\\n\nPartner with vendors, system integrators, and Adobe experts to accelerate adoption and value realization.\n\\n\nContribute to governance frameworks, ensuring compliance, scalability, and alignment with enterprise data strategy.\n\\n\n\\n\n: \\n\nESSENTIALS FOR SUCCESS:\n\\n\n\\n\nBachelor’s degree in Computer Science, CIS, or equivalent professional experience\n\\n\nProven experience leading implementations of Adobe Customer Journey Analytics, with strong knowledge of transitioning from Adobe Analytics.\n\\n\nDeep understanding of digital analytics, cross-channel attribution, and customer journey measurement.\n\\n\nHands-on expertise with Adobe Experience Platform (AEP), Real-Time CDP, and integration with upstream/downstream systems (CRM, e-commerce, data lakes).\n\\n\nStrong technical skills in data modeling, SQL, ETL pipelines, and API-based integrations.\n\\n\nExperience designing dashboards and visualizations in CJA and integrating with BI tools (e.g., Power BI, Tableau, or Looker).\n\\n\nStrong stakeholder management skills, with the ability to translate complex technical concepts into clear business outcomes.\n\\n\nDemonstrated leadership in mentoring teams, managing vendors, and driving adoption of new analytics platforms.\n\\n\n\\n\n: The pay range for this position is $102,900.00 - $160,000.00 / Year with the opportunity for eligible associates to earn additional compensation pursuant to the Company’s bonus plan. Exact pay will be based on factors including, but not limited to relevant education, qualifications, certifications, experience, level, shift, geographic location, and business and organizational needs. Full-time positions are eligible for paid time off, health, dental, vision, life and disability benefits. Part-time positions are eligible for dental, vision, life, and disability benefits. For additional information concerning our benefits, visit our Benefits and Career Development page: https://learn.bswift.com/ulta About: \\n\n\\n  At\nUlta Beauty\n(NASDAQ: ULTA),\nthe possibilities are beautiful\n. Ulta Beauty is the largest North American beauty retailer and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products and salon services. We bring possibilities to life through the power of beauty each and every day in our stores and online with more than 25,000 products from approximately 500 well-established and emerging beauty brands across all categories and price points, including Ulta Beauty’s own private label. Ulta Beauty also offers a full-service salon in every store featuring—hair, skin, brow, and make-up services.\\n\n\\n\n\\n\n\\n\nWe will consider for employment all qualified applicants, including those with arrest records, conviction records, or other criminal histories, in a manner consistent with the requirements of any applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance, the San Francisco Fair Chance Ordinance, and the New York City Fair Chance Act.\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=cfcbacecb9f82d0c&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfm0ebsjn1a8cm&spon=0&xkcb=SoCp67M3pvkOCiyJaB0NbzkdCdPP&xfps=ab5f3a1e-a214-4303-a452-5103e9cf6c91&vjfrom=vjs&asub=mob&astse=1d415711d150db71&assa=5412"
}