{
  "filename": "page4_job3_Data_Analyst___Outpatient_Dialysis___Maywood.html",
  "job_title": "Data Analyst - Outpatient Dialysis - Maywood",
  "company": "Trinity Health",
  "location": "Maywood, IL 60153",
  "salary": "$22.07 - $34.21 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:35:41.479Z",
  "full_description": "Employment Type:\nFull time\nShift:\nRotating Shift\nDescription:\nThe Data Analyst ensures the quality and accuracy of data collection, aggregation, coordination and analysis to support the hospital-wide performance improvement plans, quality measures and regulatoryrequirements.Creates dashboards, statistical process control charts, and specialty\ncharts which measure performance. Builds reports, extracts and\nanalyzes data and prepares clinical data presentations from various\nsystems for decision making and support of patent safety and infection\nreductions initiatives. Assists in monitoring action plans and measuring\noutcomes from those efforts. Provides reports to clinical departments\nanalyzing any identified trends.\nManages confidential data sets for statistical and trend analysis;\ndevelops procedures for gathering, entering , and reporting data to\nassure accuracy and timely flow of information.\nAssists practitioners with projects and provides, as needed, ideas for\nsaid projects. Participates in special projects or committees as\nrequested working towards achieving overall department goals. Enters\ndata into the public health software in a timely manner to remain\ncompliant with this requirement.\nMinimum Education:\nRequired:\nBachelors Degree OR equivalent training acquired via work experience or education\nPreferred:\nBachelors Degree\nMinimum Experience:\nPreferred:\n1-2 years of previous job-related experience\nLoyola Medicine Core Values\n\\n\n\\n\nReverence\n\\n\nWe honor the sacredness and dignity of every person.\n\\n\n\\n\nCommitment to Those Who are Poor\n\\n\nWe stand with and serve those who are poor, especially those most vulnerable.\n\\n\n\\n\nSafety\n\\n\nWe embrace a culture that prevents harm and nurtures a healing, safe environment for all.\n\\n\n\\n\nJustice\n\\n\nWe foster right relationships to promote the common good, including sustainability of Earth.\n\\n\n\\n\nStewardship\n\\n\nWe honor our heritage and hold ourselves accountable for the human, financial and natural resources entrusted to our care.\n\\n\n\\n\nIntegrity\n\\n\nWe are faithful to who we say we are.\nApplicants for this position must be authorized to work for any employer in the U.S. We are unable to sponsor an employment visa for this position.\nCOMPENSATION\nPay Range:\n$22.07 - $34.21 per hour\nActual compensation will fall within the range but may vary based on factors such as experience, qualifications, education, location, licensure, certification requirements, and comparisons to colleagues in similar roles.\nTrinity Health Benefits Summary\nOur Commitment\nRooted in our Mission and Core Values, we honor the dignity of every person and recognize the unique perspectives, experiences, and talents each colleague brings. By finding common ground and embracing our differences, we grow stronger together and deliver more compassionate, person-centered care. We are an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other status protected by federal, state, or local law.",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=fcad57a98ff52877&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfm0ebsjn1a8cm&spon=0&xkcb=SoAO67M3pvkOCiyJaB0IbzkdCdPP&xfps=7337007f-5c21-425d-b409-a7d8a09d93ef&vjfrom=vjs&asub=mob&astse=0d1c27d4a6579541&assa=1792"
}