{
  "filename": "page3_job13_Business_Process_Analyst_E__FIS_University_Program.html",
  "job_title": "Business Process Analyst E, FIS University Program",
  "company": "FIS Global",
  "location": "4900 West Brown Deer Road, Brown Deer, WI 53223",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:34:08.974Z",
  "full_description": "\\n\nPosition Type :\nFull time\\n\nType Of Hire :\nAssociate Development Program (Full Time Hire)\\n\nEducation Desired :\nBachelor's Degree\\n\nTravel Percentage :\n0%\\n\n\\n\nJob Description\n\\n\nEvery day, our teams innovate across the world of finance. We collaborate to work smarter, while making a difference. We believe in diversity and inclusivity, giving a voice to everyone on the team. And we celebrate our success together. If you want to make an impact in fintech, we’d like to know: Are you FIS?\n\\n\n\\n\nJoin the 2026 FIS University Program!\n\\n\n\\n\nAs a full-time employee in the FIS University Program, you will have the opportunity to participate in team projects, community service activities, professional development seminars and work with a team that is invested in your growth, development, and success; including bi-annual performance connects with your manager.\n\\n\n\\n\nThis two-year full-time program has start dates in January, March, June, and September with a dedicated “Learning Week” where you will:\n\\n\n\\n\nLearn how to work within a corporate environment\n\\n\nLearn about the exciting world of Fintech and the role FIS plays\n\\n\nHear from FIS leadership about their journey and participate in senior leader networking opportunities\n\\n\nBuild a network of your peers from across the organization\n\\n\n\\n\n\\n\nThis position is for a June 22, 2026 start.\n\\n\n\\n\nAbout The Role\n\\n\n\\n\nAre you passionate about uncovering insights hidden in data? Join our Commercial Data & Analytics team as a Business Process Analyst and kickstart your career in fintech. In this role, you’ll dive into real-world datasets, build compelling visualizations, and help shape smarter business decisions across our global organization. You’ll work alongside experienced mentors, collaborate with cross-functional teams, and see your work make a real impact. If you’re curious, analytical, and excited to grow, we want to hear from you.\n\\n\n\\n\nAbout The Team\n\\n\n\\n\nOur team turns data into action. We collaborate with teams across FIS to solve real business challenges using data-driven insights. Whether we’re building solutions in Microsoft Fabric or automating workflows with Power Automate, we use modern tools to work smarter and faster. You’ll join a supportive, collaborative group that values curiosity, creativity, and continuous learning. Together, we build solutions that make a measurable difference.\n\\n\n\\n\nWhat You Will Be Doing\n\\n\n\\n\nDive into data to uncover trends, patterns, and opportunities\n\\n\nCollaborate with teams to understand business needs and design data-driven solutions\n\\n\nDevelop data pipelines and automation scripts in Python in Microsoft Fabric\n\\n\nDesign semantic models and build Power BI dashboards that apply star schema, DAX, and performance optimization techniques\n\\n\nTest and refine our solutions to ensure they deliver real value\n\\n\n\\n\n\\n\nWhat You Bring\n\\n\n\\n\nBachelor’s degree in relevant field of study\n\\n\nProficiency in Microsoft Office Suite\n\\n\nFluent in English; Strong written and verbal communication skills\n\\n\nAdaptability, a drive to learn, and strong problem-solving skills\n\\n\nAbility to work well independently and within a team\n\\n\n\\n\n\\n\nBonus If You Have\n\\n\n\\n\nYou’re naturally curious and love learning new things\n\\n\nYou take ownership and follow through on your commitments\n\\n\nYou’ve built a portfolio of personal or academic data projects\n\\n\nYou’ve explored Python data visualization libraries like seaborn or matplotlib\n\\n\nYou’re interested in statistics, machine learning, or AI\n\\n\nYou thrive in collaborative, team-first environments\n\\n\n\\n\n\\n\nWhat We Offer You\n\\n\n\\n\nCompetitive salary and excellent benefits\n\\n\nThe chance to work on some of the most challenging, relevant issues in financial services & technology\n\\n\nA broad range of professional education and personal development possibilities – FIS is your final career step!\n\\n\nTime to support charities and give back to your community\n\\n\nA work environment built on collaboration, flexibility, and respect\n\\n\nStudent Loan Repayment Program: FIS will\nPAY OFF\nparticipants’ undergraduate loan balance over 10 years of service! Eligibility starts after one year of tenure in the program. The benefit applied to undergraduate student loans for US-based degrees and must be in the employee’s name.\n\\n\n\\n\n\\n\n*Current and future sponsorship are not available for this position*\n\\n\n\\n\n#FISUJUNE2026\n\\n\n\\n\nPrivacy Statement\n\\n\n\\n\nFIS is committed to protecting the privacy and security of all personal information that we process in order to provide services to our clients. For specific information on how FIS protects personal information online, please see the Online Privacy Notice.\n\\n\n\\n\nEEOC Statement\n\\n\n\\n\nFIS is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, marital status, genetic information, national origin, disability, veteran status, and other protected characteristics. The EEO is the Law poster is available here supplement document available here\n\\n\nFor positions located in the US, the following conditions apply. If you are made a conditional offer of employment, you will be required to undergo a drug test. ADA Disclaimer: In developing this job description care was taken to include all competencies needed to successfully perform in this position. However, for Americans with Disabilities Act (ADA) purposes, the essential functions of the job may or may not have been described for purposes of ADA reasonable accommodation. All reasonable accommodation requests will be reviewed and evaluated on a case-by-case basis.\n\\n\n\\n\nSourcing Model\n\\n\n\\n\nRecruitment at FIS works primarily on a direct sourcing model; a relatively small portion of our hiring is through recruitment agencies. FIS does not accept resumes from recruitment agencies which are not on the preferred supplier list and is not responsible for any related fees for resumes submitted to job postings, our employees, or any other part of our company.\n\\n\n\\n\n#pridepass\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=d5adef7ff91a1eb8&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflr5mlj72i8c2&spon=0&xkcb=SoDX67M3pvjjZ8QpQ50HbzkdCdPP&xfps=54e6d567-8b9f-4d7e-8492-27916a8acc7f&vjfrom=vjs&asub=mob&astse=da88125decd07187&assa=3364"
}