{
  "filename": "page3_job12_Energy_Business_Analyst.html",
  "job_title": "Energy Business Analyst",
  "company": "CME Group",
  "location": "Chicago, IL",
  "salary": "$68,100 - $113,500 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:34:01.847Z",
  "full_description": "\\n\nThe Energy BLM Analyst will work in partnership with the Energy Products team to design and implement the business line strategy. Specifically, this role will prepare quantitative and qualitative analysis to support product line managers in identifying growth opportunities for their products, as well as other more advanced analytics and strategic work to support the business.\n\\n\n\\n\n\\n\nPlay an integral part of the Energy BLM by helping cross-regional team members across product lines (crude oil and refined products, natural gas, environmental, and options) gather and analyze data to help grow the overall business\n\\n\nCreate informative, data-driven presentations for senior members of the team to present to internal and external audiences\n\\n\nWork with different departments across the company on time sensitive Energy data analysis that help summarize the business’s goals, initiatives, customer performance, etc.\n\\n\nCreate financial models to assess current and potential fee strategies, manage performance evaluation of fee initiatives\n\\n\nProvide customer support on product specific inquiries and occasional external data requests\n\\n\nPossess a strong interest in the energy market, specifically crude oil, natural gas, and refined products\n\\n\nPrepare colleagues for client meetings and join discussions to gather insights on our business\n\\n\nStudy the competitive landscape and presenting opportunities for CME growth\n\\n\nPermanently advance data reporting and analytical capabilities of all members of the Energy Business Team\n\\n\n\\n\n\\n\nQualifications\n\\n\n\\n\nBachelor’s Degree or higher in a related discipline\n\\n\nStrong analytical skills, including the ability to turn complex raw data into a useful summary\n\\n\nPossesses a \"no task is too small\" attitude, eagerly tackling foundational duties as a key strategy for rapidly learning our business processes and systems from the ground up\n\\n\nThrives in a team-based environment by demonstrating reliability, practicing clear and proactive communication, and consistently prioritizing the team's objectives to achieve collective success\n\\n\nAbility to learn quickly and execute projects with limited guidance in a fast-paced environment\n\\n\nAn understanding of the financial system and CME Group’s markets, and particularly a desire to learn more\n\\n\n\\n\n\\n\n#JR1\n\\n\nCME Group is committed to offering a competitive total rewards package for our employees that recognizes their contributions to the business and reflects our long-term investment in their future. The pay range for this role is $68,100-$113,500. Actual salary offered will be dependent on a wide array of factors including but not limited to: relevant experience, skills, education and comparison to internal employees (where relevant). Our compensation program also includes an annual target bonus opportunity for all employees, as well as the opportunity to become an owner in the company through our broad-based equity program. Through our benefits program, we strive to offer flexibility, value and choice. From comprehensive health coverage, to a retirement package that includes both a 401(k) and an active pension plan, to highly competitive education reimbursement provisions, paid time off and a mental health benefit, CME Group offers a holistic benefits package for our team and their dependents. \\n\n\\n\nCME Group: Where Futures are Made\n\\n\n\\n\nCME Group is the world’s leading derivatives marketplace. But who we are goes deeper than that. Here, you can impact markets worldwide. Transform industries. And build a career by shaping tomorrow. We invest in your success and you own it – all while working alongside a team of leading experts who inspire you in ways big and small. Problem solvers, difference makers, trailblazers. Those are our people. And we’re looking for more.\n\\n\n\\n\nAt CME Group, we embrace our employees' unique experiences and skills to ensure that everyone’s perspectives are acknowledged and valued. As an equal-opportunity employer, we consider all potential employees without regard to any protected characteristic.\n\\n\n\\n\nImportant Notice:\nRecruitment fraud is on the rise, with scammers using misleading promises of job offers and interviews to solicit money and personal information from job seekers. CME Group adheres to established procedures designed to maintain trust, confidence and security throughout our recruitment process.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=c9fa5c1081441ce0&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflr5mlj72i8c2&spon=0&xkcb=SoBZ67M3pvjjZ8QpQ50AbzkdCdPP&xfps=4fb018a2-a95f-4c69-8b45-2060026447ef&vjfrom=vjs&asub=mob&astse=280f7fcc01532a65&assa=2160"
}