{
  "filename": "page3_job10_Lead_Data_Science_Analyst.html",
  "job_title": "Lead Data Science Analyst",
  "company": "Discover",
  "location": "Riverwoods, IL",
  "salary": "$105,500 - $147,100 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T10:33:44.193Z",
  "full_description": "Discover. A brighter future.\nWith us, you’ll do meaningful work from Day 1. Our collaborative culture is built on three core behaviors: We Play to Win, We Get Better Every Day & We Succeed Together. And we mean it — we want you to grow and make a difference at one of the world's leading digital banking and payments companies. We value what makes you unique so that you have an opportunity to shine.\nCome build your future, while being the reason millions of people find a brighter financial future with Discover.\nJob Description:\nWhat You'll Do\nResponsible for working closely with management to execute analytical initiatives. Responsible for solving business problem by leveraging techniques such as segmentation, optimization, advanced analytics and machine learning. Creates reports and dashboards to closely monitor performance metrics and provide insights.\nHow You'll Do It\nLeads the development and implementation of advanced analytics including customer segmentation, optimization, prescriptive analytics and machine learning algorithm & recommendation to solve business problems. Operates as a subject matter expert on statistical analysis, test and design of experiment, analysis methodology, modeling & application, and financial impact analysis.\nCollaborates with cross-functional partners to understand their business needs, formulate and complete end-to-end analysis that includes data gathering, analysis, ongoing scaled deliverables and presentations. Delivers effective presentations of findings and recommendations to multiple levels of leadership, creating visual displays of quantitative information.\nEstablishes and maintains effective performance tracking; identify improvement opportunity, form hypothesis, proposes, designs and implements tests to drive strategy enhancement and optimization.\nManages multiple priorities, communicate business performance and project progress to management & business partners.\nDevelops and automates reports, iteratively build and prototype dashboards to provide insights at scale, solving for analytical needs. Facilitates implementation of work product and ensure accuracy.\nConsistently follows standard work processes and documentation requirements. Recommends improvement to work processes to increase efficiency while maintaining quality of work. Continuously improves technical and leadership skills through training and development.\nQualifications You'll Need\nThe Basics\nBachelors Analytics, Engineering, Statics or related.\n4+ years Credit Risk, Fraud Risk, Marketing Analytics, Optimization, Operations Analytics, Modeling/Data Science or related\nBonus Points If You Have\nMasters Analytics, Engineering, Mathematics or Statistics\nMarketing and/or Operations experience\nExperience in SQL, Python and Tableau\nPhysical and Cognitive Requirements\nThe physical requirements described here are representative of those that must be met by an employee to successfully perform the essential functions of this position. Reasonable accommodations may be made to enable a qualified individual with disabilities to perform the essential functions of the position as required by federal, state, and local laws:\nPrimarily remain in a stationary position.\nNo required movement about the work environment to complete the major responsibilities of the job.\nNo\nPrimarily performed indoors in an office setting.\nAbility to operate office equipment such as but not limited to computer, telephone, printer, and calculator.\nAbility to communicate verbally. Ability to communicate in written form.\nTravel Requirements - No\nDiscover will not sponsor or transfer employment work visas for this position. Applicants must be currently authorized to work in the United States on a full-time basis.\nApplication Deadline:\nThe application window for this position is anticipated to close on Sep-03-2025. We encourage you to apply as soon as possible. The posting may be available past this date, but it is not guaranteed.\nCompensation:\nThe base pay for this position generally ranges between $105,500.00 to $147,100.00. Additional incentives may be provided as part of a market competitive total compensation package. Factors, such as but not limited to, geographical location, relevant experience, education, and skill level may impact the pay for this position.\nBenefits:\nWe also offer a range of benefits and programs based on eligibility. These benefits include:\nPaid Parental Leave\nPaid Time Off\n401(k) Plan\nMedical, Dental, Vision, & Health Savings Account\nShort and Long Term Disability, Life, and Accidental Death & Dismemberment insurances\nRecognition Program\nEducation Assistance\nCommuter Benefits\nFamily Support Programs\nEmployee Stock Purchase Plan\nLearn more at mydiscoverbenefits.com .\nWhat are you waiting for? Apply today!\nAll Discover employees place our customers at the very center of our work. To deliver on our promises to our customers, each of us contribute every day to a culture that values compliance and risk management.\nDiscover , a division of Capital One, N.A., is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veteran status, or other legally protected status. (Know Your Rights)\nDiscover complies with federal, state, and local laws applicable to qualified individuals with disabilities and is committed to providing reasonable accommodations. If you require a reasonable accommodation to search for a position, to complete an application, and/or to participate in an interview, please email HireAccommodation@discover.com . Any information you provide regarding your accommodation needs will be kept confidential and will only be used to determine and provide necessary accommodation.\nAt Discover, we are committed to creating an inclusive and equitable workplace through our Fair Chance Hiring practices. Fair Chance Hiring means that we base our hiring decisions on an applicant’s qualifications rather than their criminal record. All our positions are subject to Section 19 of the Federal Deposit Insurance Act. Our applicants go through a background check, and we follow all applicable local laws, including the Los Angeles County Fair Chance Hiring Ordinance ( LA County Fair Chance ).\nPositions marked as remote eligible are limited to remote locations within the country in which the position is based.\nApplicants must be 18 or older at the time of hire.",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=eb2b902a66ad4582&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflr5mlj72i8c2&spon=0&xkcb=SoBw67M3pvjjZ8QpQ50CbzkdCdPP&xfps=7a0e7bbc-6de4-4cd3-8620-55ca6e4bdb2d&vjfrom=vjs&asub=mob&astse=e891336a0bf6d50d&assa=9199"
}