{
  "filename": "page2_job4_Data_Analyst_and_Tableau_Developer.html",
  "job_title": "Data Analyst and Tableau Developer",
  "company": "Gantec Publishing Solutions",
  "location": "Schaumburg, IL",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:30:21.213Z",
  "full_description": "\\n\n\\n\nRole: Data Analyst and Tableau Developer (Full time)\n\\n\nLocation: Schaumburg, IL\n\\n\nDescription :\n\\n\n\\n\nDevelops and maintains a standard methodology for documenting and codifying requirements and specifications using standard templates that meet the needs of both business partners and ITS.\n\\n\nDevelop prototypes using reporting software & BI tools to model and iterate requirements, and ensure the appropriateness of chosen solutions.\n\\n\nWork with business partners and process owners to document data, reporting and BI requirements and performance targets.\n\\n\nProvide analytical support for the development and deployment of solutions, and collaborates with developers and end-users to insure that application functionality meets business needs.\n\\n\nContributes to the deployment planning, including training, communications and user readiness planning.\n\\n\nDevelop metrics to monitor data quality.\n\\n\nAnalyze and resolve data quality and reporting issues.\n\\n\nDevelops test cases and scenarios, and actively participates in the testing and quality assurance process\n\\n\n\\n\nSkills:\ntableau, SQL, PYTHON, REDSHIFT, SAS\n\\n\nMinimum Education Requirement:\nThis position requires, at a minimum, a bachelor’s degree in computer science, computer information systems, information technology, or a combination of education and experience equating to the U.S. equivalent of a Bachelor’s degree in one of the aforementioned subjects\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Category:\nIT\\n\n\\n\n\\n\nJob Type:\nFull Time\\n\n\\n\n\\n\nJob Location:\nUSA\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=456134a7b5c854a0&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflmfhii8qp835&spon=0&xkcb=SoDa67M3pvjWLbWEiJ0PbzkdCdPP&xfps=9c0d61fb-5e21-4733-badc-14f90fdd0f37&vjfrom=vjs&asub=mob&astse=352319f9a555cdb0&assa=1506"
}