{
  "filename": "page2_job8_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "Primera Engineers",
  "location": "Chicago, IL 60661•Hybrid work",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:31:02.438Z",
  "full_description": "\\n\nPOSITION SUMMARY\n\\n\nSupport business consulting through data collection and analysis to provide strategic and meaningful advisory services to clients. Utilize your analytical skills to address client challenges and provide innovative solutions to complex business problems. Previous work experience with utility industry and consulting experience is beneficial, but not required.\n\\n\n\\n\nWHO WE ARE\n\\n\nWe’re a people-first organization. We value knowledge and learning. We believe in the power of connection and collaboration and we seek to build relationships that mean something. We employ some of the best and brightest in the industry and we work hard to maintain a culture that our people can be proud of.\n\\n\n\\n\nWORKING FOR PRIMERA\n\\n\nOur Business Consulting division is a talented team of experts working together to deliver consulting solutions that keep our clients’ businesses moving forward. As if we are an extension of their team, we provide full-service planning, design and implementation business services on everything from Project Management Office organizations to Gap Analysis and Process Improvements, including Reporting Systems and Risk Management for infrastructure systems and assets.\n\\n\n\\n\nWHO YOU ARE\n\\n\n\\n\nYou’re a business and data analytics enthusiast. You’re highly-motivated with one to three years of relevant business experience in a client facing role. A bachelor’s degree is a must; previous experience in the utility or consulting industries will help you stand out. Project experience is preferred.\n\\n\nYou’re a well-organized, detail-oriented go-getter. You have mature developed business and consulting skills. You are customer-service focused, resourceful, have the ability to self-direct and complete multiple projects and tasks at the same time. You can accept and understand direction from multiple sources and prioritize as needed to deliver results.\n\\n\nYou’re a people person. You have a positive attitude and enjoy developing relationships with staff and clients alike. You have exceptional communication skills, including the ability to listen and ask clarifying questions.\n\\n\nYou’re a critical thinker. As a consultant, you ask questions and propose ideas and solutions. Not only can you identify and define problems, but you can diplomatically analyze the issues and help create workable solutions.\n\\n\nYou’re an Excel expert. You’re very comfortable working across the Microsoft Office suite, particularly with Excel and Power BI.\n\\n\n\\n\n\\n\nWHAT YOU’LL DO\n\\n\n\\n\nYou’ll help transform business needs into solutions. As consultants, our clients rely on us to solve their most complex issues. You’ll be tasked with opportunities to present issues, solutions, and options to your team members and our clients in a clear, effective, and appropriate-to-their-level manner.\n\\n\nYou’ll analyze data, design reports, and validate problems and solutions. You’ll gather and summarize data and facts and deduce logical conclusions.\n\\n\nYou’ll collaborate. You’ll work closely with others and communicate with staff and clients at all levels. You may support multiple projects at once, attend regular meetings, and report progress accordingly.\n\\n\nYou’ll enjoy what you do. You’ll work with great people, continue to learn and grow, and have a good time doing it.\n\\n\n\\n\n\\n\nSOME OF WHAT YOU’LL ENJOY\n\\n\n\\n\nAn excellent benefits package including 401K match, gym and transit subsidies, continuing education reimbursement and much more\n\\n\nA fun, inclusive, and collaborative environment\n\\n\nThe fruits of our employee-led committees focused on offering engaging social, wellness and community service activities all year long\n\\n\n\\n\n\\n\nFor more information about Primera please visit our website: PrimeraEng.com.\n\\n\n\\n\nEqual Employment Opportunity\n\\n\nPrimera is committed to the principles of equal employment opportunity. Primera’s practices and employment decisions, including those regarding recruitment, hiring, assignment, promotion and compensation, shall not be based on any person’s race, color, creed, religion, national origin, sex, age, ancestry, disability, physical handicap, marital status, sexual orientation, veteran status, citizenship status or other protected group as defined by law\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=900e332dbd082010&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflmfhii8qp835&spon=0&xkcb=SoCu67M3pvjWLbWEiJ0DbzkdCdPP&xfps=f55dabe2-5dc0-49ce-9f34-0a2685fe2c7b&vjfrom=vjs&asub=mob&astse=8145ce8213e96cd5&assa=2686"
}