{
  "filename": "page4_job7_Inside_Sales_Data_Analyst.html",
  "job_title": "Inside Sales Data Analyst",
  "company": "Progress Rail",
  "location": "La Grange, IL",
  "salary": "$50,050 - $85,696 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:36:26.384Z",
  "full_description": "\\n\n\\n\n\\n\nJob Purpose\n\\n\n\\n    The Inside Sales Data Analyst is a critical component of the Aftermarket Service team. Each representative provides oversight and administration of customer demands placed for PRL products sold to Railroads, Marine Propulsion, Offshore and Land-based oil well drilling rigs, and Stationary Power Generations markets.\\n\n\\n\n\\n\n\\n\nReq ID\n\\n\n\\n    11342BR\\n\n\\n\n\\n\n\\n\nWork Location Options\n\\n\n\\n    Other suitable Locations: LaGrange IL, Belton MO, Fort Worth TX, Peru IN\\n\n\\n\n\\n\n\\n\nCity\n\\n\n\\n    La Grange\\n\n\\n\n\\n\n\\n\nState:\n\\n\n\\n    Illinois\\n\n\\n\n\\n\n\\n\nCompany Description\n\\n\n\\n    Progress Rail stands at the intersection of legacy and innovation—driving the future of rail with a pioneering spirit. Since its founding in 1983, the company has grown to become one of the world’s largest and most trusted providers of railroad products, services, and technologies. Today, Progress Rail delivers a comprehensive portfolio of cost-effective solutions to railway customers around the globe. From the rails themselves to the EMD® locomotives that ride them, the company’s products are in operation across more than 100 countries—powering progress and connecting communities. In 2006, Progress Rail joined Caterpillar Inc., further strengthening its ability to lead the rail industry with cutting-edge technology, unmatched expertise, and a commitment to excellence. At Progress Rail, the team is not just building the future of rail—they are making history every day.\\n\n\\n\n\\n\n\\n\nKey Job Elements\n\\n\n\\n\nWork with the Inside Sales Representative and Management to facilitate the quote to cash process\n\\n\nConduct a daily review of inbound overnight EDI demands, both for allocation and smoothing of demand signals against forecasted items\n\\n\nHandle 1-2 accounts as the Inside Sales Rep, to immediately move into any open role on the team\n\\n\nConduct a daily review of the overall open order backlog against all avenues of fulfillment\n\\n\nConduct a daily review of non-executable demand lines & work with the internal team for quickest resolution\n\\n\nAssist in the transfer of information from customer portals for the Inside Sales Rep\n\\n\nSupport any initiative and projects related to cleansing SAP data, as it relates to an ongoing ERP implementation into LN\n\\n\nIdentify process issues and participate in the development and implementation of process improvements\n\\n\nSupport the growth initiatives of the business\n\\n\nWork with Global Supply Chain buyer/planners to resolve material issues, leading to improve on-time delivery to customers\n\\n\nMake use of problem solving/decision making skills to achieve the highest level of customer satisfaction\n\\n\nWillingness to travel up to one week per month to assist with business-critical projects\n\\n\n\\n\n\\n\n\\n\nEducation / Training\n\\n\n\\n\nFour-Year College Degree (Marketing focus)\n\\n\n\\n\n\\n\n\\n\nQualifications and Experience\n\\n\n\\n    Required:\n\\n\n\\n\nExperienced computer user – MS Office suite, SAP, LN etc.\n\\n\nExcellent interpersonal verbal and written communication skills.\n\\n\nDetailed, accurate and able to set priorities among competing demands.\n\\n\nSelf-starter, dependable and efficient.\n\\n\nFocused, responsive to deadlines.\n\\n\nAbility to travel (up to one week per month).\n\\n\nPreferred:\n\\n\n\\n\nSAP or Infor LN experience.\n\\n\nSome inside/outside sales or customer service experience.\n\\n\nProject Management experience.\n\\n\nMultilingual.\n\\n\nEssential and Physical Activities Functions:\n\\n\n\\n\nStrength – Position involves work in a standard office environment. Frequent sitting. Occasional standing, walking. Rare lifting.\n\\n\nMotion – Position requires standard repetitive motions and hand/eye coordination associated with research and central office communications.\n\\n\nVision/Hearing Requirements – Frequent communications, including both talking and hearing.\n\\n\nWork Environment – Position will typically be located in an office environment.\n\\n\nEmotional Demands – Position is vital to the organization, as no service or support product can enter multiple Progress Rail facilities with Sourcing Team; high degree of flexibility and demand with ability to work with a team to accomplish the mission.\n\\n\nSafety – Position is primarily limited to general office safety and travel requirements.\n\\n\n\\n\n\\n\n\\n\n\\n\nBenefits\n\\n\n\\n    Compensation and benefits offered may vary depending on multiple individualized factors, job level, market location, job-related knowledge, skills, individual performance, and experience. Please note that salary is only one component of total compensation at Progress Rail.** \\n\n\\n\nCompetitive Salary\n\\n\n401(k) plan with up to 6% company match (no waiting period with immediate vesting)\n\\n\nMedical/Dental/Vision/Life/Disability Insurance\n\\n\nSupplemental Accident, Critical Care, and Hospital Insurance available along with an HDHP and HSA with seed money\n\\n\nFlexible Spending Accounts\n\\n\nPaid Vacation\n\\n\nPaid Holidays\n\\n\nPaid Time-Off (PTO)\n\\n\nEmployee Assistance Plan\n\\n\nEducation Assistance Program\n\\n\nEmployee Recognition Programs\n\\n\nSite specific Production and Incentive Plans\n\\n\nSite specific Step and Skill Level Wage Adjustment Plans\n\\n\nSite Specific Relocation and Sign-on Bonus Programs\n\\n\n\\n\n\\n\nBenefits eligibility varies by job position, full-time/part-time and regular/temporary status. The provisions of the plan documents control such benefits.\n\\n\n**Subject to position, eligibility, and plan guidelines.\n\\n\n\\n\n\\n\n\\n\nEEO\n\\n\n\\n    Progress Rail is an Equal Opportunity Employer, including Veterans and Individuals with Disabilities.\n\\n\n\\n\n\\n\n\\n\nJob Category\n\\n\n\\n    Marketing, Sales and Service\\n\n\\n\n\\n\n\\n\nPRS Facility Location\n\\n\n\\n    EMD HQ LaGrange, IL - 400\\n\n\\n\n\\n\n\\n\nSummary Pay Range\n\\n\n\\n    $50,050 - $85,696\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=84c4f9cd166ea103&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfm0ebsjn1a8cm&spon=0&xkcb=SoAd67M3pvkOCiyJaB0MbzkdCdPP&xfps=1817f14d-a2bd-4613-9fef-0c97705cf31c&vjfrom=vjs&asub=mob&astse=14336f284d8f808c&assa=6660"
}