{
  "filename": "page3_job14_Tax_Analyst__Compliance_and_Reporting.html",
  "job_title": "Tax Analyst- Compliance and Reporting",
  "company": "Mars",
  "location": "Chicago, IL 60642",
  "salary": "$81,944 - $112,669 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:34:16.946Z",
  "full_description": "\\n\n\\n\nJob Description:\n\\n\nYou are a Tax Analyst in the Compliance & Reporting (\"C&R\") function within the Global Tax Organization supporting all business segments of Mars Incorporated. You play a critical role in the entire tax reporting cycle, including the global tax provision, federal compliance, and state compliance. As a critical member of the Global Tax Organization, you are responsible for driving effective tax advisor service to all the businesses in the U.S. You are a key contributor in transforming tax processes and translating knowledge into actionable insights.\n\\n\n\\n\nWhat are we looking for?\n\\n\nBachelor’s degree in accounting or finance from an accredited university required\n\\n\n\\n\nMaster’s degree in taxation encouraged\n\\n\n\\n\nCertified Public Accountant license or Enrolled Agent license encouraged\n\\n\n\\n\n1-2 years of corporate tax experience, including Federal, state tax, international tax, with some public accounting experience preferred\n\\n\n\\n\nExperience in data analytics systems (Alteryx, Power Query, Power BI, Tableau) with implementation experience preferred\n\\n\n\\n\nExperience using and implementing workflow tools, such as SharePoint, Microsoft Teams, or Smartsheet applications\n\\n\n\\n\nExperience working within a team environment, including with individuals in various geographic locations\n\\n\n\\n\nWhat will be your key responsibilities?\n\\n\n\\n\nPrepare U.S. tax reporting of Federal & state tax returns for domestic corporation, Professional Corporations and partnerships and disregarded entities\n\\n\n\\n\nPrepare and review US GAAP income tax provisions and FIN 48 positions for domestic corporation, domestic and foreign partnerships, foreign corporations and disregarded entities\n\\n\n\\n\nProvide business support all U.S. business units, Including forecasts and cash tax planning\n\\n\n\\n\nPrepare other tax reporting – withholding tax, sales & use tax, and gross receipts tax.\n\\n\n\\n\nBe a key resource of tax process improvements for efficiency and digital transformation using data analytic tools (macro, pivot tables, index, VLOOKUP, Alteryx, Tableau)\n\\n\n\\n\nContinuous review of tax compliance process effectiveness and communication of ideas for process improvements in the tax department for efficiency\n\\n\n\\n\nResearch income tax issues and communicate findings.\n\\n\nWhat can you expect from Mars?\n\\n\nWork with diverse and talented Associates, all guided by the Five Principles.\nJoin a purpose driven company, where we’re striving to build the world we want tomorrow, today.\nA strong focus on learning and development support from day one, including access to our in-house Mars University.\nAn industry competitive salary and benefits package, including company bonus.\n\\n\n\\n\nThe base pay range for this position at commencement of employment is between the range listed below, however, base pay offered may vary depending on multiple individualized factors, including but not limited to job-related knowledge, skills, and experience. The total compensation package for this position will include variable pay, medical and dental benefits, participation in 401k plan, and paid time off benefits. Details of participation in these benefit plans will be provided if an applicant receives an offer of employment.\n\\n\nThe pay range listed is applicable to IL:USD 81,944.00 - USD 112,669.00\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=6e7207a3bccca585&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflr5mlj72i8c2&spon=0&xkcb=SoBj67M3pvjjZ8QpQ50GbzkdCdPP&xfps=f7728158-4557-4218-a1ce-20c943e2a4ea&vjfrom=vjs&asub=mob&astse=2cfb2b0cb230490b&assa=431"
}