{
  "filename": "page3_job1_Intermediate_Business_Intelligence_Analyst__Full_t.html",
  "job_title": "Intermediate Business Intelligence Analyst, Full time - Days",
  "company": "The University of Chicago Medicine",
  "location": "5841 South Indiana Avenue, Chicago, IL 60637",
  "salary": "$85,300 - $99,500 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:32:24.401Z",
  "full_description": "\\n Job Description: \\n\n\\n  Be a part of a world-class academic healthcare system, Company, as a\nIntermediate Business Intelligence Analyst\nin the Rev Cycle Department. This position will be primarily a work from home opportunity with the requirement to come onsite as needed. You may be based outside of the greater Chicagoland area.\\n\n\\n\n\\n\n\\n\nThe BI Analyst is accountable for creating reporting solutions to improve visibility into the organizations financial performance. Analyst will leverages industry best practices for report development and build framework for enterprise-wide deployment of financial performance dashboards and reports. Collaborates with interdisciplinary teams across the organization and is a steward of report development and maintenance of best practices within the finance area. Has a full technical knowledge of the data sources and systems across the UCM network. This position is part of the Hospital Revenue Cycle Team and will primarily be focused on hospital billing-related analytics and report development.\\n\n\\n\n\\n\nEssential Job Functions\n\\n\n\\n\nSupports evaluation of organizational performance that combines financial and operational results data. Involved in financial pro forma modeling to support business planning.\n\\n\nMaintain an appropriate portfolio of work. Updating reports and queries to match the most appropriate specifications and versions of technology available. Collaborator in the process development for reviewing old, current, and new reports shared at the system level.\n\\n\nDevelop and own the rules necessary in order to diagnose the health and stability of system-wide reports and measures, complementary to enterprise-level rulesets and activities.\n\\n\nAd-hoc analysis and Other Duties as Assigned\n\\n\n\\n\n\\n\nRequired Qualifications\n\\n\n\\n\nBachelor degree in Finance, Business, Statistics, Healthcare Administration, Computer Sciences or IT\n\\n\n1 year post undergraduate experience in an analyst role focused on business processes related to finance, revenue cycle or healthcare operations preferred\n\\n\nKnowledge of the US health care system (preferred)\n\\n\nStrong analytical and technical skills (excel and T-SQL experience required)\n\\n\nFamiliarity with Tableau, Spotfire or other data visualization tools\n\\n\nAbility to perform custom analyses based on guidance from business teams\n\\n\nSelf-motivated and able to plan and organize tasks across multiple projects\n\\n\n\\n\n\\n\n\\n\nPosition Details\n\\n\n\\n\n\\n\nJob Type: Full Time (1.0FTE)\n\\n\nShift: Days\n\\n\nWork Location: Full Time Remote\n\\n\nUnit/Department: Revenue Cycle\n\\n\nCBA Code: Non-Union\n\\n\nWhy Join Us: \\n\n\\n\nWe’ve been at the forefront of medicine since 1899. We provide superior healthcare with compassion, always mindful that each patient is a person, an individual. To accomplish this, we need employees with passion, talent and commitment… with patients and with each other. We’re in this together: working to advance medical innovation, serve the health needs of the community, and move our collective knowledge forward. If you’d like to add enriching human life to your profile, UChicago Medicine is for you. Here at the forefront, we’re doing work that really matters. Join us. Bring your passion.\n\\n\n\\n\n\\n\n\\n\nUChicago Medicine is growing; discover how you can be a part of this pursuit of excellence at:\nUChicago Medicine Career Opportunities\n\\n\n\\n\n\\n\n\\n\nUChicago Medicine is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, ethnicity, ancestry, sex, sexual orientation, gender identity, marital status, civil union status, parental status, religion, national origin, age, disability, veteran status and other legally protected characteristics.\n\\n\n\\n\n\\n\n\\n\nAs a condition of employment, all employees are required to complete a pre-employment physical, background check, drug screening, and comply with the flu vaccination requirements prior to hire. Medical and religious exemptions will be considered for flu vaccination consistent with applicable law.\n\\n\n\\n\n\\n\n\\n\nCompensation & Benefits Overview\n\\n\n\\n\n\\n\n\\n\nUChicago Medicine is committed to transparency in compensation and benefits. The pay range provided reflects the anticipated wage or salary reasonably expected to be offered for the position.\n\\n\n\\n\n\\n\n\\n\nThe pay range is based on a full-time equivalent (1.0 FTE) and is reflective of current market data, reviewed on an annual basis. Compensation offered at the time of hire will vary based on candidate qualifications and experience and organizational considerations, such as internal equity. Pay ranges for employees subject to Collective Bargaining Agreements are negotiated by the medical center and their respective union.\n\\n\n\\n\n\\n\n\\n\nReview the full complement of benefit options for eligible roles at\nBenefits - UChicago Medicine\n.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}