{
  "filename": "page2_job7_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "City of South Bend",
  "location": "South Bend, IN 46601•Hybrid work",
  "salary": "$58,686 - $63,796 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:30:52.082Z",
  "full_description": "\\n\nSALARY\n: up to $58,686 - $63,796\n\\n\nSUMMARY\nJoin a team dedicated to reinventing City government. As a Business Analyst on the Data & Performance Team, you will be at the heart of South Bend’s innovation efforts. You won’t just analyze spreadsheets, you will serve as a strategic partner that uses data, human-centered design, and empathy to improve how the City serves its residents.\n\\n\nIn this role, you will bridge the gap between complex data and real-world operational improvements. This is a high-visibility position where your insights will directly influence City strategy and the resident experience.\n\\n\nYou’re the right fit for the Business Analyst position if:\n\\n\n\\n\nYou love problem-solving: You enjoy building relationships with City teams to identify process pain points, map service delivery workflows, build data pipelines, and co-create solutions that achieve measurable results.\n\\n\nYou love human-centered design and empowering others. You prioritize the resident experience. You’re comfortable conducting research to build empathy, launching prototypes, and helping teams take new services live.\n\\n\nYou love analyzing data to take action: You can move from quantitative analysis to qualitative inquiry (focus groups/observations) to develop compelling visualizations and strategic recommendations. You can design evaluations to assess new initiatives, performance, and recommend corrective action to achieve strategic business objectives.\n\\n\n\\n\nThe Business Analyst reports to the Director of Data and Performance and is in the Department of Innovation & Technology. I&T is an award-winning, nationally recognized government technology team. Candidates that thrive in this Department have a good attitude, a customer service mindset, and a love of learning. Learn more about the Department here: https://medium.com/innovation-in-south-bend\n\\n\nAs a leader and employee of the City of South Bend, you are called upon to serve in a manner that supports Our Core Values: Excellence, Accountability, Innovation, Inclusion, and Empowerment as you carry out our primary employee expectations: Champion Values & Organizational Pride, Champion Operational Excellence, Make Sound Decisions, Embrace Coaching and Accountability, Communicate with Excellence, Value Diverse People and Perspectives, Embrace Personal Development, Exhibit a Positive Attitude and Own Your Health, Wellness & Safety\n\\n\nSUPERVISION EXERCISED\n: Interns and office volunteers as needed.\n\\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\n\\n\nService Innovation & Human-Centered Design\n\\n\n\\n\nProcess Transformation: Use human-centered design (HCD) and behavioral science to audit existing workflows and co-create ways to improve the experience of both City staff and residents.\n\\n\nSystem Implementation: Recommend and help deploy new software systems and operational processes, ensuring they meet user needs and business requirements.\n\\n\nOpen Data & Transparency: Identify opportunities to increase public trust by preparing and publishing datasets for the City’s Open Data portal.\n\\n\n\\n\n\\n\nStrategic Performance Management\n\\n\n\\n\nLead Performance Management Initiatives: Drive the City’s performance management program by analyzing departmental data to track KPIs, identify trends, and advance policy initiatives.\n\\n\nPerformance Reporting: Generate periodic, high-impact reports and dashboards that evaluate the efficiency of City departments and provide recommendations for corrective action.\n\\n\nPolicy Analysis: Assist in the research, revision, and implementation of City policies and procedures based on rigorous data evidence.\n\\n\n\\n\n\\n\nData Literacy & Capacity Building\n\\n\n\\n\nFacilitate SB Academy: Design and deliver training programs that empower City staff to use data analytics, performance improvement tools, and innovation methods.\n\\n\nData Quality Governance: Utilize modern reporting tools to monitor and improve the quality, accuracy, and accessibility of data across various departments.\n\\n\nStrategic Support: Act as an internal consultant to City departments, supporting project scoping, analysis, and implementation to improve operational efficiency and decision-making.\n\\n\n\\n\n\\n\nQUALIFICATIONS\n\\n\nTo perform this position successfully, an individual must be able to perform each essential duty in a satisfactory manner. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\\n\nEDUCATION AND/OR EXPERIENCE:\n\\n\n\\n\nEducation: A Bachelor’s degree or advanced education in Business Analytics, Data Science, Public Administration, Social/Political Science, or a related field. We value a diverse range of educational backgrounds that prioritize analytical thinking.\n\\n\nExperience: Proven experience in data analysis and a track record of translating complex information into clear, actionable insights for non-technical audiences.\n\\n\nCommunication: Exceptional oral and written communication skills. You should be comfortable presenting to stakeholders, facilitating workshops, and \"storytelling\" with data.\n\\n\n\\n\n\\n\nKNOWLEDGE AND ABILITY:\n\\n\nThe Technical Toolkit\n\\n\n\\n\nData Visualization: Proficiency in Microsoft Excel and experience with Business Intelligence tools to create compelling dashboards.\n\\n\nSpatial Analysis: Familiarity with GIS (Geographic Information Systems) is a strong plus, as locationbased data is core to city operations.\n\\n\nData Management: Ability to review and organize data, knowledge of good data management techniques.\n\\n\nAdvanced Analytics: Experience with SQL, Python, or R is desired to perform deeper analysis or automation.\n\\n\n\\n\n\\n\nThe Human Element\n\\n\n\\n\nConsultative Mindset: A high degree of comfort managing change and working with diverse stakeholders. You can build trust and navigate \"office politics\" to drive process improvements.\n\\n\nHuman-Centered Design: A working knowledge of (or a deep interest in) HCD principles – building empathy, prototyping, and testing solutions based on user behavior.\n\\n\nInstructional Ability: Comfort training others. You don’t just do the work, you enjoy teaching colleagues how to use new tools and methods.\n\\n\nAdaptability: Ability to balance independent project work with highly collaborative team efforts.\n\\n\nIntegrity: Experience handling sensitive information with the highest level of privacy and discretion.\n\\n\n\\n\n\\n\nCERTIFICATES, LICENSE, REGISTRATION:\n\\n\n\\n\nValid Indiana Driver’s License required\n\\n\n\\n\n\\n\nEQUIPMENT\n\\n\n\\n\nDesktop computer or laptop, telephone, copy machine, scanner\n\\n\n\\n\n\\n\nPHYSICAL DEMANDS\n:\n\\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is frequently required to sit and walk, and talk or hear. The employee is occasionally required to walk; use hands to fingers, handle or feel objects, tools or controls; and reach with hands and arms. The employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required in this job include vision and the ability to adjust focus.\n\\n\nWORK ENVIRONMENT\n\\n\nWork is performed in an office setting with moderate inside temperatures. The noise level in the work environment is usually quiet to moderate in the office. Entire office is smoke free. This position is based in South Bend, Indiana. This position is eligible for hybrid work in the Department of Innovation & Technology, as long as engagement with city teams and work performance remains high.\n\\n\nREQUIRED:\n\\n\nPre-Employment Drug Screen Pre-Employment Background Check\n\\n\nEqual Employment Opportunity Employer\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=944e20884204f853&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflmfhii8qp835&spon=0&xkcb=SoBH67M3pvjWLbWEiJ0MbzkdCdPP&xfps=7653a141-56cb-438c-92fc-4f337c9411bc&vjfrom=vjs&asub=mob&astse=143c4396f67a8644&assa=2356"
}