{
  "filename": "page4_job5_Business_Analyst__Finance_Domain__5.html",
  "job_title": "Business Analyst (Finance Domain)-5",
  "company": "Realign LLC",
  "location": "Chicago, IL",
  "salary": null,
  "job_type": "Contract",
  "scraped_at": "2025-12-27T10:36:03.956Z",
  "full_description": "\\n\nJob Type: Contract\n\\n\nJob Category: IT\n\\n\n\\n\n\\n\nTitle : Business Analyst (Finance Domain)\n\\n\n\\n\n\\n\nLocation : Chicago, IL\n\\n\n\\n\n\\n\nResponsibility\n:\\n\n\\n\n\\n\n1. Good level of experience on a business analysts or tester role.\n2. Must have good knowledge and expertise on finance (Capital market)\n3. Experience/Knowledge in Treasury products like Fixed Income, \"Money Market and Derivative instruments\n4. Should have worked on Fixed income securities EZE trade life cycle, reference data like Interest rates, Ratings and FX rates. Should have worked on Repos, Rev repos, Pledges and intercompany borrowing\nShould have knowledge or worked on accounting of HTM and AFS.\n5. Should have good expertise on Eurodollar and Fed Funds transactions. Knowledge on accounting of Money market trades. Should have worked on real time trade settlement (products like MTS).\n6. Good experience on different types Derivative trades like, plain vanilla swaps, Bermudan swaps, exotic, TRS, FRA, Basis swaps, European swaps and different types of Swaptions too. Should have knowledge on various curves, Cash flows and accounting. Should have knowledge on CFTC process.\n7. Should have knowledge on Regulatory Reporting\n8. Should be able to understand the requirements from business partners and translate them into requirement documents for the IT development team\n9. Should have technical knowledge as well ie., batch or sever related, basic SQL knowledge, etc\n\\n\n\\n\nRequired Skills\n\\n\nBUSINESS CONTINUITY ANALYST\n\\n\nDATA ANALYST\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=383d34b74e11f9d4&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfm0ebsjn1a8cm&spon=0&xkcb=SoA067M3pvkOCiyJaB0ObzkdCdPP&xfps=24abc020-7689-4c68-9d10-9c9b46b27c33&vjfrom=vjs&asub=mob&astse=21df3241549641b4&assa=4236"
}