{
  "filename": "page1_job7_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "Harris & Harris",
  "location": "111 West Jackson Boulevard, Chicago, IL 60604",
  "salary": "$18 an hour",
  "job_type": null,
  "scraped_at": "2025-12-27T10:27:41.674Z",
  "full_description": "\\n\nHarris & Harris has more than 50 years of experience in revenue recovery and customer care, specializing in the utilities, government, and healthcare markets. We’re looking for a friendly, professional, and motivated\nData Analyst\nto join our\nClient Service\nteam. If you’re looking for an organization that embraces the principles of respect, compassion, and trust, apply today!\n\\n\nOur\nData Analysts\nanalyze, identify, and interpret patterns and trends in client data utilizing multiple systems. They then make recommendations to resolve exceptions and help us define process improvement opportunities.\n\\n\nLocation:\nWill by hybrid - in office on Jackson Blvd Downtown Chicago 3 days per week, at home 2 days per week\n\\n\nSalary:\n18.00/hour\n\\n\nAdditional Compensation and Benefits:\n\\n\nAt Harris & Harris, we truly care about each employee’s health, wellness, financial stability, and education. We are proud to offer the following benefits:\n\\n\n\\n\nCompetitive Medical and Dental insurance from premium providers\n\\n\nPaid Time Off (PTO) and Wellness Days\n\\n\n401K with company matching\n\\n\nCompany paid Basic Life Insurance, Long Term Disability Insurance, Employee Assistance Program (EAP), and Travel Assistance.\n\\n\nTuition Reimbursement after 1 year of employment\n\\n\nAdditional benefits such as identity theft protection, flexible spending accounts, employee recognition events, pre-tax commuter benefits, and more.\n\\n\n\\n\nDAY TO DAY\n\\n\n\\n\nCompile data as directed to determine exception report workload volume, completing reports daily\n\\n\nCollect data using a variety of methods, including data mining and electronic documentation study\n\\n\nMake recommendations about the methods the department should use to collect, analyze and manage data to improve data quality and the efficiency of systems\n\\n\nFilter and “clean” data, review computer reports, printouts, and performance indicators to locate and rectify problems\n\\n\nCommunicate the results of the analysis as a comprehensive report to company leaders and decision-makers\n\\n\n\\n\nWHAT YOU MUST POSSESS\n\\n\nMust Have:\n\\n\n\\n\nStrong analytical, data-driven skills with the ability to collect, organize, analyze and disseminate significant amounts of information with attention to detail and accuracy\n\\n\nAbility to see through data and analyze it to find conclusions\n\\n\nExcellent written and verbal communication skills with an ability to present findings or translate data into an understandable document or presentation\n\\n\nProven work experience as a data analyst or related role\n\\n\nDemonstrated advanced Microsoft Word and Excel skills required\n\\n\n\\n\nNice To Have:\n\\n\n\\n\nExperience with data-mining preferred\n\\n\nExperience with CUBS (Columbia Ultimate Business System) a plus\n\\n\n\\n\nWHY HARRIS & HARRIS?\n\\n\nHarris & Harris is a premier, full-service revenue recovery firm headquartered and founded in Chicago, IL. Since 1968, we have been trusted partners of some of the country’s largest healthcare, utility, and government entities. Our clients benefit from our having more than 50 years in the business.\n\\n\nThe family business Samuel Harris started more than five decades ago is now a firm comprised of more than 500 hundred employees including our Collections and Customer Care professionals. Our teams employ the latest technology and best ethical practices to help businesses recover revenue and provide world class customer service.\n\\n\nWe take pride in knowing what it takes to turn a call from \"average\" to \"excellent\" and are proud to continue our strong history of delighting clients and customers thanks to our outstanding employees. They make the difference every day, shift, and call and transform challenges into victories. They are the lifeblood of what we do and who we are.\n\\n\nAt Harris & Harris, we’re proud to be an organization where everyone is welcome and can feel free to be their authentic selves at work. We’re passionate about celebrating the differences that make each of us unique. Our culture focuses on our employees and we look for opportunities to recognize and celebrate together. We are an organization that cares about our people. From monthly activities, bonuses and contests, to competitive wages and benefits, we foster an environment where our employees feel valued.\n\\n\nWe are also an organization that believes in the power of giving back. Our internal cross functional committee, Harris Cares, guides our philanthropic activities. We have partnered with organizations such as One Warm Coat, Greater Chicago Food Depository, American Cancer Society, Bright Pink, The Heat and Warmth Fund (THAW), and Operation Stars and Stripes. Most recently we have partnered with local schools and charitable organizations to give back to our communities including the American Heart Association, Habitat for Humanity, A Just Harvest, and R. Nathaniel Dett Elementary School.\n\\n\nAt Harris & Harris, everyone is important, and we believe that one person can make a difference for their colleagues, for our clients, and for our company. We look forward to hearing from you!\n\\n\nHarris & Harris is an equal opportunity employer. Applicants will not be discriminated against based on race, color, creed, sex, sexual orientation, gender identity or expression, age, religion, national origin, disability, ancestry, marital status, veteran status, medical condition or any protected category prohibited by local, state or federal laws.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}