{
  "filename": "page4_job9_Business_Strategy_Analyst.html",
  "job_title": "Business Strategy Analyst",
  "company": "Skybox Capital",
  "location": "Chicago, IL",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:36:49.931Z",
  "full_description": "\\n\nBusiness Strategy Analyst\n\\n\nLocation:\nChicago, IL (Hybrid)\nCompany:\nSkybox Capital\nTeam:\nInvestments\nReports To:\nVP of Investments\n\\n\nOverview\n\\n\nSkybox Capital, a family office and private equity firm, is seeking a highly analytical\nBusiness Strategy Analyst\nwith experience in financial reporting, forecasting, and performance analysis. This role will focus on supporting the growth of the\nmultifamily property management\nbusiness.\n\\n\nThe ideal candidate has an interest in real estate, and excellent grasp of fundamental accounting principles and financial review (income statements, balance sheets, cash flow). This role is designed for a detail-driven individual who enjoys digging into numbers, understanding operational drivers, and helping leadership make data-driven decisions. This is a high visibility role in a quickly growing organization and unique opportunity to work directly with senior leadership team members.\n\\n\nKey Responsibilities\n\\n\n1. Financial Review & Reporting\n\\n\n\\n\nAnalyze monthly, quarterly, and annual financial statements, with a focus on\nidentifying potential areas of opportunity for the business.\n\\n\nPrepare financial dashboards and reporting packages.\n\\n\nIdentify trends, operational drivers, and risks across the property portfolio.\n\\n\nAssist in forecasting the performance of the property management company, including staffing, maintenance, G&A expenses, and portfolio-wide operational impacts.\n\\n\n\\n\n3. System & Data Management\n\\n\n\\n\nWork with accounting, property management and business intelligence systems to\nextract, validate, and interpret financial and operational data.\n\\n\nEnsure accuracy of data feeds and reporting outputs across systems and spreadsheets.\n\\n\nImplement process improvements to enhance reporting accuracy, speed, and clarity.\n\\n\n\\n\n4. Cross-Functional Collaboration\n\\n\n\\n\nCollaborate closely with accounting/finance teams and operations teams to\nexecute leadership strategy.\n\\n\nSupport underwriting and scenario modeling for strategic growth opportunities, including M&A.\n\\n\nParticipate in quarterly business reviews and investment performance meetings.\n\\n\n\\n\nQualifications\n\\n\nRequired\n\\n\n\\n\nBachelor’s degree in Finance, Accounting, Economics, or related field.\n\\n\n1+ years of FP&A, finance, or consulting experience\n.\n\\n\nStrong understanding of\nincome statements, balance sheets, cash flow statements\n, and GAAP principles.\n\\n\nStrong Excel modeling skills (index/match, pivot tables, forecasting, scenario modeling).\n\\n\nAbility to interpret financial results and explain operational drivers clearly.\n\\n\nDetail-oriented, organized, and able to work in a fast-paced investment environment.\n\\n\n\\n\nNice-to-Have\n\\n\n\\n\nExperience working in a\nconsulting, investment banking, or FP&A\nsetting.\n\\n\nExposure to real estate property management.\n\\n\nAbility to build dashboards or reports in BI tools (Power BI preferred).\n\\n\n\\n\nWhy Join Skybox Capital?\n\\n\n\\n\nWork directly with investment team and company leadership in a lean, high-impact environment.\n\\n\nGain deep exposure to real estate operations, property management strategy, and portfolio company performance.\n\\n\nCompetitive compensation, bonus opportunity, and career development within a quickly growing firm.\n\\n\nA hands-on role where your analysis directly influences decisions on capital deployment, strategy, and investment oversight.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}