{
  "filename": "page3_job6_Exchange_Technology_Business_Analyst.html",
  "job_title": "Exchange Technology Business Analyst",
  "company": "Dream Exchange",
  "location": "Des Plaines, IL",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:33:08.077Z",
  "full_description": "\\n\nDream Exchange is creating a new stock exchange that will focus on small business capital formation and diversity using the power of the American investing public. This new stock exchange will allow investors to empower innovators and emerging businesses in a way that has never been done before.\n\\n\nThe purpose of the Business Analyst in the Dream Exchange is to discover, gather and document all information needed to create our functioning exchange.\n\\n\nThe sources of information are regulatory, our exchange partner, external exchange entitles such as clearing, surveillance, Security Information Processors, and others.\n\\n\nThe Business Analyst will organize the information along each purpose line, so it is readily available to each of the stakeholders that need it and the implementation team.\n\\n\nThe Business Analyst will work with the legal team in identifying, defining and documenting regulatory procedures.\n\\n\nRole Objectives:\n\\n\n\\n\nDiscovering, gathering and documenting all requirements, large and small.\n\\n\nCreating a system of organization so that the information is readily available, before it is needed.\n\\n\nWorking with Quality Assurance to ensure the requirements are verifiable in the finished product.\n\\n\n\\n\nResponsibilities:\n\\n\n\\n\nUse all avenues of communication to gather all needed requirements.\n\\n\nForm an image of competence and can-do attitude when representing the Dream Exchange.\n\\n\nWork with project manager and implementation team to ensure all knowledge is established and known in the form required.\n\\n\nTrack changes in requirements for change control needs.\n\\n\nEnsure that all work products that are defined in regulation are mappable back to a stated or referred regulatory requirement.\n\\n\nQualify all requirements with an eye towards usability.\n\\n\n\\n\nRequired Skills and Qualifications:\n\\n\n\\n\nMid to senior level experience working in a tight organization\n\\n\nExcellent verbal and written communication skills\n\\n\nSecurities regulation experience\n\\n\nAnalytical thinking and problem solving\n\\n\nDetail oriented\n\\n\nStakeholder analysis\n\\n\nBoth collaborative and independent work practice\n\\n\nResponsibility level necessary to provide solutions and not problems\n\\n\nInformation organization skills\n\\n\nWillingness to consider alternate views\n\\n\nProficient with Microsoft Office Suite or related software\n\\n\n\\n\nPreferred Skills and Qualifications:\n\\n\n\\n\nUnderstanding of networks, databases and other technology\n\\n\nPrior experience working in a National Market Exchange\n\\n\nComfortable working in a highly regulated environment\n\\n\n\\n\nPhysical Requirements:\n\\n\n\\n\nProlonged periods of sitting at a desk and working at a computer\n\\n\nMust be able to lift up to 15 pounds at times\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}