{
  "filename": "page2_job6_Power_BI_Analyst__Contract_.html",
  "job_title": "Power BI Analyst (Contract)",
  "company": "Blue Star Partners LLC",
  "location": "Chicago, IL",
  "salary": "$45 - $50 an hour",
  "job_type": "Full-time, Contract",
  "scraped_at": "2025-12-27T10:30:41.707Z",
  "full_description": "\\n\nJob Title:\nPower BI Analyst (Contract)\nLocation:\nChicago, IL (Abbott Park)\nWork Arrangement:\nHybrid – 4 days onsite, 1 day remote (flexible)\nContract Term:\nASAP – December 31, 2025 (Strong potential for extension)\nRate:\n$45 - $50/hour\nContract Type:\nW-2 Only (No visa sponsorship or C2C)\n\\n\nPosition Overview\n\\n\nWe are seeking a highly motivated\nPower BI Analyst\nto join a dynamic Scrum team supporting business intelligence initiatives at a global medical device company. This role is responsible for gathering and documenting business requirements, transforming data into actionable insights, and designing scalable Power BI dashboards and reports. The successful candidate will collaborate closely with business users, data engineers, and architects to ensure alignment with organizational goals and compliance with established standards.\n\\n\nKey Responsibilities\n\\n\n\\n\nCollaborate with business process owners to gather and document reporting requirements.\n\\n\nFacilitate user story creation and requirement documentation using Agile tools like Azure DevOps or JIRA.\n\\n\nDocument data ingestion and transformation processes to support ETL operations.\n\\n\nDesign, develop, and maintain interactive Power BI dashboards and reports.\n\\n\nWork closely with the BI Architect and Engineering teams to align with architectural standards.\n\\n\nParticipate actively in Agile ceremonies (daily stand-ups, backlog refinement, internal refinement).\n\\n\nSupport testing, documentation, and training of new BI solutions in line with Abbott SLC standards.\n\\n\nTriage and resolve help desk tickets related to BI tools and data reporting.\n\\n\nPromote a culture of continuous improvement, collaboration, and transparent communication across teams.\n\\n\n\\n\nRequired Qualifications\n\\n\n\\n\nMinimum 1 year of experience as a Business Intelligence Analyst or Power BI Analyst.\n\\n\nHands-on experience with Power BI (minimum 6–8 months).\n\\n\nStrong grasp of Power BI features such as report refresh setup and managing many-to-many relationships.\n\\n\nDemonstrated experience gathering and documenting business requirements.\n\\n\nExperience working in a Scrum or Agile development environment.\n\\n\nStrong understanding of data warehouse best practices and ETL processes.\n\\n\nExcellent written and verbal communication skills in English.\n\\n\nAbility to work independently, take ownership of deliverables, and communicate effectively with all levels of stakeholders, including senior leadership.\n\\n\nBachelor's degree (required for potential conversion to full-time employment).\n\\n\n\\n\nPreferred Qualifications\n\\n\n\\n\nExperience working with multicultural teams across multiple geographies.\n\\n\nFamiliarity with Microsoft Azure cloud services and data lake architecture.\n\\n\nPower BI or related technical certifications.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}