{
  "filename": "page3_job9_Business_Analyst___Supply_Chain_Design.html",
  "job_title": "Business Analyst - Supply Chain Design",
  "company": "Martin Brower",
  "location": "Rosemont, IL 60018•Hybrid work",
  "salary": "$73,291 - $91,614 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:33:37.701Z",
  "full_description": "\\n Responsibilities: \\n\n\\n\n*Hybrid role: Monday-Thursday in our Rosemont, IL Office and Friday's remote*\n\\n\n\\n\n\\n\n\\n\nPosition Responsibilities\n:\n\\n\n\\n\n\\n\nParticipate in the development of scenario modeling representing either the current network or potential scenarios\n\\n\nEnsure data and assumptions used as part of modeling techniques are suitable and vetted by business leads\n\\n\nDocument modeling approach, data sources, transformations, assumptions and constraints for review and future development\n\\n\nResponsible for evaluation of model outputs including physical product flows, operational metrics, and financial outcomes\n\\n\nPrepare internal and external presentations of modeling outputs as part of future strategy communication\n\\n\nCollaborate cross-functionally with both technical and non-technical groups, spanning all organizational levels including but not limited to: Strategy, Operations, Finance and Supply Chain teams\n\\n\nTravel could be up to 30% of the time and up to 50% in the first three months\n\\n\nOther duties as assigned\n\\n\nQualifications: \\n\n\\n\n\\n\nRequired Education and Experience:\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n     Bachelor’s degree with 3 plus years of related experience or High School Diploma and 6 plus years of specific experience\\n\n\\n\n\\n\nBenefits: At the Reyes Family of Businesses, our Total Rewards Strategy prioritizes the holistic well-being of our employees. This position offers a comprehensive benefits package that includes Medical, Dental, Vision coverage, Paid Time Off, Retirement Benefits, and complimentary Health Screenings. Equal Opportunity Employee & Physical Demands: Reyes Holdings and its businesses are equal opportunity employers. Company policy prohibits discrimination and harassment against any applicant or employee based on race, color, religion, sex, pregnancy or pregnancy-related medical conditions, marital status, sexual orientation, gender identity or expression, age, national origin, citizenship, disability, genetic information, military or veteran status, or any other basis protected by applicable law. In addition, the Company is committed to providing reasonable accommodation to applicants and employees in accordance with applicable law. Requests for accommodation should be directed to your point of contact in the Talent Acquisition or Human Resources departments. Background Check and Drug Screening: Offers of employment are contingent upon successful completion of a background check and drug screening. Pay Transparency: Our compensation philosophy embraces diverse factors for fair pay decisions, valuing skills, experience, and the needs of our business. Moreover, this role may have the opportunity to participate in a discretionary incentive program, subject to program rules.\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=ee7630f1a548cb5d&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflr5mlj72i8c2&spon=0&xkcb=SoDE67M3pvjjZ8QpQ50DbzkdCdPP&xfps=80fe94a0-4750-4ddd-a8c8-2d6a1387b687&vjfrom=vjs&asub=mob&astse=2e1aeae1fe1948b5&assa=2083"
}