{
  "filename": "page2_job11_Data_Analyst.html",
  "job_title": "Data Analyst",
  "company": "Strata Decision Technology",
  "location": "Chicago, IL",
  "salary": "$70,000 - $85,000 a year",
  "job_type": null,
  "scraped_at": "2025-12-27T10:31:34.513Z",
  "full_description": "\\n\nHow\nyou'll\nmake an impact:\n\\n\nAs a Data Analyst on the Data Science team, you will have the opportunity to work with many of the nation's leading healthcare providers in utilizing their financial, operational, and clinical data to drive their mission of providing world-class care while improving financial health. Your work will bring new insights to individual clients, client collaboratives and the industry. Responsibilities include:\n\\n\n\\n\nApplying data mining techniques and statistical analysis to healthcare and financial data across our client base\n\\n\n\\n\n\\n\nExtracting, cleansing, and validating the data used for analyses\n\\n\n\\n\n\\n\nDeveloping and maintaining automated processes and workflows to improve efficiency and consistency with handling data\n\\n\n\\n\n\\n\nExtending company's data with third party sources of information when needed\n\\n\n\\n\n\\n\nEnhancing data collection procedures to include information that is relevant for building analytic systems\n\\n\n\\n\n\\n\nWorking within the data science team to enhance the StrataSphere products\n\\n\n\\n\n\\n\nProviding quality assurance on StrataSphere products and working with data science team to correct errors\n\\n\n\\n\n\\n\nMeeting with clients and other Strata team members to answer their questions about the data or analytics\n\\n\n\\n\n\\n\nConducting ad-hoc analysis and presenting results in a clean, clear and actionable manner\n\\n\n\\n\n\\n\nCreating analytics in Tableau and Excel and sharing with clients and answering questions\n\\n\n\\n\n\\n\nCreating automated anomaly detection systems and constant tracking of its performance\n\\n\n\\n\n\\n\nPartnering with Data Scientists to assist in advanced modeling\n\\n\n\\n\nWhat\nwe're\nlooking for:\n\\n\n\\n\n1-3 years' experience using statistical data analysis techniques\n\\n\n\\n\n\\n\nExperience working with large, complex data sets\n\\n\n\\n\n\\n\nAbility to install and configure tools needed for analysis of large data sets\n\\n\n\\n\n\\n\nStrong scripting and programming skills using common data science languages such as R and Python.\n\\n\n\\n\n\\n\nAbility to present results of analysis to differing audiences within healthcare on both the financial and clinical side\n\\n\n\\n\n\\n\nExperience working with clients to investigate data challenges and collaborate with clients on solution development\n\\n\n\\n\n\\n\nExperience with data visualization tools, such as Tableau\n\\n\n\\n\n\\n\nProficiency in using SQL\n\\n\n\\n\n\\n\nExperience with cloud computing services such as AWS, Sagemaker and Snowflake\n\\n\n\\n\n\\n\nStrong applied statistics skills, such as distributions, statistical testing, regression, etc.\n\\n\n\\n\n\\n\nAn affinity to data science and wants to learn more\n\\n\n\\n\n\\n\nData-oriented personality\n\\n\n\\n\n\\n\nAbility to travel up to 10%\n\\n\n\\n\nEstimated Salary Range: $ 70,000 - 85,000\nActual salary will be determined based on factors including, but not limited to, skill set and level of experience. This salary range is a good faith estimate of base pay. Strata also provides discretionary variable pay programs based on role. In addition, Strata provides a comprehensive benefits package including retirement benefits, health and welfare benefits, paid time off, parental leave, life and accident insurance, and other voluntary and well-being benefits.\n\\n\n\\n\nFind out more about Strata benefits here.\n\\n\nHow we work:\nThe preferred location for this role is in Chicago, IL or St. Louis, MO. We value our people spending time together and have campuses hosting in-person events located in both cities. We are truly a hybrid environment with all team members experiencing the flexibility to work from home.\n\\n\nThinking about applying?\nResearch shows that women and underrepresented groups tend to apply to jobs only when they check every box on a job posting. If you're currently reading this and hesitating to click \"Apply\" for that reason, we encourage you to go for it! A true passion and excitement for making an impact is just as important as work experience.\nShould you require a reasonable accommodation in completing this application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please reach out to careers@stratadecision.com.\n\\n\nHere @ Strata…\nOur culture is driven by our people solving problems together. We embrace learning, collaboration, and continuous career growth. Together, we lift our customers, our products, our company, and our community.\n\\n\nWe believe that each of our team member's unique perspectives and experiences is what drives innovation and positive change. Our individual differences are what make us a more forward-thinking organization. We foster a culture of inclusion, equity and belonging, regardless of race, religion, disability, sex, sexual orientation, gender identity or national origin.\nOur Core Values:\nWhile we celebrate what makes each member of our team unique, our core values are what connect us. They set clear expectations for how we approach our work and how each of us can positively influence the experience of our team and our customers.\n\\n\n\\n\nWe connect with positive intent.\n\\n\nWe are helpful.\n\\n\nWe own it.\n\\n\nWe get better every day.\n\\n\nWe are humble.\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=15022abaa5c008e2&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflmfhii8qp835&spon=0&xkcb=SoAz67M3pvjWLbWEiJ0AbzkdCdPP&xfps=2c52d3a1-9e70-4207-b58d-b5fae5469b22&vjfrom=vjs&asub=mob&astse=80d26ee2898dbab1&assa=4822"
}