{
  "filename": "page2_job13_Analyst__Quantitative_Insight.html",
  "job_title": "Analyst, Quantitative Insight",
  "company": "Hall and Partners",
  "location": "Chicago, IL 60601•Hybrid work",
  "salary": "$65,000 - $72,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:31:51.240Z",
  "full_description": "\\n\n\\n\nWho we are\nHall & Partners is a team of unconventional thinkers, obsessed with how marketing influences the relationship between people, brands and culture. Born out of ad land, we are the insight agency known for weaving creativity with science.\n\\n\nWe distill data through a strategic lens to deliver differentiated and actionable insights that help brands grow - human truths tailored to individual brands, not black box data available to the masses. We partner with clients to shape brand strategy and optimize brand and campaign performance. Our award-winning approach amplifies insights across every business area, propelling marketing decision-making to create an unmatched competitive advantage.\n\\n\nHall & Partners is a custom, consultative insight agency that specializes in brand strategy, brand performance measurement, and campaign performance research.\n\\n\nRole Overview – Analyst, Quantitative Insight\nWe have an exciting opportunity for an Analyst to join our quantitative team. You’ll be working across a portfolio of accounts that range in size and complexity, involved in the day-to-day execution of insights projects and running analyses that shape decision making for leading brands. We’d love someone with a passion for understanding people, brands and marketing, and a keen interest to expand their skills in all types of research techniques and solutions. You’ll need to have strong attention to detail, interest in working with and interpreting large data-sets, and excellent organizational skills to respond to a wide range of requests and challenges.\n\\n\nLocation – US: Chicago (Hybrid role - 2 days in office)\n\\n\nThe salary range for this position is $65,000 - $72,000. If this is not the right range for you, please check out our other opportunities.\n\\n\nResponsibilities:\n\\n\n\\n\nThe Analyst, Quantitative Insight contributes to projects that deliver fresh insight to get to the heart of client questions, shaping their brand strategy and marketing action\n\\n\nYou will build positive day-to-day client relationships, anticipating and addressing project needs. You are curious and ask the right questions, immersing yourself in our clients business and contributing to work that delivers insight that has an impact on client decision making.\n\\n\nAs an Analyst you will build knowledge of the breadth of work we do for our clients and what else we could do for them, proactively sharing ideas for new opportunities with the team.\n\\n\nYou will develop your research skills in areas such as questionnaire design, data checking, and use of data analysis packages. You will grow a good understanding of analysis and analytics techniques and different data and insight sources, including primary/survey and non-survey data. You will work with the team to run insights projects from start to finish, managing timelines, and ensuring accuracy of data and deliverables.\n\\n\nAs an Analyst you are an active contributor – you manage the day-to-day running of projects, building strong working relationships with other team members and suppliers/vendors, and coming to the team with solutions as well as questions.\n\\n\nThe Hall & Partner values are all about being Creative, Curious, Courageous and Collaborative, all grounded in a strong Community. We expect all our people to demonstrate and work by these values every day.\n\\n\n\\n\nQualifications:\n\\n\n\\n\nMust have a Bachelor degree in a related field. We are open to a variety of backgrounds including people with a passion for marketing, analytics, digital, social media, mobile, semiotics, human behavior and psychology.\n\\n\nMust have academic and/or practical experience with survey or market research methodologies\n\\n\nThis role will use a Dynata software product called MarketSight to analyze data. Prior experience with a similar data analysis software is highly preferred (e.g. SPSS, or Qualtrics).\n\\n\nStrong attention to details.\n\\n\nStrong time management skills.\n\\n\nStrong communication skills - both written and verbal.\n\\n\nHighly motivated and driven, with a hunger to learn and grow.\n\\n\nAnticipates team needs and proactively takes initiative on their own.\n\\n\nAble to travel occasionally as the job requires.\n\\n\n\\n\nWhat we offer you\nWe believe we have a unique culture. It’s a difficult thing to put into words but it’s all about being challenging yet treating each other with respect. We are naturally curious, and we love to learn and discover new things.\nWe nurture opinions and really respect people who have a point of view and aren’t afraid to share their thinking. We work as teams and responsibilities sit with everyone in that team, whatever their job title. A can-do attitude goes a long way in our business, and we don't tolerate egos!\n\\n\nWe are passionate about helping our people to learn, stretch and grow. We want this to be a place where people feel challenged, as well as guided and supported. When you are not learning from some of the smartest people in insight, you can also take advantage of our Learn training program and attend interactive training sessions and “OutsideIn” sessions with industry experts, that build your skills for the future.\n\\n\nUS Benefits\n\\n\nWe want our people to feel rewarded for the great work they do. Here are some of the benefits we offer.\n\\n\n\\n\nMedical, Dental, and Vision Insurance - Large carriers on a national level (domestic partner coverage included)\n\\n\n401k with Company Match – No vesting period; bi-weekly contributions\n\\n\nFlexible PTO - Feel no guilt in taking off a minimum of 3 weeks of “real” vacation time\n\\n\nPaid Parental Leave\n\\n\n12 Paid Company Holidays\n\\n\nHybrid work environment, mix of office and WFH\n\\n\nSalary Range for this position is $65,000 - $72,000\n\\n\n\\n\nHall & Partners is an equal opportunity employer and recognize the importance of a truly diverse workforce. Our teams possess a rich mixture of talent where everyone’s contribution is encouraged and valued\nWe maintain an Equal Opportunities, Diversity and Anti-Harassment Policy to inform, guide and encourage equal opportunities practices within the Company. We welcome applications from individuals regardless of age, gender, ethnicity, disability, sexuality, social background, religion and/or belief.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}