{
  "filename": "page4_job1_INSIGHTS_ANALYST__FH___QUALITY___PATIENT_SAFETY.html",
  "job_title": "INSIGHTS ANALYST, FH - QUALITY - PATIENT SAFETY",
  "company": "Froedtert Health",
  "location": "9200 W Wisconsin Ave, Milwaukee, WI 53226",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:35:18.062Z",
  "full_description": "\\n\n\\n\nDiscover. Achieve. Succeed.\n\\n\n#BeHere\n\\n\n\\n\n\\n\n\\n\n\\n\nLocation: US:WI:MILWAUKEE at our FROEDTERT HOSPITAL facility.\n\\n\n\\n\n\\n\n\\n\nThis job is HYBRID.\n\\n\n\\n\n\\n\n\\n\nFTE: 1.000000\n\\n\n\\n\n\\n\n\\n\nStandard Hours: 40.00\n\\n\n\\n\n\\n\n\\n\nShift: 1st shift 8 am to 4:30 pm\n\\n\n\\n\n\\n\nShift Details: Holidays: Weekends:\n\\n\n\\n\nJob Summary:\n\\n\n\\n\nThis role works effectively with healthcare operations and clinical areas to support data-driven decisions by developing reporting and analytics that provide accurate, insightful, and actionable data. Analyzes information and patterns to promote improvement initiatives and operational objectives.\n\\n\n\\n\n\\n\nEXPERIENCE DESCRIPTION:\n\\n\n\\n\n\\n\nA minimum of 1 year of directly related experience with projects that include descriptive analytics and dashboard/report design with visualizations.\n\\n\nStrong experience with a variety of Microsoft tools, preferred.\n\\n\n\\n\nEDUCATION DESCRIPTION:\n\\n\n\\n\nBachelors degree in Computer Science, Information Systems, Health Care Administration, Engineering or related field, or appropriate experience equivalent to a Bachelors degree, is required.\n\\n\n\\n\nSPECIAL SKILLS DESCRIPTION:\n\\n\n\\n\nWorking knowledge of healthcare operations, data sets, measurement methods, and terminology across a broad scope or targeted healthcare area, such as lab or radiology is preferred.\n\\n\n\\n\n\\n\nPerks & Benefits at Froedtert Health\n\\n\n\\n\nFroedtert Health Offers a variety of perks & benefits to staff, depending on your role you may be eligible for the following:\n\\n\n\\n\nPaid time off\n\\n\nGrowth opportunity- Career Pathways & Career Tuition Assistance, CEU opportunities\n\\n\nAcademic Partnership with the Medical College of Wisconsin\n\\n\nReferral bonuses\n\\n\nRetirement plan - 403b\n\\n\nMedical, Dental, Vision, Life Insurance, Short & Long Term Disability, Free Workplace Clinics\nEmployee Assistance Programs, Adoption Assistance, Healthy Contributions, Care@Work, Moving Assistance, Discounts on gym memberships, travel and other work life benefits available\\n\n\\n\n\\n\nThe Froedtert & the Medical College of Wisconsin regional health network is a partnership between Froedtert Health and the Medical College of Wisconsin supporting a shared mission of patient care, innovation, medical research and education. Our health network operates eastern Wisconsin's only academic medical center and adult Level I Trauma center engaged in thousands of clinical trials and studies. The Froedtert & MCW health network, which includes ten hospitals, nearly 2,000 physicians and more than 45 health centers and clinics draw patients from throughout the Midwest and the nation.\n\\n\n\\n\n\\n\nWe are proud to be an Equal Opportunity Employer who values and maintains an environment that attracts, recruits, engages and retains a diverse workforce. We welcome protected veterans to share their priority consideration status with us at 262-439-1961. We maintain a drug-free workplace and perform pre-employment substance abuse testing. During your application and interview process, if you have a need that requires an accommodation, please contact us at 262-439-1961. We will attempt to fulfill all reasonable accommodation requests.\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=2b6d8e503099657b&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfm0ebsjn1a8cm&spon=0&xkcb=SoAn67M3pvkOCiyJaB0KbzkdCdPP&xfps=5940b623-90e1-4ceb-98a4-f3f459f49e73&vjfrom=vjs&asub=mob&astse=eb06fd0322c77991&assa=8378"
}