{
  "filename": "page2_job14_Data_Analyst_II.html",
  "job_title": "Data Analyst II",
  "company": "Katalyst Healthcares & Life Sciences",
  "location": "Mettawa, IL 60045",
  "salary": null,
  "job_type": "Contract",
  "scraped_at": "2025-12-27T10:31:56.972Z",
  "full_description": "\\n\n\\n\nJob description:\nThe international pricing excellence team is responsible for maintaining systems and tools in compliance with the current pricing policy as well as being a central hub for pricing and reimbursement of data to help drive decision making. This role is responsible for supporting our pricing systems through issue resolution, data verification, enhancement testing, and collaborating with cross-functional stakeholders.\nResponsibilities:\n\\n\n\\n\nTrack systems help desk tickets submitted and resolutions.\n\\n\nHigh level trouble shooting and issue investigation.\n\\n\nCollaborate with Business Technology System (BTS) function regarding issue resolution.\n\\n\nProvide status updates to the business team on issues & enhancements.\n\\n\nVerify/test system fixes.\n\\n\nProvide system operations support to keep business decisions workflows active.\n\\n\nConduct system verification to ensure accuracy of prices and monitor general health of the systems including but not limited to.\n\\n\nRunning price validation reports comparing internal and external data sources.\n\\n\nVerify pricing information is flowing through adequately with other internal systems and platforms.\n\\n\nConsolidate and report back observations back to relevant internal stakeholders to assess need for further actions or improvements.\n\\n\nRequirements:\n\\n\n\\n\nKnowledge of basic project management concepts and practices.\n\\n\nStrong organizational and communication skills.\n\\n\nAbility to work independently and as part of a team.\n\\n\nStrong troubleshooting and customer service skills.\n\\n\nAbility to prioritize tasks and manage time effectively.\n\\n\nUnderstanding or familiarity with operating systems or management of large sets of data.\n\\n\nTop Skills:\n\\n\n\\n\nStrong attention to detail.\n\\n\nKnowledge of basic project management concepts and practices.\n\\n\nStrong organizational and communication skills.\n\\n\nUnderstanding or familiarity with operating systems or management of large sets of data.\n\\n\nBasic knowledge of health care/pharma industry.\n\\n\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}