{
  "filename": "page1_job8_BUSINESS_ANALYST.html",
  "job_title": "BUSINESS ANALYST",
  "company": "Savvy Info Systems",
  "location": "Schaumburg, IL 60195",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:27:51.971Z",
  "full_description": "Job Description:\nAssist to elicit requirements for guidewire integration implementation. Establish acceptance criteria and execute traceable unit tests and provide quality software for acceptance for each sprint. Assist requirements definition for complex projects and multi-year strategic initiatives. Identify and translate business needs into clearly defined requirements and create documentation inclusive of business use cases, process flows, data flows, traceability matrices and report mock-ups. Plan, facilitate, and conduct requirements gathering sessions, Meetings and presentations. Assist in reviewing sessions for completed business/functional requirements with key business users focused on gaining consensus and final business approval. Build strong relationships within the business units and support functions to understand the business needs. Collaborate with development and testing teams to provide subject matter expertise, ensure that out of the box functionality is leveraged and assist in troubleshooting and resolving issues. Ensure that proposed solutions are focused on improving efficiency and effectiveness of the business processes, and are consistent across products where possible. Participate in the development and planning of the user acceptance testing activities, including test plans and scripts, based on requirements. Assist to facilitate UAT execution phase and work with business lead and project manager to obtain user acceptance test signoff. Travel: Temporary Travel required to client sites throughout the United States with expenses paid by the employer. Education: Bachelor’s degree or foreign equivalent in science or related field Certification on Business Analysis, Project Management Professional (PMP)®, Business Intelligence required.\n\\n\n\\n Location:\nTemporary Travel required to client sites throughout the United States with expenses paid by the employer.\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=263dc4cf1a4f5aaf&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflgg732dir0bv&spon=0&xkcb=SoCs67M3pvjN173YkZ0GbzkdCdPP&xfps=426f846f-0e75-4d24-bb1c-935e89937429&sjdu=wHj9_FWLFBNuml7ZvjtMGrKERpat0DZgecJSalalnFR-EKGQAw5vRSRKdk2a2rsc&vjfrom=vjs&asub=mob&astse=3ad6b3bf0067b873&assa=2234"
}