{
  "filename": "page3_job5_Business_Analyst.html",
  "job_title": "Business Analyst",
  "company": "Supernova Technology",
  "location": "Chicago, IL",
  "salary": "$60,000 - $80,000 a year",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:32:56.841Z",
  "full_description": "\\n\n\\n\nAbout Us\n\\n\n\\n\n\\n  Founded in 2014, we offer the industry’s first and only cloud-based, fully-customizable, end-to-end software solution to automate securities-based lending from origination through the life of the loan. By combining thought leadership in suitability and risk management with industry-leading education and the latest technology, Supernova enables advisors to deliver holistic, goals-based advice and to help their clients achieve financial wellness. We partner with the industry’s largest banks, most prominent insurance companies and leading online brokerages to democratize access to securities-based lending and better the entire financial ecosystem.\\n\n\\n\n\\n\n\\n\nWhy Join Supernova?\n\\n\n\\n\n\\n  At Supernova Technology, we believe that the best results come from a team that is passionate, driven, and supported in all aspects of their professional lives. Here, you’ll work alongside talented and innovative individuals who are committed to driving the future of securities-based lending technology. We foster a culture of collaboration, continuous learning, and growth, where each person’s contributions make a real impact.\\n\n\\n\n\\n\n\\n\nJob Description\n\\n\n\\n\n\\n  We are looking for a business analyst to support project managers on securities-based lending system development. The goal is to ensure that the projects are implemented successfully in all aspects and delivered timely with high quality.\\n\n\\n\nRESPONSIBILITIES:\n\\n\n\\n\nNegotiate with clients on product requirements & development scale\n\\n\nWork closely with the development team on product logic and features\n\\n\nManage the schedule of development projects with JIRA to ensure timely release of the product\n\\n\nDesign product prototypes based on product requirements and present to clients\n\\n\nGenerate supporting documents to accompany product changes\n\\n\nProvide quality assurance support for products in testing environments and troubleshoot system bugs\n\\n\nGive periodic technology product demonstrations to sales, marketing and operations teams as internal training\n\\n\n\\n\nQUALIFICATIONS:\n\\n\n\\n\nBachelor’s or Master's Degree in finance, project management or technology related fields\n\\n\nAt least 1 year experience in Program Analytics or related field preferred\n\\n\nHighly analytical and quantitative thinking\n\\n\nStrong written and verbal communication skills\n\\n\nSelf-starter with high level of motivation\n\\n\nReceptive to coaching and adaptive to change\n\\n\nExceptional time management and follow-up skills\n\\n\nTeam-oriented\n\\n\nProficient in MS Office Suite, especially Microsoft Excel and Microsoft PowerPoint\n\\n\nExperience in data interpretation preferred\n\\n\nExperience in project management preferred\n\\n\nExperience in financial services, wealth management, or education industries preferred\n\\n\n\\n\n\\n\nOur Employee Benefits\n\\n\n\\n\n\\n  At Supernova Technology, we provide a robust benefits package to support the health and well-being of our employees. Our offerings include:\\n\n\\n\n\\n\n\\n\nMedical, Dental, and Vision Insurance:\nMultiple plans with coverage for employees and dependents.\\n\n\\n\n\\n\nHSA and FSA Accounts:\nTax-advantaged accounts for health and dependent care expenses.\\n\n\\n\n\\n\nLife and Disability Insurance:\nEmployer-paid basic coverage with options for additional voluntary coverage.\\n\n\\n\n\\n\nCompensation:\n$60,000 - $80,000 per year\\n\n\\n\n\\n\nRetirement Savings:\n401(k) plan with employer contributions.\\n\n\\n\n\\n\nEmployee Assistance Program (EAP):\nConfidential support services, including free therapy sessions.\\n\n\\n\n\\n\nPaid Time Off:\nFlexible PTO policies.\\n\n\\n\n\\n\nAdditional Perks:\nCommuter benefits, pet insurance, continuing education assistance, and more.\\n\n\\n\n\\n\n\\n\nNote: Actual salary at the time of hire may vary and may be above or below the range based on various factors, including but not limited to, the candidate's relevant qualifications, skills and experience, and the location where this position may be filled.\\n\n\\n\n\\n\n\\n\nOur Core Values\n\\n\n\\n\n\\n  Our core values drive everything we do. At Supernova, we...\\n\n\\n\n\\n\n\\n\nForm, execute, and communicate new ideas that add value to our employees and customers\\n\n\\n\n\\n  Strive through obstacles and failures\\n\n\\n\n\\n  Follow-through on promises or commitments to others, accept responsibility, and answer for actions & decisions\\n\n\\n\n\\n  Listen to, understand, and support our employees and customers\\n\n\\n\n\\n  Act with speed, positive attitude, and flexibility\\n\n\\n\n\\n  Exceed expectations and surpass ourselves every day; we embrace a sense of pride and never stop growing\\n\n\\n\n\\n\n\\n\nJoin us and make an impact while growing your career at Supernova.\n\\n\n\\n\nWe may use artificial intelligence (AI) tools to support parts of the hiring process, such as reviewing applications, analyzing resumes, or assessing responses. These tools assist our recruitment team but do not replace human judgment. Final hiring decisions are ultimately made by humans. If you would like more information about how your data is processed, please contact us.\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}