{
  "filename": "page3_job8_Business_Research_Analysts__Two_Openings_.html",
  "job_title": "Business Research Analysts (Two Openings)",
  "company": "Radiss Tech Services",
  "location": "Schaumburg, IL",
  "salary": null,
  "job_type": null,
  "scraped_at": "2025-12-27T10:33:30.570Z",
  "full_description": "\\n\n\\n\n\\n\n\\n\n\\n\n\\n\nJob Duties:\n\\n\nThe duties involve supervision of projects and functions only, not personnel. Individuals will use standard occupational tools and knowledge to perform the listed job duties. Formulate and apply optimizing methods to develop and interpret information that assists management with decision making, policy formulation, and marketing functions by applying skills in the fluid nature of roles for a variety of project methodologies, including agile, waterfall, and iterative. Work with scrum product owners to develop epics and stories. Conduct requirements analysis via information gathering sessions with business users and technical staff, workshops and meetings to define business requirements. Develop supporting process flows. Partner closely with user experience analysts and designers to provide scalable user interfaces, and with quality assurance and development to provide guidance and support during the development and testing phases. Create test plan and test cases from Business Requirement documents and user stories. Use various tools properly, including defect tracking, test case definition tracking and test case execution tracking. Proactively communicate and collaborate with external and internal customers to analyze information needs and functional requirements and assume responsibility for improving processes and procedures. As assigned, perform other duties normally associated with this occupation.\n\\n\nMinimum requirements:\n\\n\nMBA or related graduate degree with a major providing the required knowledge and abilities, plus one year of related experience in jobs providing the required skills and abilities. Any suitable combination of education, training or experience is acceptable. The term suitable, in this context, means substantial compatibility with stated academic level and experience requirements, and with ability to perform job duties.\n\\n\nAdditional Information:\n\\n\nNo travel or telecommuting. Job duties are project-based and performed on long-term assignments at various unanticipated sites in the U.S. which may require relocation at the end of the project.\n\\n\nSend resumes to:\nhr@radiss.com\nNo phone calls.\n\\n\n\\n\n\\n\n\\n\n\\n\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=11c6616c430bd5bb&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdflr5mlj72i8c2&spon=0&xkcb=SoAt67M3pvjjZ8QpQ50MbzkdCdPP&xfps=d5795271-2e05-490b-8005-bae0da10b109&sjdu=0rOzsSddWp4_oA7WQhAaI0jB5cUeKA94EwnhNudJVac&vjfrom=vjs&asub=mob&astse=4a5acba0d7c0f170&assa=932"
}