{
  "filename": "page4_job4_Associate__Business_Analyst___Tax_Global_Mobility_.html",
  "job_title": "Associate, Business Analyst - Tax Global Mobility Services",
  "company": "KPMG",
  "location": "200 E Randolph St, Chicago, IL 60601",
  "salary": null,
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:35:52.704Z",
  "full_description": "\\n\nAt KPMG, you can become an integral part of a dynamic team at one of the world's top tax firms. Enjoy a collaborative, future-forward culture that empowers your success. Work with KPMG's extensive network of specialists & enjoy access to our Ignition Centers, where deep industry knowledge merges with cutting-edge technologies to create innovative tax solutions. Join a diverse team helping high-profile clients understand, analyze, and respond to complex business opportunities and challenges. Develop your career through a range of multifaceted engagements, formal training, and informal mentoring. At KPMG, we believe nothing is more important than investing in our culture because it's an investment in our people, our future, and what we stand for as a firm\n\\n\nKPMG is currently seeking an Associate to join our Global Mobility Services (GMS) practice.\n\\n\nResponsibilities:\n\\n\n\\n\nElicit, gather, document and communicate requirements on GMS business efforts; Communicate and negotiate with team on efforts\n\\n\nUtilize tools such as Office, Visio, Access, SQL, for project delivery\n\\n\nCommunicate information within the effort (project team, stakeholders and sponsors) and through analysis to Executive Leadership\n\\n\nBuild relationships through assignments on individual efforts; seek and build relationships to enhance delivery and to better understand, identify and work through issues across efforts\n\\n\nResponsible for maintaining skills within the profession and for assessment of effort needs and completing business analysis deliverables appropriate for an effort\n\\n\nUnderstand and adhere to IT policies and procedures; work with teams and Analysis Services team members to ensure adherence on individual efforts; expected to understand, identify and work through issues across efforts\n\\n\n\\n\nQualifications:\n\\n\n\\n\nMinimum of one year of experience in System Implementation, International Human Resources, or International Tax\n\\n\nBachelors degree from an accredited college/university\n\\n\nDemonstrated high level of capability with multi-tasking and time management\n\\n\nExperience and knowledge of expatriate services and tax is preferred\n\\n\nExcellent written and verbal communications skills\n\\n\nStrong quantitative and analytic skills are essential\n\\n\n\\n\n\\n\n\\n   KPMG LLP and its affiliates and subsidiaries (“KPMG”) complies with all local/state regulations regarding displaying salary ranges. If required, the ranges displayed below or via the URL below are specifically for those potential hires who will work in the location(s) listed. Any offered salary is determined based on relevant factors such as applicant's skills, job responsibilities, prior relevant experience, certain degrees and certifications and market considerations. In addition, KPMG is proud to offer a comprehensive, competitive benefits package, with options designed to help you make the best decisions for yourself, your family, and your lifestyle. Available benefits are based on eligibility. Our Total Rewards package includes a variety of medical and dental plans, vision coverage, disability and life insurance, 401(k) plans, and a robust suite of personal well-being benefits to support your mental health. Depending on job classification, standard work hours, and years of service, KPMG provides Personal Time Off per fiscal year. Additionally, each year KPMG publishes a calendar of holidays to be observed during the year and provides eligible employees two breaks each year where employees will not be required to use Personal Time Off; one is at year end and the other is around the July 4th holiday. Additional details about our benefits can be found towards the bottom of our KPMG US Careers site at Benefits & How We Work.\\n\n\\n\n\\n\n\\n\nFollow this link to obtain salary ranges by city outside of CA:\\n\n\\n\nhttps://kpmg.com/us/en/how-we-work/pay-transparency.html/?id=M301B_6_25\n\\n\nKPMG offers a comprehensive compensation and benefits package. KPMG is an equal opportunity employer. KPMG complies with all applicable federal, state and local laws regarding recruitment and hiring. All qualified applicants are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, citizenship status, disability, protected veteran status, or any other category protected by applicable federal, state, or local laws. The attached link contains further information regarding KPMG's compliance with federal, state and local recruitment and hiring laws. No phone calls or agencies please.\n\\n\nKPMG recruits on a rolling basis. Candidates are considered as they apply, until the opportunity is filled. Candidates are encouraged to apply expeditiously to any role(s) for which they are qualified that is also of interest to them.\n\\n\nLos Angeles County applicants: Material job duties for this position are listed above. Criminal history may have a direct, adverse, and negative relationship with some of the material job duties of this position. These include the duties and responsibilities listed above, as well as the abilities to adhere to company policies, exercise sound judgment, effectively manage stress and work safely and respectfully with others, exhibit trustworthiness, and safeguard business operations and company reputation. Pursuant to the California Fair Chance Act, Los Angeles County Fair Chance Ordinance for Employers, Fair Chance Initiative for Hiring Ordinance, and San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\n\\n",
  "apply_method": "external_apply",
  "apply_url": "https://www.indeed.com/applystart?jk=2b9fe54bf6af3583&from=vj&pos=bottom&mvj=0&jobsearchTk=1jdfm0ebsjn1a8cm&spon=0&xkcb=SoCA67M3pvkOCiyJaB0PbzkdCdPP&xfps=d63ac9d4-51c4-4953-82c8-8b42667be79a&vjfrom=vjs&asub=mob&astse=6586aa9cb91571e1&assa=3009"
}