{
  "filename": "page4_job10_Clinical_Data_Analyst___Same_Day_Surgery_Observati.html",
  "job_title": "Clinical Data Analyst – Same Day Surgery/Observation Coder",
  "company": "The University of Chicago Medicine",
  "location": "5841 South Indiana Avenue, Chicago, IL 60637",
  "salary": "$39.34 - $50.66 an hour",
  "job_type": "Full-time",
  "scraped_at": "2025-12-27T10:37:01.149Z",
  "full_description": "\\n Job Description: \\n\n\\n  Be a part of a world-class academic health-care system at\nUChicago Medicine\nas a\nClinical Data Analyst – Same Day Surgery/Observation Coder\n.\nThis is a remote, work from home opportunity and you may be based outside of the greater Chicagoland area.\\n\n\\n\n\\n\n\\n\nIn this role, the Clinical Data Analyst – Same Day Surgery/Observation Coder, under general direction, is responsible for coding and abstracting diagnoses and procedures from inpatient and outpatient medical records for optimal and timely reimbursement and quality reporting.\\n\n\\n\nEssential Job Functions\n\\n\n\\n\nAssigns ICD-10-CM/PCS codes and assigns DRGs for inpatient medical records accounts; assigns ICD-10-CM/PCS codes and CPT codes for outpatient medical record accounts\n\\n\nAbstracts key data elements required for billing\n\\n\nReviews records for clinical pertinence\n\\n\nInteracts with providers for clarification of documentation/education\n\\n\nAbstracts and codes records, for patient currently in the Hospitals, for interim billing purposes\n\\n\nReviews records according to pre-established criteria for referral to physician reviewers\n\\n\nCommunicates with the medical staff to ensure appropriate assignment of principal and secondary diagnoses and procedures\n\\n\nMaintains CE credits in accordance with the American Health Information Management Association's requirements\n\\n\n\\n\nRequired Qualifications\n\\n\n\\n\nAssociate or bachelor's degree\n\\n\nCertification as a Registered Health Information Technician (RHIT), Registered Health Information Administrator (RHIA) or Certified Coding Specialist (CCS)\n\\n\nMust have thorough working knowledge of ICD-10CM/PCS and CPT coding systems, DRG systems and federal/state regulations regarding reimbursement\n\\n\nMust have a thorough working knowledge of the hospital information system, electronic medical record systems and encoder; must have working knowledge of JCAHO standards for chart completion\n\\n\nMust have a working knowledge of medical-legal rules and regulations that govern the confidentiality and release of medical information with the ability to interpret and implement the standards; must maintain total confidentiality of all patient records; and PC experience\n\\n\n\\n\nPosition Details\n\\n\n\\n\nJob Type/FTE: Full Time (1.00 FTE)\n\\n\nShift: Days – 8-Hour Shift\n\\n\nLocation: Remote\n\\n\nUnit/Department: Medical Records\n\\n\nCBA Code: 743 Clerical\n\\n\nWhy Join Us: \\n\n\\n\nWe’ve been at the forefront of medicine since 1899. We provide superior healthcare with compassion, always mindful that each patient is a person, an individual. To accomplish this, we need employees with passion, talent and commitment… with patients and with each other. We’re in this together: working to advance medical innovation, serve the health needs of the community, and move our collective knowledge forward. If you’d like to add enriching human life to your profile, UChicago Medicine is for you. Here at the forefront, we’re doing work that really matters. Join us. Bring your passion.\n\\n\n\\n\n\\n\n\\n\nUChicago Medicine is growing; discover how you can be a part of this pursuit of excellence at:\nUChicago Medicine Career Opportunities\n\\n\n\\n\n\\n\n\\n\nUChicago Medicine is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, ethnicity, ancestry, sex, sexual orientation, gender identity, marital status, civil union status, parental status, religion, national origin, age, disability, veteran status and other legally protected characteristics.\n\\n\n\\n\n\\n\n\\n\nAs a condition of employment, all employees are required to complete a pre-employment physical, background check, drug screening, and comply with the flu vaccination requirements prior to hire. Medical and religious exemptions will be considered for flu vaccination consistent with applicable law.\n\\n\n\\n\n\\n\n\\n\nCompensation & Benefits Overview\n\\n\n\\n\n\\n\n\\n\nUChicago Medicine is committed to transparency in compensation and benefits. The pay range provided reflects the anticipated wage or salary reasonably expected to be offered for the position.\n\\n\n\\n\n\\n\n\\n\nThe pay range is based on a full-time equivalent (1.0 FTE) and is reflective of current market data, reviewed on an annual basis. Compensation offered at the time of hire will vary based on candidate qualifications and experience and organizational considerations, such as internal equity. Pay ranges for employees subject to Collective Bargaining Agreements are negotiated by the medical center and their respective union.\n\\n\n\\n\n\\n\n\\n\nReview the full complement of benefit options for eligible roles at\nBenefits - UChicago Medicine\n.\n\\n\n\\n",
  "apply_method": "indeed_apply",
  "apply_url": null
}